#pragma once

/**
 * Name: Hydroneer
 * Version: 2.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.Owchie
	 */
	struct ABP_GameCharacter_C_Owchie_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.CameraShake
	 */
	struct ABP_GameCharacter_C_CameraShake_Params
	{
	public:
		E_CameraShakes_E_CameraShakes                              Selection;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.ToggleDropDecal
	 */
	struct ABP_GameCharacter_C_ToggleDropDecal_Params
	{
	public:
		class UStaticMeshComponent*                                ValidMeshIfTrue;                                         // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.PlaySoundJump
	 */
	struct ABP_GameCharacter_C_PlaySoundJump_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.FootstepWood
	 */
	struct ABP_GameCharacter_C_FootstepWood_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.FootstepDirt
	 */
	struct ABP_GameCharacter_C_FootstepDirt_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.FootstepWater
	 */
	struct ABP_GameCharacter_C_FootstepWater_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.ExplosionTimeLine__FinishedFunc
	 */
	struct ABP_GameCharacter_C_ExplosionTimeLine__FinishedFunc_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.ExplosionTimeLine__UpdateFunc
	 */
	struct ABP_GameCharacter_C_ExplosionTimeLine__UpdateFunc_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.Timeline_0__FinishedFunc
	 */
	struct ABP_GameCharacter_C_Timeline_0__FinishedFunc_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.Timeline_0__UpdateFunc
	 */
	struct ABP_GameCharacter_C_Timeline_0__UpdateFunc_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_Jump_K2Node_InputActionEvent_6
	 */
	struct ABP_GameCharacter_C_InpActEvt_Jump_K2Node_InputActionEvent_6_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_Jump_K2Node_InputActionEvent_5
	 */
	struct ABP_GameCharacter_C_InpActEvt_Jump_K2Node_InputActionEvent_5_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_Crouch_K2Node_InputActionEvent_4
	 */
	struct ABP_GameCharacter_C_InpActEvt_Crouch_K2Node_InputActionEvent_4_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_Crouch_K2Node_InputActionEvent_3
	 */
	struct ABP_GameCharacter_C_InpActEvt_Crouch_K2Node_InputActionEvent_3_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_Sprint_K2Node_InputActionEvent_2
	 */
	struct ABP_GameCharacter_C_InpActEvt_Sprint_K2Node_InputActionEvent_2_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_Sprint_K2Node_InputActionEvent_1
	 */
	struct ABP_GameCharacter_C_InpActEvt_Sprint_K2Node_InputActionEvent_1_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.ReceiveBeginPlay
	 */
	struct ABP_GameCharacter_C_ReceiveBeginPlay_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpAxisEvt_MouseRight_K2Node_InputAxisEvent_4
	 */
	struct ABP_GameCharacter_C_InpAxisEvt_MouseRight_K2Node_InputAxisEvent_4_Params
	{
	public:
		float                                                      AxisValue;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpAxisEvt_MouseUp_K2Node_InputAxisEvent_3
	 */
	struct ABP_GameCharacter_C_InpAxisEvt_MouseUp_K2Node_InputAxisEvent_3_Params
	{
	public:
		float                                                      AxisValue;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.ExplosionVignette
	 */
	struct ABP_GameCharacter_C_ExplosionVignette_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.NukeVignette
	 */
	struct ABP_GameCharacter_C_NukeVignette_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.FlyingHatVertTimer
	 */
	struct ABP_GameCharacter_C_FlyingHatVertTimer_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpAxisEvt_MoveForward_K2Node_InputAxisEvent_1
	 */
	struct ABP_GameCharacter_C_InpAxisEvt_MoveForward_K2Node_InputAxisEvent_1_Params
	{
	public:
		float                                                      AxisValue;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpAxisEvt_MoveRight_K2Node_InputAxisEvent_2
	 */
	struct ABP_GameCharacter_C_InpAxisEvt_MoveRight_K2Node_InputAxisEvent_2_Params
	{
	public:
		float                                                      AxisValue;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.ReceivePossessed
	 */
	struct ABP_GameCharacter_C_ReceivePossessed_Params
	{
	public:
		class AController*                                         NewController;                                           // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.FOVChanged
	 */
	struct ABP_GameCharacter_C_FOVChanged_Params
	{
	public:
		float                                                      NewValue;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InvertMouseYChanged
	 */
	struct ABP_GameCharacter_C_InvertMouseYChanged_Params
	{
	public:
		bool                                                       NewValue;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.HeadbobChanged
	 */
	struct ABP_GameCharacter_C_HeadbobChanged_Params
	{
	public:
		bool                                                       NewValue;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.FlashCollision
	 */
	struct ABP_GameCharacter_C_FlashCollision_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.ExecuteUbergraph_BP_GameCharacter
	 */
	struct ABP_GameCharacter_C_ExecuteUbergraph_BP_GameCharacter_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
