#pragma once

/**
 * Name: Hydroneer
 * Version: 2.0N
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Enums
	// --------------------------------------------------
	/**
	 * Enum Engine.ETextGender
	 */
	enum class ETextGender : uint8_t
	{
		Masculine = 0x0000000000000000,
		Feminine  = 0x0000000000000001,
		Neuter    = 0x0000000000000002,
		MAX       = 0x0000000000000003
	};

	/**
	 * Enum Engine.EFormatArgumentType
	 */
	enum class EFormatArgumentType : uint8_t
	{
		Int    = 0x0000000000000000,
		UInt   = 0x0000000000000001,
		Float  = 0x0000000000000002,
		Double = 0x0000000000000003,
		Text   = 0x0000000000000004,
		Gender = 0x0000000000000005,
		MAX    = 0x0000000000000006
	};

	/**
	 * Enum Engine.EEndPlayReason
	 */
	enum class EEndPlayReason : uint8_t
	{
		Destroyed        = 0x0000000000000000,
		LevelTransition  = 0x0000000000000001,
		EndPlayInEditor  = 0x0000000000000002,
		RemovedFromWorld = 0x0000000000000003,
		Quit             = 0x0000000000000004,
		MAX              = 0x0000000000000005
	};

	/**
	 * Enum Engine.ETickingGroup
	 */
	enum class ETickingGroup : uint8_t
	{
		TG_PrePhysics     = 0x0000000000000000,
		TG_StartPhysics   = 0x0000000000000001,
		TG_DuringPhysics  = 0x0000000000000002,
		TG_EndPhysics     = 0x0000000000000003,
		TG_PostPhysics    = 0x0000000000000004,
		TG_PostUpdateWork = 0x0000000000000005,
		TG_LastDemotable  = 0x0000000000000006,
		TG_NewlySpawned   = 0x0000000000000007,
		TG_MAX            = 0x0000000000000008
	};

	/**
	 * Enum Engine.EComponentCreationMethod
	 */
	enum class EComponentCreationMethod : uint8_t
	{
		Native                   = 0x0000000000000000,
		SimpleConstructionScript = 0x0000000000000001,
		UserConstructionScript   = 0x0000000000000002,
		Instance                 = 0x0000000000000003,
		MAX                      = 0x0000000000000004
	};

	/**
	 * Enum Engine.ETemperatureSeverityType
	 */
	enum class ETemperatureSeverityType : uint8_t
	{
		Unknown       = 0x0000000000000000,
		Good          = 0x0000000000000001,
		Bad           = 0x0000000000000002,
		Serious       = 0x0000000000000003,
		Critical      = 0x0000000000000004,
		NumSeverities = 0x0000000000000005,
		MAX           = 0x0000000000000006
	};

	/**
	 * Enum Engine.EQuartzCommandQuantization
	 */
	enum class EQuartzCommandQuantization : uint8_t
	{
		Bar                  = 0x0000000000000000,
		Beat                 = 0x0000000000000001,
		ThirtySecondNote     = 0x0000000000000002,
		SixteenthNote        = 0x0000000000000003,
		EighthNote           = 0x0000000000000004,
		QuarterNote          = 0x0000000000000005,
		HalfNote             = 0x0000000000000006,
		WholeNote            = 0x0000000000000007,
		DottedSixteenthNote  = 0x0000000000000008,
		DottedEighthNote     = 0x0000000000000009,
		DottedQuarterNote    = 0x000000000000000A,
		DottedHalfNote       = 0x000000000000000B,
		DottedWholeNote      = 0x000000000000000C,
		SixteenthNoteTriplet = 0x000000000000000D,
		EighthNoteTriplet    = 0x000000000000000E,
		QuarterNoteTriplet   = 0x000000000000000F,
		HalfNoteTriplet      = 0x0000000000000010,
		Tick                 = 0x0000000000000011,
		Count                = 0x0000000000000012,
		MAX                  = 0x0000000000000013
	};

	/**
	 * Enum Engine.EQuartzCommandDelegateSubType
	 */
	enum class EQuartzCommandDelegateSubType : uint8_t
	{
		CommandOnFailedToQueue = 0x0000000000000000,
		CommandOnQueued        = 0x0000000000000001,
		CommandOnCanceled      = 0x0000000000000002,
		CommandOnAboutToStart  = 0x0000000000000003,
		CommandOnStarted       = 0x0000000000000004,
		Count                  = 0x0000000000000005,
		MAX                    = 0x0000000000000006
	};

	/**
	 * Enum Engine.EAudioComponentPlayState
	 */
	enum class EAudioComponentPlayState : uint8_t
	{
		Playing   = 0x0000000000000000,
		Stopped   = 0x0000000000000001,
		Paused    = 0x0000000000000002,
		FadingIn  = 0x0000000000000003,
		FadingOut = 0x0000000000000004,
		Count     = 0x0000000000000005,
		MAX       = 0x0000000000000006
	};

	/**
	 * Enum Engine.EPlaneConstraintAxisSetting
	 */
	enum class EPlaneConstraintAxisSetting : uint8_t
	{
		Custom                  = 0x0000000000000000,
		X                       = 0x0000000000000001,
		Y                       = 0x0000000000000002,
		Z                       = 0x0000000000000003,
		UseGlobalPhysicsSetting = 0x0000000000000004,
		MAX                     = 0x0000000000000005
	};

	/**
	 * Enum Engine.EInterpToBehaviourType
	 */
	enum class EInterpToBehaviourType : uint8_t
	{
		OneShot         = 0x0000000000000000,
		OneShot_Reverse = 0x0000000000000001,
		Loop_Reset      = 0x0000000000000002,
		PingPong        = 0x0000000000000003,
		MAX             = 0x0000000000000004
	};

	/**
	 * Enum Engine.ETeleportType
	 */
	enum class ETeleportType : uint8_t
	{
		None            = 0x0000000000000000,
		TeleportPhysics = 0x0000000000000001,
		ResetPhysics    = 0x0000000000000002,
		MAX             = 0x0000000000000003
	};

	/**
	 * Enum Engine.EPlatformInterfaceDataType
	 */
	enum class EPlatformInterfaceDataType : uint8_t
	{
		PIDT_None   = 0x0000000000000000,
		PIDT_Int    = 0x0000000000000001,
		PIDT_Float  = 0x0000000000000002,
		PIDT_String = 0x0000000000000003,
		PIDT_Object = 0x0000000000000004,
		PIDT_Custom = 0x0000000000000005,
		PIDT_MAX    = 0x0000000000000006
	};

	/**
	 * Enum Engine.EMovementMode
	 */
	enum class EMovementMode : uint8_t
	{
		MOVE_None       = 0x0000000000000000,
		MOVE_Walking    = 0x0000000000000001,
		MOVE_NavWalking = 0x0000000000000002,
		MOVE_Falling    = 0x0000000000000003,
		MOVE_Swimming   = 0x0000000000000004,
		MOVE_Flying     = 0x0000000000000005,
		MOVE_Custom     = 0x0000000000000006,
		MOVE_MAX        = 0x0000000000000007
	};

	/**
	 * Enum Engine.ENetworkFailure
	 */
	enum class ENetworkFailure : uint8_t
	{
		NetDriverAlreadyExists   = 0x0000000000000000,
		NetDriverCreateFailure   = 0x0000000000000001,
		NetDriverListenFailure   = 0x0000000000000002,
		ConnectionLost           = 0x0000000000000003,
		ConnectionTimeout        = 0x0000000000000004,
		FailureReceived          = 0x0000000000000005,
		OutdatedClient           = 0x0000000000000006,
		OutdatedServer           = 0x0000000000000007,
		PendingConnectionFailure = 0x0000000000000008,
		NetGuidMismatch          = 0x0000000000000009,
		NetChecksumMismatch      = 0x000000000000000A,
		MAX                      = 0x000000000000000B
	};

	/**
	 * Enum Engine.ETravelFailure
	 */
	enum class ETravelFailure : uint8_t
	{
		NoLevel                     = 0x0000000000000000,
		LoadMapFailure              = 0x0000000000000001,
		InvalidURL                  = 0x0000000000000002,
		PackageMissing              = 0x0000000000000003,
		PackageVersion              = 0x0000000000000004,
		NoDownload                  = 0x0000000000000005,
		TravelFailure               = 0x0000000000000006,
		CheatCommands               = 0x0000000000000007,
		PendingNetGameCreateFailure = 0x0000000000000008,
		CloudSaveFailure            = 0x0000000000000009,
		ServerTravelFailure         = 0x000000000000000A,
		ClientTravelFailure         = 0x000000000000000B,
		MAX                         = 0x000000000000000C
	};

	/**
	 * Enum Engine.EScreenOrientation
	 */
	enum class EScreenOrientation : uint8_t
	{
		Unknown            = 0x0000000000000000,
		Portrait           = 0x0000000000000001,
		PortraitUpsideDown = 0x0000000000000002,
		LandscapeLeft      = 0x0000000000000003,
		LandscapeRight     = 0x0000000000000004,
		FaceUp             = 0x0000000000000005,
		FaceDown           = 0x0000000000000006,
		MAX                = 0x0000000000000007
	};

	/**
	 * Enum Engine.EApplicationState
	 */
	enum class EApplicationState : uint8_t
	{
		Unknown    = 0x0000000000000000,
		Inactive   = 0x0000000000000001,
		Background = 0x0000000000000002,
		Active     = 0x0000000000000003,
		MAX        = 0x0000000000000004
	};

	/**
	 * Enum Engine.EObjectTypeQuery
	 */
	enum class EObjectTypeQuery : uint8_t
	{
		ObjectTypeQuery1    = 0x0000000000000000,
		ObjectTypeQuery2    = 0x0000000000000001,
		ObjectTypeQuery3    = 0x0000000000000002,
		ObjectTypeQuery4    = 0x0000000000000003,
		ObjectTypeQuery5    = 0x0000000000000004,
		ObjectTypeQuery6    = 0x0000000000000005,
		ObjectTypeQuery7    = 0x0000000000000006,
		ObjectTypeQuery8    = 0x0000000000000007,
		ObjectTypeQuery9    = 0x0000000000000008,
		ObjectTypeQuery10   = 0x0000000000000009,
		ObjectTypeQuery11   = 0x000000000000000A,
		ObjectTypeQuery12   = 0x000000000000000B,
		ObjectTypeQuery13   = 0x000000000000000C,
		ObjectTypeQuery14   = 0x000000000000000D,
		ObjectTypeQuery15   = 0x000000000000000E,
		ObjectTypeQuery16   = 0x000000000000000F,
		ObjectTypeQuery17   = 0x0000000000000010,
		ObjectTypeQuery18   = 0x0000000000000011,
		ObjectTypeQuery19   = 0x0000000000000012,
		ObjectTypeQuery20   = 0x0000000000000013,
		ObjectTypeQuery21   = 0x0000000000000014,
		ObjectTypeQuery22   = 0x0000000000000015,
		ObjectTypeQuery23   = 0x0000000000000016,
		ObjectTypeQuery24   = 0x0000000000000017,
		ObjectTypeQuery25   = 0x0000000000000018,
		ObjectTypeQuery26   = 0x0000000000000019,
		ObjectTypeQuery27   = 0x000000000000001A,
		ObjectTypeQuery28   = 0x000000000000001B,
		ObjectTypeQuery29   = 0x000000000000001C,
		ObjectTypeQuery30   = 0x000000000000001D,
		ObjectTypeQuery31   = 0x000000000000001E,
		ObjectTypeQuery32   = 0x000000000000001F,
		ObjectTypeQuery_MAX = 0x0000000000000020,
		MAX                 = 0x0000000000000021
	};

	/**
	 * Enum Engine.EDrawDebugTrace
	 */
	enum class EDrawDebugTrace : uint8_t
	{
		None        = 0x0000000000000000,
		ForOneFrame = 0x0000000000000001,
		ForDuration = 0x0000000000000002,
		Persistent  = 0x0000000000000003,
		MAX         = 0x0000000000000004
	};

	/**
	 * Enum Engine.ETraceTypeQuery
	 */
	enum class ETraceTypeQuery : uint8_t
	{
		TraceTypeQuery1    = 0x0000000000000000,
		TraceTypeQuery2    = 0x0000000000000001,
		TraceTypeQuery3    = 0x0000000000000002,
		TraceTypeQuery4    = 0x0000000000000003,
		TraceTypeQuery5    = 0x0000000000000004,
		TraceTypeQuery6    = 0x0000000000000005,
		TraceTypeQuery7    = 0x0000000000000006,
		TraceTypeQuery8    = 0x0000000000000007,
		TraceTypeQuery9    = 0x0000000000000008,
		TraceTypeQuery10   = 0x0000000000000009,
		TraceTypeQuery11   = 0x000000000000000A,
		TraceTypeQuery12   = 0x000000000000000B,
		TraceTypeQuery13   = 0x000000000000000C,
		TraceTypeQuery14   = 0x000000000000000D,
		TraceTypeQuery15   = 0x000000000000000E,
		TraceTypeQuery16   = 0x000000000000000F,
		TraceTypeQuery17   = 0x0000000000000010,
		TraceTypeQuery18   = 0x0000000000000011,
		TraceTypeQuery19   = 0x0000000000000012,
		TraceTypeQuery20   = 0x0000000000000013,
		TraceTypeQuery21   = 0x0000000000000014,
		TraceTypeQuery22   = 0x0000000000000015,
		TraceTypeQuery23   = 0x0000000000000016,
		TraceTypeQuery24   = 0x0000000000000017,
		TraceTypeQuery25   = 0x0000000000000018,
		TraceTypeQuery26   = 0x0000000000000019,
		TraceTypeQuery27   = 0x000000000000001A,
		TraceTypeQuery28   = 0x000000000000001B,
		TraceTypeQuery29   = 0x000000000000001C,
		TraceTypeQuery30   = 0x000000000000001D,
		TraceTypeQuery31   = 0x000000000000001E,
		TraceTypeQuery32   = 0x000000000000001F,
		TraceTypeQuery_MAX = 0x0000000000000020,
		MAX                = 0x0000000000000021
	};

	/**
	 * Enum Engine.EMoveComponentAction
	 */
	enum class EMoveComponentAction : uint8_t
	{
		Move   = 0x0000000000000000,
		Stop   = 0x0000000000000001,
		Return = 0x0000000000000002,
		MAX    = 0x0000000000000003
	};

	/**
	 * Enum Engine.EQuitPreference
	 */
	enum class EQuitPreference : uint8_t
	{
		Quit       = 0x0000000000000000,
		Background = 0x0000000000000001,
		MAX        = 0x0000000000000002
	};

	/**
	 * Enum Engine.ERelativeTransformSpace
	 */
	enum class ERelativeTransformSpace : uint8_t
	{
		RTS_World           = 0x0000000000000000,
		RTS_Actor           = 0x0000000000000001,
		RTS_Component       = 0x0000000000000002,
		RTS_ParentBoneSpace = 0x0000000000000003,
		RTS_MAX             = 0x0000000000000004
	};

	/**
	 * Enum Engine.EAttachLocation
	 */
	enum class EAttachLocation : uint8_t
	{
		KeepRelativeOffset         = 0x0000000000000000,
		KeepWorldPosition          = 0x0000000000000001,
		SnapToTarget               = 0x0000000000000002,
		SnapToTargetIncludingScale = 0x0000000000000003,
		MAX                        = 0x0000000000000004
	};

	/**
	 * Enum Engine.EAttachmentRule
	 */
	enum class EAttachmentRule : uint8_t
	{
		KeepRelative = 0x0000000000000000,
		KeepWorld    = 0x0000000000000001,
		SnapToTarget = 0x0000000000000002,
		MAX          = 0x0000000000000003
	};

	/**
	 * Enum Engine.EDetachmentRule
	 */
	enum class EDetachmentRule : uint8_t
	{
		KeepRelative = 0x0000000000000000,
		KeepWorld    = 0x0000000000000001,
		MAX          = 0x0000000000000002
	};

	/**
	 * Enum Engine.EComponentMobility
	 */
	enum class EComponentMobility : uint8_t
	{
		Static     = 0x0000000000000000,
		Stationary = 0x0000000000000001,
		Movable    = 0x0000000000000002,
		MAX        = 0x0000000000000003
	};

	/**
	 * Enum Engine.EDetailMode
	 */
	enum class EDetailMode : uint8_t
	{
		DM_Low    = 0x0000000000000000,
		DM_Medium = 0x0000000000000001,
		DM_High   = 0x0000000000000002,
		DM_MAX    = 0x0000000000000003
	};

	/**
	 * Enum Engine.ECollisionChannel
	 */
	enum class ECollisionChannel : uint8_t
	{
		ECC_WorldStatic           = 0x0000000000000000,
		ECC_WorldDynamic          = 0x0000000000000001,
		ECC_Pawn                  = 0x0000000000000002,
		ECC_Visibility            = 0x0000000000000003,
		ECC_Camera                = 0x0000000000000004,
		ECC_PhysicsBody           = 0x0000000000000005,
		ECC_Vehicle               = 0x0000000000000006,
		ECC_Destructible          = 0x0000000000000007,
		ECC_EngineTraceChannel1   = 0x0000000000000008,
		ECC_EngineTraceChannel2   = 0x0000000000000009,
		ECC_EngineTraceChannel3   = 0x000000000000000A,
		ECC_EngineTraceChannel4   = 0x000000000000000B,
		ECC_EngineTraceChannel5   = 0x000000000000000C,
		ECC_EngineTraceChannel6   = 0x000000000000000D,
		ECC_GameTraceChannel1     = 0x000000000000000E,
		ECC_GameTraceChannel2     = 0x000000000000000F,
		ECC_GameTraceChannel3     = 0x0000000000000010,
		ECC_GameTraceChannel4     = 0x0000000000000011,
		ECC_GameTraceChannel5     = 0x0000000000000012,
		ECC_GameTraceChannel6     = 0x0000000000000013,
		ECC_GameTraceChannel7     = 0x0000000000000014,
		ECC_GameTraceChannel8     = 0x0000000000000015,
		ECC_GameTraceChannel9     = 0x0000000000000016,
		ECC_GameTraceChannel10    = 0x0000000000000017,
		ECC_GameTraceChannel11    = 0x0000000000000018,
		ECC_GameTraceChannel12    = 0x0000000000000019,
		ECC_GameTraceChannel13    = 0x000000000000001A,
		ECC_GameTraceChannel14    = 0x000000000000001B,
		ECC_GameTraceChannel15    = 0x000000000000001C,
		ECC_GameTraceChannel16    = 0x000000000000001D,
		ECC_GameTraceChannel17    = 0x000000000000001E,
		ECC_GameTraceChannel18    = 0x000000000000001F,
		ECC_OverlapAll_Deprecated = 0x0000000000000020,
		ECC_MAX                   = 0x0000000000000021
	};

	/**
	 * Enum Engine.ENetRole
	 */
	enum class ENetRole : uint8_t
	{
		ROLE_None            = 0x0000000000000000,
		ROLE_SimulatedProxy  = 0x0000000000000001,
		ROLE_AutonomousProxy = 0x0000000000000002,
		ROLE_Authority       = 0x0000000000000003,
		ROLE_MAX             = 0x0000000000000004
	};

	/**
	 * Enum Engine.ENetDormancy
	 */
	enum class ENetDormancy : uint8_t
	{
		DORM_Never          = 0x0000000000000000,
		DORM_Awake          = 0x0000000000000001,
		DORM_DormantAll     = 0x0000000000000002,
		DORM_DormantPartial = 0x0000000000000003,
		DORM_Initial        = 0x0000000000000004,
		DORM_MAX            = 0x0000000000000005
	};

	/**
	 * Enum Engine.EAutoReceiveInput
	 */
	enum class EAutoReceiveInput : uint8_t
	{
		Disabled = 0x0000000000000000,
		Player0  = 0x0000000000000001,
		Player1  = 0x0000000000000002,
		Player2  = 0x0000000000000003,
		Player3  = 0x0000000000000004,
		Player4  = 0x0000000000000005,
		Player5  = 0x0000000000000006,
		Player6  = 0x0000000000000007,
		Player7  = 0x0000000000000008,
		MAX      = 0x0000000000000009
	};

	/**
	 * Enum Engine.ESpawnActorCollisionHandlingMethod
	 */
	enum class ESpawnActorCollisionHandlingMethod : uint8_t
	{
		Undefined                               = 0x0000000000000000,
		AlwaysSpawn                             = 0x0000000000000001,
		AdjustIfPossibleButAlwaysSpawn          = 0x0000000000000002,
		AdjustIfPossibleButDontSpawnIfColliding = 0x0000000000000003,
		DontSpawnIfColliding                    = 0x0000000000000004,
		MAX                                     = 0x0000000000000005
	};

	/**
	 * Enum Engine.ERotatorQuantization
	 */
	enum class ERotatorQuantization : uint8_t
	{
		ByteComponents  = 0x0000000000000000,
		ShortComponents = 0x0000000000000001,
		MAX             = 0x0000000000000002
	};

	/**
	 * Enum Engine.EVectorQuantization
	 */
	enum class EVectorQuantization : uint8_t
	{
		RoundWholeNumber = 0x0000000000000000,
		RoundOneDecimal  = 0x0000000000000001,
		RoundTwoDecimals = 0x0000000000000002,
		MAX              = 0x0000000000000003
	};

	/**
	 * Enum Engine.EActorUpdateOverlapsMethod
	 */
	enum class EActorUpdateOverlapsMethod : uint8_t
	{
		UseConfigDefault  = 0x0000000000000000,
		AlwaysUpdate      = 0x0000000000000001,
		OnlyUpdateMovable = 0x0000000000000002,
		NeverUpdate       = 0x0000000000000003,
		MAX               = 0x0000000000000004
	};

	/**
	 * Enum Engine.ECanBeCharacterBase
	 */
	enum class ECanBeCharacterBase : uint8_t
	{
		ECB_No    = 0x0000000000000000,
		ECB_Yes   = 0x0000000000000001,
		ECB_Owner = 0x0000000000000002,
		ECB_MAX   = 0x0000000000000003
	};

	/**
	 * Enum Engine.EWalkableSlopeBehavior
	 */
	enum class EWalkableSlopeBehavior : uint8_t
	{
		WalkableSlope_Default    = 0x0000000000000000,
		WalkableSlope_Increase   = 0x0000000000000001,
		WalkableSlope_Decrease   = 0x0000000000000002,
		WalkableSlope_Unwalkable = 0x0000000000000003,
		WalkableSlope_Max        = 0x0000000000000004
	};

	/**
	 * Enum Engine.ECollisionResponse
	 */
	enum class ECollisionResponse : uint8_t
	{
		ECR_Ignore  = 0x0000000000000000,
		ECR_Overlap = 0x0000000000000001,
		ECR_Block   = 0x0000000000000002,
		ECR_MAX     = 0x0000000000000003
	};

	/**
	 * Enum Engine.EDOFMode
	 */
	enum class EDOFMode : uint8_t
	{
		Default     = 0x0000000000000000,
		SixDOF      = 0x0000000000000001,
		YZPlane     = 0x0000000000000002,
		XZPlane     = 0x0000000000000003,
		XYPlane     = 0x0000000000000004,
		CustomPlane = 0x0000000000000005,
		None        = 0x0000000000000006,
		MAX         = 0x0000000000000007
	};

	/**
	 * Enum Engine.ECollisionEnabled
	 */
	enum class ECollisionEnabled : uint8_t
	{
		NoCollision     = 0x0000000000000000,
		QueryOnly       = 0x0000000000000001,
		PhysicsOnly     = 0x0000000000000002,
		QueryAndPhysics = 0x0000000000000003,
		MAX             = 0x0000000000000004
	};

	/**
	 * Enum Engine.ERendererStencilMask
	 */
	enum class ERendererStencilMask : uint8_t
	{
		ERSM_Default = 0x0000000000000000,
		ERSM         = 0x0000000000000001,
		ERSM01       = 0x0000000000000002,
		ERSM02       = 0x0000000000000003,
		ERSM03       = 0x0000000000000004,
		ERSM04       = 0x0000000000000005,
		ERSM05       = 0x0000000000000006,
		ERSM06       = 0x0000000000000007,
		ERSM07       = 0x0000000000000008,
		ERSM08       = 0x0000000000000009,
		ERSM_MAX     = 0x000000000000000A
	};

	/**
	 * Enum Engine.EMouseLockMode
	 */
	enum class EMouseLockMode : uint8_t
	{
		DoNotLock        = 0x0000000000000000,
		LockOnCapture    = 0x0000000000000001,
		LockAlways       = 0x0000000000000002,
		LockInFullscreen = 0x0000000000000003,
		MAX              = 0x0000000000000004
	};

	/**
	 * Enum Engine.EWindowTitleBarMode
	 */
	enum class EWindowTitleBarMode : uint8_t
	{
		Overlay     = 0x0000000000000000,
		VerticalBox = 0x0000000000000001,
		MAX         = 0x0000000000000002
	};

	/**
	 * Enum Engine.EAlphaBlendOption
	 */
	enum class EAlphaBlendOption : uint8_t
	{
		Linear         = 0x0000000000000000,
		Cubic          = 0x0000000000000001,
		HermiteCubic   = 0x0000000000000002,
		Sinusoidal     = 0x0000000000000003,
		QuadraticInOut = 0x0000000000000004,
		CubicInOut     = 0x0000000000000005,
		QuarticInOut   = 0x0000000000000006,
		QuinticInOut   = 0x0000000000000007,
		CircularIn     = 0x0000000000000008,
		CircularOut    = 0x0000000000000009,
		CircularInOut  = 0x000000000000000A,
		ExpIn          = 0x000000000000000B,
		ExpOut         = 0x000000000000000C,
		ExpInOut       = 0x000000000000000D,
		Custom         = 0x000000000000000E,
		MAX            = 0x000000000000000F
	};

	/**
	 * Enum Engine.EAnimSyncGroupScope
	 */
	enum class EAnimSyncGroupScope : uint8_t
	{
		Local     = 0x0000000000000000,
		Component = 0x0000000000000001,
		MAX       = 0x0000000000000002
	};

	/**
	 * Enum Engine.EAnimGroupRole
	 */
	enum class EAnimGroupRole : uint8_t
	{
		CanBeLeader        = 0x0000000000000000,
		AlwaysFollower     = 0x0000000000000001,
		AlwaysLeader       = 0x0000000000000002,
		TransitionLeader   = 0x0000000000000003,
		TransitionFollower = 0x0000000000000004,
		MAX                = 0x0000000000000005
	};

	/**
	 * Enum Engine.EPreviewAnimationBlueprintApplicationMethod
	 */
	enum class EPreviewAnimationBlueprintApplicationMethod : uint8_t
	{
		LinkedLayers    = 0x0000000000000000,
		LinkedAnimGraph = 0x0000000000000001,
		MAX             = 0x0000000000000002
	};

	/**
	 * Enum Engine.AnimationKeyFormat
	 */
	enum class EAnimationKeyFormat : uint8_t
	{
		AKF_ConstantKeyLerp     = 0x0000000000000000,
		AKF_VariableKeyLerp     = 0x0000000000000001,
		AKF_PerTrackCompression = 0x0000000000000002,
		AKF_MAX                 = 0x0000000000000003
	};

	/**
	 * Enum Engine.ERawCurveTrackTypes
	 */
	enum class ERawCurveTrackTypes : uint8_t
	{
		RCT_Float     = 0x0000000000000000,
		RCT_Vector    = 0x0000000000000001,
		RCT_Transform = 0x0000000000000002,
		RCT_MAX       = 0x0000000000000003
	};

	/**
	 * Enum Engine.EAnimAssetCurveFlags
	 */
	enum class EAnimAssetCurveFlags : uint8_t
	{
		AACF_NONE                        = 0x0000000000000000,
		AACF_DriveMorphTarget_DEPRECATED = 0x0000000000000001,
		AACF_DriveAttribute_DEPRECATED   = 0x0000000000000002,
		AACF_Editable                    = 0x0000000000000003,
		AACF_DriveMaterial_DEPRECATED    = 0x0000000000000004,
		AACF_Metadata                    = 0x0000000000000005,
		AACF_DriveTrack                  = 0x0000000000000006,
		AACF_Disabled                    = 0x0000000000000007,
		AACF_MAX                         = 0x0000000000000008
	};

	/**
	 * Enum Engine.AnimationCompressionFormat
	 */
	enum class EAnimationCompressionFormat : uint8_t
	{
		ACF_None               = 0x0000000000000000,
		ACF_Float96NoW         = 0x0000000000000001,
		ACF_Fixed48NoW         = 0x0000000000000002,
		ACF_IntervalFixed32NoW = 0x0000000000000003,
		ACF_Fixed32NoW         = 0x0000000000000004,
		ACF_Float32NoW         = 0x0000000000000005,
		ACF_Identity           = 0x0000000000000006,
		ACF_MAX                = 0x0000000000000007
	};

	/**
	 * Enum Engine.EAdditiveBasePoseType
	 */
	enum class EAdditiveBasePoseType : uint8_t
	{
		ABPT_None       = 0x0000000000000000,
		ABPT_RefPose    = 0x0000000000000001,
		ABPT_AnimScaled = 0x0000000000000002,
		ABPT_AnimFrame  = 0x0000000000000003,
		ABPT_MAX        = 0x0000000000000004
	};

	/**
	 * Enum Engine.ERootMotionMode
	 */
	enum class ERootMotionMode : uint8_t
	{
		NoRootMotionExtraction     = 0x0000000000000000,
		IgnoreRootMotion           = 0x0000000000000001,
		RootMotionFromEverything   = 0x0000000000000002,
		RootMotionFromMontagesOnly = 0x0000000000000003,
		MAX                        = 0x0000000000000004
	};

	/**
	 * Enum Engine.ERootMotionRootLock
	 */
	enum class ERootMotionRootLock : uint8_t
	{
		RefPose        = 0x0000000000000000,
		AnimFirstFrame = 0x0000000000000001,
		Zero           = 0x0000000000000002,
		MAX            = 0x0000000000000003
	};

	/**
	 * Enum Engine.EMontagePlayReturnType
	 */
	enum class EMontagePlayReturnType : uint8_t
	{
		MontageLength = 0x0000000000000000,
		Duration      = 0x0000000000000001,
		MAX           = 0x0000000000000002
	};

	/**
	 * Enum Engine.EDrawDebugItemType
	 */
	enum class EDrawDebugItemType : uint8_t
	{
		DirectionalArrow = 0x0000000000000000,
		Sphere           = 0x0000000000000001,
		Line             = 0x0000000000000002,
		OnScreenMessage  = 0x0000000000000003,
		CoordinateSystem = 0x0000000000000004,
		MAX              = 0x0000000000000005
	};

	/**
	 * Enum Engine.EAnimLinkMethod
	 */
	enum class EAnimLinkMethod : uint8_t
	{
		Absolute     = 0x0000000000000000,
		Relative     = 0x0000000000000001,
		Proportional = 0x0000000000000002,
		MAX          = 0x0000000000000003
	};

	/**
	 * Enum Engine.EMontageSubStepResult
	 */
	enum class EMontageSubStepResult : uint8_t
	{
		Moved          = 0x0000000000000000,
		NotMoved       = 0x0000000000000001,
		InvalidSection = 0x0000000000000002,
		InvalidMontage = 0x0000000000000003,
		MAX            = 0x0000000000000004
	};

	/**
	 * Enum Engine.EAnimNotifyEventType
	 */
	enum class EAnimNotifyEventType : uint8_t
	{
		Begin = 0x0000000000000000,
		End   = 0x0000000000000001,
		MAX   = 0x0000000000000002
	};

	/**
	 * Enum Engine.EInertializationSpace
	 */
	enum class EInertializationSpace : uint8_t
	{
		Default       = 0x0000000000000000,
		WorldSpace    = 0x0000000000000001,
		WorldRotation = 0x0000000000000002,
		MAX           = 0x0000000000000003
	};

	/**
	 * Enum Engine.EInertializationBoneState
	 */
	enum class EInertializationBoneState : uint8_t
	{
		Invalid  = 0x0000000000000000,
		Valid    = 0x0000000000000001,
		Excluded = 0x0000000000000002,
		MAX      = 0x0000000000000003
	};

	/**
	 * Enum Engine.EInertializationState
	 */
	enum class EInertializationState : uint8_t
	{
		Inactive = 0x0000000000000000,
		Pending  = 0x0000000000000001,
		Active   = 0x0000000000000002,
		MAX      = 0x0000000000000003
	};

	/**
	 * Enum Engine.EEvaluatorMode
	 */
	enum class EEvaluatorMode : uint8_t
	{
		EM_Standard      = 0x0000000000000000,
		EM_Freeze        = 0x0000000000000001,
		EM_DelayedFreeze = 0x0000000000000002,
		EM_MAX           = 0x0000000000000003
	};

	/**
	 * Enum Engine.EEvaluatorDataSource
	 */
	enum class EEvaluatorDataSource : uint8_t
	{
		EDS_SourcePose      = 0x0000000000000000,
		EDS_DestinationPose = 0x0000000000000001,
		EDS_MAX             = 0x0000000000000002
	};

	/**
	 * Enum Engine.EPostCopyOperation
	 */
	enum class EPostCopyOperation : uint8_t
	{
		None              = 0x0000000000000000,
		LogicalNegateBool = 0x0000000000000001,
		MAX               = 0x0000000000000002
	};

	/**
	 * Enum Engine.EPinHidingMode
	 */
	enum class EPinHidingMode : uint8_t
	{
		NeverAsPin         = 0x0000000000000000,
		PinHiddenByDefault = 0x0000000000000001,
		PinShownByDefault  = 0x0000000000000002,
		AlwaysAsPin        = 0x0000000000000003,
		MAX                = 0x0000000000000004
	};

	/**
	 * Enum Engine.AnimPhysCollisionType
	 */
	enum class EAnimPhysCollisionType : uint8_t
	{
		AnimPhysCollisionType__CoM                       = 0x0000000000000000,
		AnimPhysCollisionType__CustomSphere              = 0x0000000000000001,
		AnimPhysCollisionType__InnerSphere               = 0x0000000000000002,
		AnimPhysCollisionType__OuterSphere               = 0x0000000000000003,
		AnimPhysCollisionType__AnimPhysCollisionType_MAX = 0x0000000000000004
	};

	/**
	 * Enum Engine.AnimPhysTwistAxis
	 */
	enum class EAnimPhysTwistAxis : uint8_t
	{
		AnimPhysTwistAxis__AxisX                 = 0x0000000000000000,
		AnimPhysTwistAxis__AxisY                 = 0x0000000000000001,
		AnimPhysTwistAxis__AxisZ                 = 0x0000000000000002,
		AnimPhysTwistAxis__AnimPhysTwistAxis_MAX = 0x0000000000000003
	};

	/**
	 * Enum Engine.ETypeAdvanceAnim
	 */
	enum class ETypeAdvanceAnim : uint8_t
	{
		ETAA_Default  = 0x0000000000000000,
		ETAA_Finished = 0x0000000000000001,
		ETAA_Looped   = 0x0000000000000002,
		ETAA_MAX      = 0x0000000000000003
	};

	/**
	 * Enum Engine.ETransitionLogicType
	 */
	enum class ETransitionLogicType : uint8_t
	{
		TLT_StandardBlend   = 0x0000000000000000,
		TLT_Inertialization = 0x0000000000000001,
		TLT_Custom          = 0x0000000000000002,
		TLT_MAX             = 0x0000000000000003
	};

	/**
	 * Enum Engine.ETransitionBlendMode
	 */
	enum class ETransitionBlendMode : uint8_t
	{
		TBM_Linear = 0x0000000000000000,
		TBM_Cubic  = 0x0000000000000001,
		TBM_MAX    = 0x0000000000000002
	};

	/**
	 * Enum Engine.EComponentType
	 */
	enum class EComponentType : uint8_t
	{
		None         = 0x0000000000000000,
		TranslationX = 0x0000000000000001,
		TranslationY = 0x0000000000000002,
		TranslationZ = 0x0000000000000003,
		RotationX    = 0x0000000000000004,
		RotationY    = 0x0000000000000005,
		RotationZ    = 0x0000000000000006,
		Scale        = 0x0000000000000007,
		ScaleX       = 0x0000000000000008,
		ScaleY       = 0x0000000000000009,
		ScaleZ       = 0x000000000000000A,
		MAX          = 0x000000000000000B
	};

	/**
	 * Enum Engine.EAxisOption
	 */
	enum class EAxisOption : uint8_t
	{
		X      = 0x0000000000000000,
		Y      = 0x0000000000000001,
		Z      = 0x0000000000000002,
		X_Neg  = 0x0000000000000003,
		Y_Neg  = 0x0000000000000004,
		Z_Neg  = 0x0000000000000005,
		Custom = 0x0000000000000006,
		MAX    = 0x0000000000000007
	};

	/**
	 * Enum Engine.EAnimInterpolationType
	 */
	enum class EAnimInterpolationType : uint8_t
	{
		Linear = 0x0000000000000000,
		Step   = 0x0000000000000001,
		MAX    = 0x0000000000000002
	};

	/**
	 * Enum Engine.ECurveBlendOption
	 */
	enum class ECurveBlendOption : uint8_t
	{
		Override          = 0x0000000000000000,
		DoNotOverride     = 0x0000000000000001,
		NormalizeByWeight = 0x0000000000000002,
		BlendByWeight     = 0x0000000000000003,
		UseBasePose       = 0x0000000000000004,
		UseMaxValue       = 0x0000000000000005,
		UseMinValue       = 0x0000000000000006,
		MAX               = 0x0000000000000007
	};

	/**
	 * Enum Engine.EAdditiveAnimationType
	 */
	enum class EAdditiveAnimationType : uint8_t
	{
		AAT_None                    = 0x0000000000000000,
		AAT_LocalSpaceBase          = 0x0000000000000001,
		AAT_RotationOffsetMeshSpace = 0x0000000000000002,
		AAT_MAX                     = 0x0000000000000003
	};

	/**
	 * Enum Engine.ENotifyFilterType
	 */
	enum class ENotifyFilterType : uint8_t
	{
		NoFiltering = 0x0000000000000000,
		LOD         = 0x0000000000000001,
		MAX         = 0x0000000000000002
	};

	/**
	 * Enum Engine.EMontageNotifyTickType
	 */
	enum class EMontageNotifyTickType : uint8_t
	{
		Queued         = 0x0000000000000000,
		BranchingPoint = 0x0000000000000001,
		MAX            = 0x0000000000000002
	};

	/**
	 * Enum Engine.EBoneRotationSource
	 */
	enum class EBoneRotationSource : uint8_t
	{
		BRS_KeepComponentSpaceRotation = 0x0000000000000000,
		BRS_KeepLocalSpaceRotation     = 0x0000000000000001,
		BRS_CopyFromTarget             = 0x0000000000000002,
		BRS_MAX                        = 0x0000000000000003
	};

	/**
	 * Enum Engine.EBoneControlSpace
	 */
	enum class EBoneControlSpace : uint8_t
	{
		BCS_WorldSpace      = 0x0000000000000000,
		BCS_ComponentSpace  = 0x0000000000000001,
		BCS_ParentBoneSpace = 0x0000000000000002,
		BCS_BoneSpace       = 0x0000000000000003,
		BCS_MAX             = 0x0000000000000004
	};

	/**
	 * Enum Engine.EBoneAxis
	 */
	enum class EBoneAxis : uint8_t
	{
		BA_X   = 0x0000000000000000,
		BA_Y   = 0x0000000000000001,
		BA_Z   = 0x0000000000000002,
		BA_MAX = 0x0000000000000003
	};

	/**
	 * Enum Engine.EPrimaryAssetCookRule
	 */
	enum class EPrimaryAssetCookRule : uint8_t
	{
		Unknown               = 0x0000000000000000,
		NeverCook             = 0x0000000000000001,
		DevelopmentCook       = 0x0000000000000002,
		DevelopmentAlwaysCook = 0x0000000000000003,
		AlwaysCook            = 0x0000000000000004,
		MAX                   = 0x0000000000000005
	};

	/**
	 * Enum Engine.ENaturalSoundFalloffMode
	 */
	enum class ENaturalSoundFalloffMode : uint8_t
	{
		Continues = 0x0000000000000000,
		Silent    = 0x0000000000000001,
		Hold      = 0x0000000000000002,
		MAX       = 0x0000000000000003
	};

	/**
	 * Enum Engine.EAttenuationShape
	 */
	enum class EAttenuationShape : uint8_t
	{
		Sphere  = 0x0000000000000000,
		Capsule = 0x0000000000000001,
		Box     = 0x0000000000000002,
		Cone    = 0x0000000000000003,
		MAX     = 0x0000000000000004
	};

	/**
	 * Enum Engine.EAttenuationDistanceModel
	 */
	enum class EAttenuationDistanceModel : uint8_t
	{
		Linear       = 0x0000000000000000,
		Logarithmic  = 0x0000000000000001,
		Inverse      = 0x0000000000000002,
		LogReverse   = 0x0000000000000003,
		NaturalSound = 0x0000000000000004,
		Custom       = 0x0000000000000005,
		MAX          = 0x0000000000000006
	};

	/**
	 * Enum Engine.EAudioBusChannels
	 */
	enum class EAudioBusChannels : uint8_t
	{
		Mono   = 0x0000000000000000,
		Stereo = 0x0000000000000001,
		MAX    = 0x0000000000000002
	};

	/**
	 * Enum Engine.EAudioFaderCurve
	 */
	enum class EAudioFaderCurve : uint8_t
	{
		Linear      = 0x0000000000000000,
		Logarithmic = 0x0000000000000001,
		SCurve      = 0x0000000000000002,
		Sin         = 0x0000000000000003,
		Count       = 0x0000000000000004,
		MAX         = 0x0000000000000005
	};

	/**
	 * Enum Engine.EAudioOutputTarget
	 */
	enum class EAudioOutputTarget : uint8_t
	{
		Speaker                     = 0x0000000000000000,
		Controller                  = 0x0000000000000001,
		ControllerFallbackToSpeaker = 0x0000000000000002,
		MAX                         = 0x0000000000000003
	};

	/**
	 * Enum Engine.EMonoChannelUpmixMethod
	 */
	enum class EMonoChannelUpmixMethod : uint8_t
	{
		Linear     = 0x0000000000000000,
		EqualPower = 0x0000000000000001,
		FullVolume = 0x0000000000000002,
		MAX        = 0x0000000000000003
	};

	/**
	 * Enum Engine.EPanningMethod
	 */
	enum class EPanningMethod : uint8_t
	{
		Linear     = 0x0000000000000000,
		EqualPower = 0x0000000000000001,
		MAX        = 0x0000000000000002
	};

	/**
	 * Enum Engine.EVoiceSampleRate
	 */
	enum class EVoiceSampleRate : uint8_t
	{
		Low16000Hz    = 0x0000000000000000,
		Normal24000Hz = 0x0000000000000001,
		MAX           = 0x0000000000000002
	};

	/**
	 * Enum Engine.EAudioVolumeLocationState
	 */
	enum class EAudioVolumeLocationState : uint8_t
	{
		InsideTheVolume  = 0x0000000000000000,
		OutsideTheVolume = 0x0000000000000001,
		MAX              = 0x0000000000000002
	};

	/**
	 * Enum Engine.EBlendableLocation
	 */
	enum class EBlendableLocation : uint8_t
	{
		BL_AfterTonemapping    = 0x0000000000000000,
		BL_BeforeTonemapping   = 0x0000000000000001,
		BL_BeforeTranslucency  = 0x0000000000000002,
		BL_ReplacingTonemapper = 0x0000000000000003,
		BL_SSRInput            = 0x0000000000000004,
		BL_MAX                 = 0x0000000000000005
	};

	/**
	 * Enum Engine.ENotifyTriggerMode
	 */
	enum class ENotifyTriggerMode : uint8_t
	{
		AllAnimations            = 0x0000000000000000,
		HighestWeightedAnimation = 0x0000000000000001,
		None                     = 0x0000000000000002,
		MAX                      = 0x0000000000000003
	};

	/**
	 * Enum Engine.EBlendSpaceAxis
	 */
	enum class EBlendSpaceAxis : uint8_t
	{
		BSA_None = 0x0000000000000000,
		BSA_X    = 0x0000000000000001,
		BSA_Y    = 0x0000000000000002,
		BSA_Max  = 0x0000000000000003
	};

	/**
	 * Enum Engine.EBlueprintNativizationFlag
	 */
	enum class EBlueprintNativizationFlag : uint8_t
	{
		Disabled          = 0x0000000000000000,
		Dependency        = 0x0000000000000001,
		ExplicitlyEnabled = 0x0000000000000002,
		MAX               = 0x0000000000000003
	};

	/**
	 * Enum Engine.EBlueprintCompileMode
	 */
	enum class EBlueprintCompileMode : uint8_t
	{
		Default      = 0x0000000000000000,
		Development  = 0x0000000000000001,
		FinalRelease = 0x0000000000000002,
		MAX          = 0x0000000000000003
	};

	/**
	 * Enum Engine.EBlueprintType
	 */
	enum class EBlueprintType : uint8_t
	{
		BPTYPE_Normal          = 0x0000000000000000,
		BPTYPE_Const           = 0x0000000000000001,
		BPTYPE_MacroLibrary    = 0x0000000000000002,
		BPTYPE_Interface       = 0x0000000000000003,
		BPTYPE_LevelScript     = 0x0000000000000004,
		BPTYPE_FunctionLibrary = 0x0000000000000005,
		BPTYPE_MAX             = 0x0000000000000006
	};

	/**
	 * Enum Engine.EBlueprintStatus
	 */
	enum class EBlueprintStatus : uint8_t
	{
		BS_Unknown              = 0x0000000000000000,
		BS_Dirty                = 0x0000000000000001,
		BS_Error                = 0x0000000000000002,
		BS_UpToDate             = 0x0000000000000003,
		BS_BeingCreated         = 0x0000000000000004,
		BS_UpToDateWithWarnings = 0x0000000000000005,
		BS_MAX                  = 0x0000000000000006
	};

	/**
	 * Enum Engine.EBrushType
	 */
	enum class EBrushType : uint8_t
	{
		Brush_Default  = 0x0000000000000000,
		Brush_Add      = 0x0000000000000001,
		Brush_Subtract = 0x0000000000000002,
		Brush_MAX      = 0x0000000000000003
	};

	/**
	 * Enum Engine.ECsgOper
	 */
	enum class ECsgOper : uint8_t
	{
		CSG_Active      = 0x0000000000000000,
		CSG_Add         = 0x0000000000000001,
		CSG_Subtract    = 0x0000000000000002,
		CSG_Intersect   = 0x0000000000000003,
		CSG_Deintersect = 0x0000000000000004,
		CSG_None        = 0x0000000000000005,
		CSG_MAX         = 0x0000000000000006
	};

	/**
	 * Enum Engine.EInitialOscillatorOffset
	 */
	enum class EInitialOscillatorOffset : uint8_t
	{
		EOO_OffsetRandom = 0x0000000000000000,
		EOO_OffsetZero   = 0x0000000000000001,
		EOO_MAX          = 0x0000000000000002
	};

	/**
	 * Enum Engine.EOscillatorWaveform
	 */
	enum class EOscillatorWaveform : uint8_t
	{
		SineWave    = 0x0000000000000000,
		PerlinNoise = 0x0000000000000001,
		MAX         = 0x0000000000000002
	};

	/**
	 * Enum Engine.ECameraShakeDurationType
	 */
	enum class ECameraShakeDurationType : uint8_t
	{
		Fixed    = 0x0000000000000000,
		Infinite = 0x0000000000000001,
		Custom   = 0x0000000000000002,
		MAX      = 0x0000000000000003
	};

	/**
	 * Enum Engine.ECameraShakeUpdateResultFlags
	 */
	enum class ECameraShakeUpdateResultFlags : uint8_t
	{
		ApplyAsAbsolute   = 0x0000000000000000,
		SkipAutoScale     = 0x0000000000000001,
		SkipAutoPlaySpace = 0x0000000000000002,
		Default           = 0x0000000000000003,
		MAX               = 0x0000000000000004
	};

	/**
	 * Enum Engine.ECameraShakeAttenuation
	 */
	enum class ECameraShakeAttenuation : uint8_t
	{
		Linear    = 0x0000000000000000,
		Quadratic = 0x0000000000000001,
		MAX       = 0x0000000000000002
	};

	/**
	 * Enum Engine.ECameraAlphaBlendMode
	 */
	enum class ECameraAlphaBlendMode : uint8_t
	{
		CABM_Linear = 0x0000000000000000,
		CABM_Cubic  = 0x0000000000000001,
		CABM_MAX    = 0x0000000000000002
	};

	/**
	 * Enum Engine.ECameraShakePlaySpace
	 */
	enum class ECameraShakePlaySpace : uint8_t
	{
		CameraLocal = 0x0000000000000000,
		World       = 0x0000000000000001,
		UserDefined = 0x0000000000000002,
		MAX         = 0x0000000000000003
	};

	/**
	 * Enum Engine.ECameraProjectionMode
	 */
	enum class ECameraProjectionMode : uint8_t
	{
		Perspective  = 0x0000000000000000,
		Orthographic = 0x0000000000000001,
		MAX          = 0x0000000000000002
	};

	/**
	 * Enum Engine.ECloudStorageDelegate
	 */
	enum class ECloudStorageDelegate : uint8_t
	{
		CSD_KeyValueReadComplete     = 0x0000000000000000,
		CSD_KeyValueWriteComplete    = 0x0000000000000001,
		CSD_ValueChanged             = 0x0000000000000002,
		CSD_DocumentQueryComplete    = 0x0000000000000003,
		CSD_DocumentReadComplete     = 0x0000000000000004,
		CSD_DocumentWriteComplete    = 0x0000000000000005,
		CSD_DocumentConflictDetected = 0x0000000000000006,
		CSD_MAX                      = 0x0000000000000007
	};

	/**
	 * Enum Engine.EAngularDriveMode
	 */
	enum class EAngularDriveMode : uint8_t
	{
		SLERP         = 0x0000000000000000,
		TwistAndSwing = 0x0000000000000001,
		MAX           = 0x0000000000000002
	};

	/**
	 * Enum Engine.ECurveTableMode
	 */
	enum class ECurveTableMode : uint8_t
	{
		Empty        = 0x0000000000000000,
		SimpleCurves = 0x0000000000000001,
		RichCurves   = 0x0000000000000002,
		MAX          = 0x0000000000000003
	};

	/**
	 * Enum Engine.ECustomAttributeBlendType
	 */
	enum class ECustomAttributeBlendType : uint8_t
	{
		Override = 0x0000000000000000,
		Blend    = 0x0000000000000001,
		MAX      = 0x0000000000000002
	};

	/**
	 * Enum Engine.EEvaluateCurveTableResult
	 */
	enum class EEvaluateCurveTableResult : uint8_t
	{
		RowFound    = 0x0000000000000000,
		RowNotFound = 0x0000000000000001,
		MAX         = 0x0000000000000002
	};

	/**
	 * Enum Engine.EGrammaticalNumber
	 */
	enum class EGrammaticalNumber : uint8_t
	{
		Singular = 0x0000000000000000,
		Plural   = 0x0000000000000001,
		MAX      = 0x0000000000000002
	};

	/**
	 * Enum Engine.EGrammaticalGender
	 */
	enum class EGrammaticalGender : uint8_t
	{
		Neuter    = 0x0000000000000000,
		Masculine = 0x0000000000000001,
		Feminine  = 0x0000000000000002,
		Mixed     = 0x0000000000000003,
		MAX       = 0x0000000000000004
	};

	/**
	 * Enum Engine.DistributionParamMode
	 */
	enum class EDistributionParamMode : uint8_t
	{
		DPM_Normal = 0x0000000000000000,
		DPM_Abs    = 0x0000000000000001,
		DPM_Direct = 0x0000000000000002,
		DPM_MAX    = 0x0000000000000003
	};

	/**
	 * Enum Engine.EDistributionVectorMirrorFlags
	 */
	enum class EDistributionVectorMirrorFlags : uint8_t
	{
		EDVMF_Same      = 0x0000000000000000,
		EDVMF_Different = 0x0000000000000001,
		EDVMF_Mirror    = 0x0000000000000002,
		EDVMF_MAX       = 0x0000000000000003
	};

	/**
	 * Enum Engine.EDistributionVectorLockFlags
	 */
	enum class EDistributionVectorLockFlags : uint8_t
	{
		EDVLF_None = 0x0000000000000000,
		EDVLF_XY   = 0x0000000000000001,
		EDVLF_XZ   = 0x0000000000000002,
		EDVLF_YZ   = 0x0000000000000003,
		EDVLF_XYZ  = 0x0000000000000004,
		EDVLF_MAX  = 0x0000000000000005
	};

	/**
	 * Enum Engine.ENodeEnabledState
	 */
	enum class ENodeEnabledState : uint8_t
	{
		Enabled         = 0x0000000000000000,
		Disabled        = 0x0000000000000001,
		DevelopmentOnly = 0x0000000000000002,
		MAX             = 0x0000000000000003
	};

	/**
	 * Enum Engine.ENodeAdvancedPins
	 */
	enum class ENodeAdvancedPins : uint8_t
	{
		NoPins = 0x0000000000000000,
		Shown  = 0x0000000000000001,
		Hidden = 0x0000000000000002,
		MAX    = 0x0000000000000003
	};

	/**
	 * Enum Engine.ENodeTitleType
	 */
	enum class ENodeTitleType : uint8_t
	{
		FullTitle      = 0x0000000000000000,
		ListView       = 0x0000000000000001,
		EditableTitle  = 0x0000000000000002,
		MenuTitle      = 0x0000000000000003,
		MAX_TitleTypes = 0x0000000000000004,
		MAX            = 0x0000000000000005
	};

	/**
	 * Enum Engine.EPinContainerType
	 */
	enum class EPinContainerType : uint8_t
	{
		None  = 0x0000000000000000,
		Array = 0x0000000000000001,
		Set   = 0x0000000000000002,
		Map   = 0x0000000000000003,
		MAX   = 0x0000000000000004
	};

	/**
	 * Enum Engine.EEdGraphPinDirection
	 */
	enum class EEdGraphPinDirection : uint8_t
	{
		EGPD_Input  = 0x0000000000000000,
		EGPD_Output = 0x0000000000000001,
		EGPD_MAX    = 0x0000000000000002
	};

	/**
	 * Enum Engine.EBlueprintPinStyleType
	 */
	enum class EBlueprintPinStyleType : uint8_t
	{
		BPST_Original = 0x0000000000000000,
		BPST_VariantA = 0x0000000000000001,
		BPST_MAX      = 0x0000000000000002
	};

	/**
	 * Enum Engine.ECanCreateConnectionResponse
	 */
	enum class ECanCreateConnectionResponse : uint8_t
	{
		CONNECT_RESPONSE_MAKE                      = 0x0000000000000000,
		CONNECT_RESPONSE_DISALLOW                  = 0x0000000000000001,
		CONNECT_RESPONSE_BREAK_OTHERS_A            = 0x0000000000000002,
		CONNECT_RESPONSE_BREAK_OTHERS_B            = 0x0000000000000003,
		CONNECT_RESPONSE_BREAK_OTHERS_AB           = 0x0000000000000004,
		CONNECT_RESPONSE_MAKE_WITH_CONVERSION_NODE = 0x0000000000000005,
		CONNECT_RESPONSE_MAX                       = 0x0000000000000006
	};

	/**
	 * Enum Engine.EGraphType
	 */
	enum class EGraphType : uint8_t
	{
		GT_Function     = 0x0000000000000000,
		GT_Ubergraph    = 0x0000000000000001,
		GT_Macro        = 0x0000000000000002,
		GT_Animation    = 0x0000000000000003,
		GT_StateMachine = 0x0000000000000004,
		GT_MAX          = 0x0000000000000005
	};

	/**
	 * Enum Engine.ETransitionType
	 */
	enum class ETransitionType : uint8_t
	{
		None             = 0x0000000000000000,
		Paused           = 0x0000000000000001,
		Loading          = 0x0000000000000002,
		Saving           = 0x0000000000000003,
		Connecting       = 0x0000000000000004,
		Precaching       = 0x0000000000000005,
		WaitingToConnect = 0x0000000000000006,
		MAX              = 0x0000000000000007
	};

	/**
	 * Enum Engine.EFullyLoadPackageType
	 */
	enum class EFullyLoadPackageType : uint8_t
	{
		FULLYLOAD_Map                = 0x0000000000000000,
		FULLYLOAD_Game_PreLoadClass  = 0x0000000000000001,
		FULLYLOAD_Game_PostLoadClass = 0x0000000000000002,
		FULLYLOAD_Always             = 0x0000000000000003,
		FULLYLOAD_Mutator            = 0x0000000000000004,
		FULLYLOAD_MAX                = 0x0000000000000005
	};

	/**
	 * Enum Engine.EViewModeIndex
	 */
	enum class EViewModeIndex : uint8_t
	{
		VMI_BrushWireframe                   = 0x0000000000000000,
		VMI_Wireframe                        = 0x0000000000000001,
		VMI_Unlit                            = 0x0000000000000002,
		VMI_Lit                              = 0x0000000000000003,
		VMI_Lit_DetailLighting               = 0x0000000000000004,
		VMI_LightingOnly                     = 0x0000000000000005,
		VMI_LightComplexity                  = 0x0000000000000006,
		VMI_ShaderComplexity                 = 0x0000000000000007,
		VMI_LightmapDensity                  = 0x0000000000000008,
		VMI_LitLightmapDensity               = 0x0000000000000009,
		VMI_ReflectionOverride               = 0x000000000000000A,
		VMI_VisualizeBuffer                  = 0x000000000000000B,
		VMI_StationaryLightOverlap           = 0x000000000000000C,
		VMI_CollisionPawn                    = 0x000000000000000D,
		VMI_CollisionVisibility              = 0x000000000000000E,
		VMI_LODColoration                    = 0x000000000000000F,
		VMI_QuadOverdraw                     = 0x0000000000000010,
		VMI_PrimitiveDistanceAccuracy        = 0x0000000000000011,
		VMI_MeshUVDensityAccuracy            = 0x0000000000000012,
		VMI_ShaderComplexityWithQuadOverdraw = 0x0000000000000013,
		VMI_HLODColoration                   = 0x0000000000000014,
		VMI_GroupLODColoration               = 0x0000000000000015,
		VMI_MaterialTextureScaleAccuracy     = 0x0000000000000016,
		VMI_RequiredTextureResolution        = 0x0000000000000017,
		VMI_PathTracing                      = 0x0000000000000018,
		VMI_RayTracingDebug                  = 0x0000000000000019,
		VMI_Max                              = 0x000000000000001A,
		VMI_Unknown                          = 0x000000000000001B
	};

	/**
	 * Enum Engine.EDemoPlayFailure
	 */
	enum class EDemoPlayFailure : uint8_t
	{
		Generic                = 0x0000000000000000,
		DemoNotFound           = 0x0000000000000001,
		Corrupt                = 0x0000000000000002,
		InvalidVersion         = 0x0000000000000003,
		InitBase               = 0x0000000000000004,
		GameSpecificHeader     = 0x0000000000000005,
		ReplayStreamerInternal = 0x0000000000000006,
		LoadMap                = 0x0000000000000007,
		Serialization          = 0x0000000000000008,
		MAX                    = 0x0000000000000009
	};

	/**
	 * Enum Engine.ETravelType
	 */
	enum class ETravelType : uint8_t
	{
		TRAVEL_Absolute = 0x0000000000000000,
		TRAVEL_Partial  = 0x0000000000000001,
		TRAVEL_Relative = 0x0000000000000002,
		TRAVEL_MAX      = 0x0000000000000003
	};

	/**
	 * Enum Engine.ENetworkLagState
	 */
	enum class ENetworkLagState : uint8_t
	{
		NotLagging = 0x0000000000000000,
		Lagging    = 0x0000000000000001,
		MAX        = 0x0000000000000002
	};

	/**
	 * Enum Engine.EMouseCaptureMode
	 */
	enum class EMouseCaptureMode : uint8_t
	{
		NoCapture                                    = 0x0000000000000000,
		CapturePermanently                           = 0x0000000000000001,
		CapturePermanently_IncludingInitialMouseDown = 0x0000000000000002,
		CaptureDuringMouseDown                       = 0x0000000000000003,
		CaptureDuringRightMouseDown                  = 0x0000000000000004,
		MAX                                          = 0x0000000000000005
	};

	/**
	 * Enum Engine.EInputEvent
	 */
	enum class EInputEvent : uint8_t
	{
		IE_Pressed     = 0x0000000000000000,
		IE_Released    = 0x0000000000000001,
		IE_Repeat      = 0x0000000000000002,
		IE_DoubleClick = 0x0000000000000003,
		IE_Axis        = 0x0000000000000004,
		IE_MAX         = 0x0000000000000005
	};

	/**
	 * Enum Engine.ECustomTimeStepSynchronizationState
	 */
	enum class ECustomTimeStepSynchronizationState : uint8_t
	{
		Closed        = 0x0000000000000000,
		Error         = 0x0000000000000001,
		Synchronized  = 0x0000000000000002,
		Synchronizing = 0x0000000000000003,
		MAX           = 0x0000000000000004
	};

	/**
	 * Enum Engine.EMeshBufferAccess
	 */
	enum class EMeshBufferAccess : uint8_t
	{
		Default        = 0x0000000000000000,
		ForceCPUAndGPU = 0x0000000000000001,
		MAX            = 0x0000000000000002
	};

	/**
	 * Enum Engine.EComponentSocketType
	 */
	enum class EComponentSocketType : uint8_t
	{
		Invalid = 0x0000000000000000,
		Bone    = 0x0000000000000001,
		Socket  = 0x0000000000000002,
		MAX     = 0x0000000000000003
	};

	/**
	 * Enum Engine.EPhysicalMaterialMaskColor
	 */
	enum class EPhysicalMaterialMaskColor : uint8_t
	{
		Red     = 0x0000000000000000,
		Green   = 0x0000000000000001,
		Blue    = 0x0000000000000002,
		Cyan    = 0x0000000000000003,
		Magenta = 0x0000000000000004,
		Yellow  = 0x0000000000000005,
		White   = 0x0000000000000006,
		Black   = 0x0000000000000007,
		MAX     = 0x0000000000000008
	};

	/**
	 * Enum Engine.EAutoPossessAI
	 */
	enum class EAutoPossessAI : uint8_t
	{
		Disabled               = 0x0000000000000000,
		PlacedInWorld          = 0x0000000000000001,
		Spawned                = 0x0000000000000002,
		PlacedInWorldOrSpawned = 0x0000000000000003,
		MAX                    = 0x0000000000000004
	};

	/**
	 * Enum Engine.EUpdateRateShiftBucket
	 */
	enum class EUpdateRateShiftBucket : uint8_t
	{
		ShiftBucket0   = 0x0000000000000000,
		ShiftBucket1   = 0x0000000000000001,
		ShiftBucket2   = 0x0000000000000002,
		ShiftBucket3   = 0x0000000000000003,
		ShiftBucket4   = 0x0000000000000004,
		ShiftBucket5   = 0x0000000000000005,
		ShiftBucketMax = 0x0000000000000006,
		MAX            = 0x0000000000000007
	};

	/**
	 * Enum Engine.EShadowMapFlags
	 */
	enum class EShadowMapFlags : uint8_t
	{
		SMF_None     = 0x0000000000000000,
		SMF_Streamed = 0x0000000000000001,
		SMF_MAX      = 0x0000000000000002
	};

	/**
	 * Enum Engine.ELightMapPaddingType
	 */
	enum class ELightMapPaddingType : uint8_t
	{
		LMPT_NormalPadding = 0x0000000000000000,
		LMPT_PrePadding    = 0x0000000000000001,
		LMPT_NoPadding     = 0x0000000000000002,
		LMPT_MAX           = 0x0000000000000003
	};

	/**
	 * Enum Engine.ETimelineSigType
	 */
	enum class ETimelineSigType : uint8_t
	{
		ETS_EventSignature       = 0x0000000000000000,
		ETS_FloatSignature       = 0x0000000000000001,
		ETS_VectorSignature      = 0x0000000000000002,
		ETS_LinearColorSignature = 0x0000000000000003,
		ETS_InvalidSignature     = 0x0000000000000004,
		ETS_MAX                  = 0x0000000000000005
	};

	/**
	 * Enum Engine.EFilterInterpolationType
	 */
	enum class EFilterInterpolationType : uint8_t
	{
		BSIT_Average = 0x0000000000000000,
		BSIT_Linear  = 0x0000000000000001,
		BSIT_Cubic   = 0x0000000000000002,
		BSIT_MAX     = 0x0000000000000003
	};

	/**
	 * Enum Engine.EOverlapFilterOption
	 */
	enum class EOverlapFilterOption : uint8_t
	{
		OverlapFilter_All         = 0x0000000000000000,
		OverlapFilter_DynamicOnly = 0x0000000000000001,
		OverlapFilter_StaticOnly  = 0x0000000000000002,
		OverlapFilter_MAX         = 0x0000000000000003
	};

	/**
	 * Enum Engine.ENetworkSmoothingMode
	 */
	enum class ENetworkSmoothingMode : uint8_t
	{
		Disabled    = 0x0000000000000000,
		Linear      = 0x0000000000000001,
		Exponential = 0x0000000000000002,
		Replay      = 0x0000000000000003,
		MAX         = 0x0000000000000004
	};

	/**
	 * Enum Engine.ELightingBuildQuality
	 */
	enum class ELightingBuildQuality : uint8_t
	{
		Quality_Preview    = 0x0000000000000000,
		Quality_Medium     = 0x0000000000000001,
		Quality_High       = 0x0000000000000002,
		Quality_Production = 0x0000000000000003,
		Quality_MAX        = 0x0000000000000004
	};

	/**
	 * Enum Engine.EMaterialShadingRate
	 */
	enum class EMaterialShadingRate : uint8_t
	{
		MSR_1x1   = 0x0000000000000000,
		MSR_2x1   = 0x0000000000000001,
		MSR_1x2   = 0x0000000000000002,
		MSR_2x2   = 0x0000000000000003,
		MSR_4x2   = 0x0000000000000004,
		MSR_2x4   = 0x0000000000000005,
		MSR_4x4   = 0x0000000000000006,
		MSR_Count = 0x0000000000000007,
		MSR_MAX   = 0x0000000000000008
	};

	/**
	 * Enum Engine.EMaterialStencilCompare
	 */
	enum class EMaterialStencilCompare : uint8_t
	{
		MSC_Less         = 0x0000000000000000,
		MSC_LessEqual    = 0x0000000000000001,
		MSC_Greater      = 0x0000000000000002,
		MSC_GreaterEqual = 0x0000000000000003,
		MSC_Equal        = 0x0000000000000004,
		MSC_NotEqual     = 0x0000000000000005,
		MSC_Never        = 0x0000000000000006,
		MSC_Always       = 0x0000000000000007,
		MSC_Count        = 0x0000000000000008,
		MSC_MAX          = 0x0000000000000009
	};

	/**
	 * Enum Engine.EMaterialSamplerType
	 */
	enum class EMaterialSamplerType : uint8_t
	{
		SAMPLERTYPE_Color                  = 0x0000000000000000,
		SAMPLERTYPE_Grayscale              = 0x0000000000000001,
		SAMPLERTYPE_Alpha                  = 0x0000000000000002,
		SAMPLERTYPE_Normal                 = 0x0000000000000003,
		SAMPLERTYPE_Masks                  = 0x0000000000000004,
		SAMPLERTYPE_DistanceFieldFont      = 0x0000000000000005,
		SAMPLERTYPE_LinearColor            = 0x0000000000000006,
		SAMPLERTYPE_LinearGrayscale        = 0x0000000000000007,
		SAMPLERTYPE_Data                   = 0x0000000000000008,
		SAMPLERTYPE_External               = 0x0000000000000009,
		SAMPLERTYPE_VirtualColor           = 0x000000000000000A,
		SAMPLERTYPE_VirtualGrayscale       = 0x000000000000000B,
		SAMPLERTYPE_VirtualAlpha           = 0x000000000000000C,
		SAMPLERTYPE_VirtualNormal          = 0x000000000000000D,
		SAMPLERTYPE_VirtualMasks           = 0x000000000000000E,
		SAMPLERTYPE_VirtualLinearColor     = 0x000000000000000F,
		SAMPLERTYPE_VirtualLinearGrayscale = 0x0000000000000010,
		SAMPLERTYPE_MAX                    = 0x0000000000000011
	};

	/**
	 * Enum Engine.EMaterialTessellationMode
	 */
	enum class EMaterialTessellationMode : uint8_t
	{
		MTM_NoTessellation   = 0x0000000000000000,
		MTM_FlatTessellation = 0x0000000000000001,
		MTM_PNTriangles      = 0x0000000000000002,
		MTM_MAX              = 0x0000000000000003
	};

	/**
	 * Enum Engine.EMaterialShadingModel
	 */
	enum class EMaterialShadingModel : uint8_t
	{
		MSM_Unlit                  = 0x0000000000000000,
		MSM_DefaultLit             = 0x0000000000000001,
		MSM_Subsurface             = 0x0000000000000002,
		MSM_PreintegratedSkin      = 0x0000000000000003,
		MSM_ClearCoat              = 0x0000000000000004,
		MSM_SubsurfaceProfile      = 0x0000000000000005,
		MSM_TwoSidedFoliage        = 0x0000000000000006,
		MSM_Hair                   = 0x0000000000000007,
		MSM_Cloth                  = 0x0000000000000008,
		MSM_Eye                    = 0x0000000000000009,
		MSM_SingleLayerWater       = 0x000000000000000A,
		MSM_ThinTranslucent        = 0x000000000000000B,
		MSM_NUM                    = 0x000000000000000C,
		MSM_FromMaterialExpression = 0x000000000000000D,
		MSM_MAX                    = 0x000000000000000E
	};

	/**
	 * Enum Engine.EParticleCollisionMode
	 */
	enum class EParticleCollisionMode : uint8_t
	{
		SceneDepth    = 0x0000000000000000,
		DistanceField = 0x0000000000000001,
		MAX           = 0x0000000000000002
	};

	/**
	 * Enum Engine.ETrailWidthMode
	 */
	enum class ETrailWidthMode : uint8_t
	{
		FromCentre = 0x0000000000000000,
		FromFirst  = 0x0000000000000001,
		FromSecond = 0x0000000000000002,
		MAX        = 0x0000000000000003
	};

	/**
	 * Enum Engine.EGBufferFormat
	 */
	enum class EGBufferFormat : uint8_t
	{
		Force8BitsPerChannel  = 0x0000000000000000,
		Default               = 0x0000000000000001,
		HighPrecisionNormals  = 0x0000000000000002,
		Force16BitsPerChannel = 0x0000000000000003,
		MAX                   = 0x0000000000000004
	};

	/**
	 * Enum Engine.ESceneCaptureCompositeMode
	 */
	enum class ESceneCaptureCompositeMode : uint8_t
	{
		SCCM_Overwrite = 0x0000000000000000,
		SCCM_Additive  = 0x0000000000000001,
		SCCM_Composite = 0x0000000000000002,
		SCCM_MAX       = 0x0000000000000003
	};

	/**
	 * Enum Engine.ESceneCaptureSource
	 */
	enum class ESceneCaptureSource : uint8_t
	{
		SCS_SceneColorHDR        = 0x0000000000000000,
		SCS_SceneColorHDRNoAlpha = 0x0000000000000001,
		SCS_FinalColorLDR        = 0x0000000000000002,
		SCS_SceneColorSceneDepth = 0x0000000000000003,
		SCS_SceneDepth           = 0x0000000000000004,
		SCS_DeviceDepth          = 0x0000000000000005,
		SCS_Normal               = 0x0000000000000006,
		SCS_BaseColor            = 0x0000000000000007,
		SCS_FinalColorHDR        = 0x0000000000000008,
		SCS_FinalToneCurveHDR    = 0x0000000000000009,
		SCS_MAX                  = 0x000000000000000A
	};

	/**
	 * Enum Engine.ETranslucentSortPolicy
	 */
	enum class ETranslucentSortPolicy : uint8_t
	{
		SortByDistance   = 0x0000000000000000,
		SortByProjectedZ = 0x0000000000000001,
		SortAlongAxis    = 0x0000000000000002,
		MAX              = 0x0000000000000003
	};

	/**
	 * Enum Engine.ERefractionMode
	 */
	enum class ERefractionMode : uint8_t
	{
		RM_IndexOfRefraction = 0x0000000000000000,
		RM_PixelNormalOffset = 0x0000000000000001,
		RM_MAX               = 0x0000000000000002
	};

	/**
	 * Enum Engine.ETranslucencyLightingMode
	 */
	enum class ETranslucencyLightingMode : uint8_t
	{
		TLM_VolumetricNonDirectional          = 0x0000000000000000,
		TLM_VolumetricDirectional             = 0x0000000000000001,
		TLM_VolumetricPerVertexNonDirectional = 0x0000000000000002,
		TLM_VolumetricPerVertexDirectional    = 0x0000000000000003,
		TLM_Surface                           = 0x0000000000000004,
		TLM_SurfacePerPixelLighting           = 0x0000000000000005,
		TLM_MAX                               = 0x0000000000000006
	};

	/**
	 * Enum Engine.ESamplerSourceMode
	 */
	enum class ESamplerSourceMode : uint8_t
	{
		SSM_FromTextureAsset         = 0x0000000000000000,
		SSM_Wrap_WorldGroupSettings  = 0x0000000000000001,
		SSM_Clamp_WorldGroupSettings = 0x0000000000000002,
		SSM_MAX                      = 0x0000000000000003
	};

	/**
	 * Enum Engine.EBlendMode
	 */
	enum class EBlendMode : uint8_t
	{
		BLEND_Opaque         = 0x0000000000000000,
		BLEND_Masked         = 0x0000000000000001,
		BLEND_Translucent    = 0x0000000000000002,
		BLEND_Additive       = 0x0000000000000003,
		BLEND_Modulate       = 0x0000000000000004,
		BLEND_AlphaComposite = 0x0000000000000005,
		BLEND_AlphaHoldout   = 0x0000000000000006,
		BLEND_MAX            = 0x0000000000000007
	};

	/**
	 * Enum Engine.EOcclusionCombineMode
	 */
	enum class EOcclusionCombineMode : uint8_t
	{
		OCM_Minimum  = 0x0000000000000000,
		OCM_Multiply = 0x0000000000000001,
		OCM_MAX      = 0x0000000000000002
	};

	/**
	 * Enum Engine.ELightmapType
	 */
	enum class ELightmapType : uint8_t
	{
		Default         = 0x0000000000000000,
		ForceSurface    = 0x0000000000000001,
		ForceVolumetric = 0x0000000000000002,
		MAX             = 0x0000000000000003
	};

	/**
	 * Enum Engine.EIndirectLightingCacheQuality
	 */
	enum class EIndirectLightingCacheQuality : uint8_t
	{
		ILCQ_Off    = 0x0000000000000000,
		ILCQ_Point  = 0x0000000000000001,
		ILCQ_Volume = 0x0000000000000002,
		ILCQ_MAX    = 0x0000000000000003
	};

	/**
	 * Enum Engine.ESceneDepthPriorityGroup
	 */
	enum class ESceneDepthPriorityGroup : uint8_t
	{
		SDPG_World      = 0x0000000000000000,
		SDPG_Foreground = 0x0000000000000001,
		SDPG_MAX        = 0x0000000000000002
	};

	/**
	 * Enum Engine.EAspectRatioAxisConstraint
	 */
	enum class EAspectRatioAxisConstraint : uint8_t
	{
		AspectRatio_MaintainYFOV = 0x0000000000000000,
		AspectRatio_MaintainXFOV = 0x0000000000000001,
		AspectRatio_MajorAxisFOV = 0x0000000000000002,
		AspectRatio_MAX          = 0x0000000000000003
	};

	/**
	 * Enum Engine.EFontCacheType
	 */
	enum class EFontCacheType : uint8_t
	{
		Offline = 0x0000000000000000,
		Runtime = 0x0000000000000001,
		MAX     = 0x0000000000000002
	};

	/**
	 * Enum Engine.EFontImportCharacterSet
	 */
	enum class EFontImportCharacterSet : uint8_t
	{
		FontICS_Default = 0x0000000000000000,
		FontICS_Ansi    = 0x0000000000000001,
		FontICS_Symbol  = 0x0000000000000002,
		FontICS_MAX     = 0x0000000000000003
	};

	/**
	 * Enum Engine.EStandbyType
	 */
	enum class EStandbyType : uint8_t
	{
		STDBY_Rx      = 0x0000000000000000,
		STDBY_Tx      = 0x0000000000000001,
		STDBY_BadPing = 0x0000000000000002,
		STDBY_MAX     = 0x0000000000000003
	};

	/**
	 * Enum Engine.ESuggestProjVelocityTraceOption
	 */
	enum class ESuggestProjVelocityTraceOption : uint8_t
	{
		DoNotTrace              = 0x0000000000000000,
		TraceFullPath           = 0x0000000000000001,
		OnlyTraceWhileAscending = 0x0000000000000002,
		MAX                     = 0x0000000000000003
	};

	/**
	 * Enum Engine.EWindowMode
	 */
	enum class EWindowMode : uint8_t
	{
		Fullscreen         = 0x0000000000000000,
		WindowedFullscreen = 0x0000000000000001,
		Windowed           = 0x0000000000000002,
		MAX                = 0x0000000000000003
	};

	/**
	 * Enum Engine.EHitProxyPriority
	 */
	enum class EHitProxyPriority : uint8_t
	{
		HPP_World      = 0x0000000000000000,
		HPP_Wireframe  = 0x0000000000000001,
		HPP_Foreground = 0x0000000000000002,
		HPP_UI         = 0x0000000000000003,
		HPP_MAX        = 0x0000000000000004
	};

	/**
	 * Enum Engine.EImportanceWeight
	 */
	enum class EImportanceWeight : uint8_t
	{
		Luminance = 0x0000000000000000,
		Red       = 0x0000000000000001,
		Green     = 0x0000000000000002,
		Blue      = 0x0000000000000003,
		Alpha     = 0x0000000000000004,
		MAX       = 0x0000000000000005
	};

	/**
	 * Enum Engine.EAdManagerDelegate
	 */
	enum class EAdManagerDelegate : uint8_t
	{
		AMD_ClickedBanner = 0x0000000000000000,
		AMD_UserClosedAd  = 0x0000000000000001,
		AMD_MAX           = 0x0000000000000002
	};

	/**
	 * Enum Engine.EControllerAnalogStick
	 */
	enum class EControllerAnalogStick : uint8_t
	{
		CAS_LeftStick  = 0x0000000000000000,
		CAS_RightStick = 0x0000000000000001,
		CAS_MAX        = 0x0000000000000002
	};

	/**
	 * Enum Engine.EAnimAlphaInputType
	 */
	enum class EAnimAlphaInputType : uint8_t
	{
		Float = 0x0000000000000000,
		Bool  = 0x0000000000000001,
		Curve = 0x0000000000000002,
		MAX   = 0x0000000000000003
	};

	/**
	 * Enum Engine.ETrackActiveCondition
	 */
	enum class ETrackActiveCondition : uint8_t
	{
		ETAC_Always       = 0x0000000000000000,
		ETAC_GoreEnabled  = 0x0000000000000001,
		ETAC_GoreDisabled = 0x0000000000000002,
		ETAC_MAX          = 0x0000000000000003
	};

	/**
	 * Enum Engine.EInterpTrackMoveRotMode
	 */
	enum class EInterpTrackMoveRotMode : uint8_t
	{
		IMR_Keyframed   = 0x0000000000000000,
		IMR_LookAtGroup = 0x0000000000000001,
		IMR_Ignore      = 0x0000000000000002,
		IMR_MAX         = 0x0000000000000003
	};

	/**
	 * Enum Engine.EInterpMoveAxis
	 */
	enum class EInterpMoveAxis : uint8_t
	{
		AXIS_TranslationX = 0x0000000000000000,
		AXIS_TranslationY = 0x0000000000000001,
		AXIS_TranslationZ = 0x0000000000000002,
		AXIS_RotationX    = 0x0000000000000003,
		AXIS_RotationY    = 0x0000000000000004,
		AXIS_RotationZ    = 0x0000000000000005,
		AXIS_MAX          = 0x0000000000000006
	};

	/**
	 * Enum Engine.ETrackToggleAction
	 */
	enum class ETrackToggleAction : uint8_t
	{
		ETTA_Off     = 0x0000000000000000,
		ETTA_On      = 0x0000000000000001,
		ETTA_Toggle  = 0x0000000000000002,
		ETTA_Trigger = 0x0000000000000003,
		ETTA_MAX     = 0x0000000000000004
	};

	/**
	 * Enum Engine.EVisibilityTrackCondition
	 */
	enum class EVisibilityTrackCondition : uint8_t
	{
		EVTC_Always       = 0x0000000000000000,
		EVTC_GoreEnabled  = 0x0000000000000001,
		EVTC_GoreDisabled = 0x0000000000000002,
		EVTC_MAX          = 0x0000000000000003
	};

	/**
	 * Enum Engine.EVisibilityTrackAction
	 */
	enum class EVisibilityTrackAction : uint8_t
	{
		EVTA_Hide   = 0x0000000000000000,
		EVTA_Show   = 0x0000000000000001,
		EVTA_Toggle = 0x0000000000000002,
		EVTA_MAX    = 0x0000000000000003
	};

	/**
	 * Enum Engine.ESlateGesture
	 */
	enum class ESlateGesture : uint8_t
	{
		None      = 0x0000000000000000,
		Scroll    = 0x0000000000000001,
		Magnify   = 0x0000000000000002,
		Swipe     = 0x0000000000000003,
		Rotate    = 0x0000000000000004,
		LongPress = 0x0000000000000005,
		MAX       = 0x0000000000000006
	};

	/**
	 * Enum Engine.EMIDCreationFlags
	 */
	enum class EMIDCreationFlags : uint8_t
	{
		None      = 0x0000000000000000,
		Transient = 0x0000000000000001,
		MAX       = 0x0000000000000002
	};

	/**
	 * Enum Engine.EMatrixColumns
	 */
	enum class EMatrixColumns : uint8_t
	{
		First  = 0x0000000000000000,
		Second = 0x0000000000000001,
		Third  = 0x0000000000000002,
		Fourth = 0x0000000000000003,
		MAX    = 0x0000000000000004
	};

	/**
	 * Enum Engine.ELerpInterpolationMode
	 */
	enum class ELerpInterpolationMode : uint8_t
	{
		QuatInterp     = 0x0000000000000000,
		EulerInterp    = 0x0000000000000001,
		DualQuatInterp = 0x0000000000000002,
		MAX            = 0x0000000000000003
	};

	/**
	 * Enum Engine.EEasingFunc
	 */
	enum class EEasingFunc : uint8_t
	{
		Linear          = 0x0000000000000000,
		Step            = 0x0000000000000001,
		SinusoidalIn    = 0x0000000000000002,
		SinusoidalOut   = 0x0000000000000003,
		SinusoidalInOut = 0x0000000000000004,
		EaseIn          = 0x0000000000000005,
		EaseOut         = 0x0000000000000006,
		EaseInOut       = 0x0000000000000007,
		ExpoIn          = 0x0000000000000008,
		ExpoOut         = 0x0000000000000009,
		ExpoInOut       = 0x000000000000000A,
		CircularIn      = 0x000000000000000B,
		CircularOut     = 0x000000000000000C,
		CircularInOut   = 0x000000000000000D,
		MAX             = 0x000000000000000E
	};

	/**
	 * Enum Engine.ERoundingMode
	 */
	enum class ERoundingMode : uint8_t
	{
		HalfToEven         = 0x0000000000000000,
		HalfFromZero       = 0x0000000000000001,
		HalfToZero         = 0x0000000000000002,
		FromZero           = 0x0000000000000003,
		ToZero             = 0x0000000000000004,
		ToNegativeInfinity = 0x0000000000000005,
		ToPositiveInfinity = 0x0000000000000006,
		MAX                = 0x0000000000000007
	};

	/**
	 * Enum Engine.EStreamingVolumeUsage
	 */
	enum class EStreamingVolumeUsage : uint8_t
	{
		SVB_Loading                  = 0x0000000000000000,
		SVB_LoadingAndVisibility     = 0x0000000000000001,
		SVB_VisibilityBlockingOnLoad = 0x0000000000000002,
		SVB_BlockingOnLoad           = 0x0000000000000003,
		SVB_LoadingNotVisible        = 0x0000000000000004,
		SVB_MAX                      = 0x0000000000000005
	};

	/**
	 * Enum Engine.ESyncOption
	 */
	enum class ESyncOption : uint8_t
	{
		Drive    = 0x0000000000000000,
		Passive  = 0x0000000000000001,
		Disabled = 0x0000000000000002,
		MAX      = 0x0000000000000003
	};

	/**
	 * Enum Engine.EMaterialDecalResponse
	 */
	enum class EMaterialDecalResponse : uint8_t
	{
		MDR_None                 = 0x0000000000000000,
		MDR_ColorNormalRoughness = 0x0000000000000001,
		MDR_Color                = 0x0000000000000002,
		MDR_ColorNormal          = 0x0000000000000003,
		MDR_ColorRoughness       = 0x0000000000000004,
		MDR_Normal               = 0x0000000000000005,
		MDR_NormalRoughness      = 0x0000000000000006,
		MDR_Roughness            = 0x0000000000000007,
		MDR_MAX                  = 0x0000000000000008
	};

	/**
	 * Enum Engine.EDecalBlendMode
	 */
	enum class EDecalBlendMode : uint8_t
	{
		DBM_Translucent                    = 0x0000000000000000,
		DBM_Stain                          = 0x0000000000000001,
		DBM_Normal                         = 0x0000000000000002,
		DBM_Emissive                       = 0x0000000000000003,
		DBM_DBuffer_ColorNormalRoughness   = 0x0000000000000004,
		DBM_DBuffer_Color                  = 0x0000000000000005,
		DBM_DBuffer_ColorNormal            = 0x0000000000000006,
		DBM_DBuffer_ColorRoughness         = 0x0000000000000007,
		DBM_DBuffer_Normal                 = 0x0000000000000008,
		DBM_DBuffer_NormalRoughness        = 0x0000000000000009,
		DBM_DBuffer_Roughness              = 0x000000000000000A,
		DBM_DBuffer_Emissive               = 0x000000000000000B,
		DBM_DBuffer_AlphaComposite         = 0x000000000000000C,
		DBM_DBuffer_EmissiveAlphaComposite = 0x000000000000000D,
		DBM_Volumetric_DistanceFunction    = 0x000000000000000E,
		DBM_AlphaComposite                 = 0x000000000000000F,
		DBM_AmbientOcclusion               = 0x0000000000000010,
		DBM_MAX                            = 0x0000000000000011
	};

	/**
	 * Enum Engine.ETextureColorChannel
	 */
	enum class ETextureColorChannel : uint8_t
	{
		TCC_Red   = 0x0000000000000000,
		TCC_Green = 0x0000000000000001,
		TCC_Blue  = 0x0000000000000002,
		TCC_Alpha = 0x0000000000000003,
		TCC_MAX   = 0x0000000000000004
	};

	/**
	 * Enum Engine.EMaterialAttributeBlend
	 */
	enum class EMaterialAttributeBlend : uint8_t
	{
		Blend = 0x0000000000000000,
		UseA  = 0x0000000000000001,
		UseB  = 0x0000000000000002,
		MAX   = 0x0000000000000003
	};

	/**
	 * Enum Engine.EChannelMaskParameterColor
	 */
	enum class EChannelMaskParameterColor : uint8_t
	{
		Red   = 0x0000000000000000,
		Green = 0x0000000000000001,
		Blue  = 0x0000000000000002,
		Alpha = 0x0000000000000003,
		MAX   = 0x0000000000000004
	};

	/**
	 * Enum Engine.EClampMode
	 */
	enum class EClampMode : uint8_t
	{
		CMODE_Clamp    = 0x0000000000000000,
		CMODE_ClampMin = 0x0000000000000001,
		CMODE_ClampMax = 0x0000000000000002,
		CMODE_MAX      = 0x0000000000000003
	};

	/**
	 * Enum Engine.ECustomMaterialOutputType
	 */
	enum class ECustomMaterialOutputType : uint8_t
	{
		CMOT_Float1             = 0x0000000000000000,
		CMOT_Float2             = 0x0000000000000001,
		CMOT_Float3             = 0x0000000000000002,
		CMOT_Float4             = 0x0000000000000003,
		CMOT_MaterialAttributes = 0x0000000000000004,
		CMOT_MAX                = 0x0000000000000005
	};

	/**
	 * Enum Engine.EDepthOfFieldFunctionValue
	 */
	enum class EDepthOfFieldFunctionValue : uint8_t
	{
		TDOF_NearAndFarMask          = 0x0000000000000000,
		TDOF_NearMask                = 0x0000000000000001,
		TDOF_FarMask                 = 0x0000000000000002,
		TDOF_CircleOfConfusionRadius = 0x0000000000000003,
		TDOF_MAX                     = 0x0000000000000004
	};

	/**
	 * Enum Engine.EFunctionInputType
	 */
	enum class EFunctionInputType : uint8_t
	{
		FunctionInput_Scalar             = 0x0000000000000000,
		FunctionInput_Vector2            = 0x0000000000000001,
		FunctionInput_Vector3            = 0x0000000000000002,
		FunctionInput_Vector4            = 0x0000000000000003,
		FunctionInput_Texture2D          = 0x0000000000000004,
		FunctionInput_TextureCube        = 0x0000000000000005,
		FunctionInput_Texture2DArray     = 0x0000000000000006,
		FunctionInput_VolumeTexture      = 0x0000000000000007,
		FunctionInput_StaticBool         = 0x0000000000000008,
		FunctionInput_MaterialAttributes = 0x0000000000000009,
		FunctionInput_TextureExternal    = 0x000000000000000A,
		FunctionInput_MAX                = 0x000000000000000B
	};

	/**
	 * Enum Engine.ENoiseFunction
	 */
	enum class ENoiseFunction : uint8_t
	{
		NOISEFUNCTION_SimplexTex    = 0x0000000000000000,
		NOISEFUNCTION_GradientTex   = 0x0000000000000001,
		NOISEFUNCTION_GradientTex3D = 0x0000000000000002,
		NOISEFUNCTION_GradientALU   = 0x0000000000000003,
		NOISEFUNCTION_ValueALU      = 0x0000000000000004,
		NOISEFUNCTION_VoronoiALU    = 0x0000000000000005,
		NOISEFUNCTION_MAX           = 0x0000000000000006
	};

	/**
	 * Enum Engine.ERuntimeVirtualTextureTextureAddressMode
	 */
	enum class ERuntimeVirtualTextureTextureAddressMode : uint8_t
	{
		RVTTA_Clamp = 0x0000000000000000,
		RVTTA_Wrap  = 0x0000000000000001,
		RVTTA_MAX   = 0x0000000000000002
	};

	/**
	 * Enum Engine.ERuntimeVirtualTextureMipValueMode
	 */
	enum class ERuntimeVirtualTextureMipValueMode : uint8_t
	{
		RVTMVM_None     = 0x0000000000000000,
		RVTMVM_MipLevel = 0x0000000000000001,
		RVTMVM_MipBias  = 0x0000000000000002,
		RVTMVM_MAX      = 0x0000000000000003
	};

	/**
	 * Enum Engine.EMaterialSceneAttributeInputMode
	 */
	enum class EMaterialSceneAttributeInputMode : uint8_t
	{
		Coordinates    = 0x0000000000000000,
		OffsetFraction = 0x0000000000000001,
		MAX            = 0x0000000000000002
	};

	/**
	 * Enum Engine.ESpeedTreeLODType
	 */
	enum class ESpeedTreeLODType : uint8_t
	{
		STLOD_Pop    = 0x0000000000000000,
		STLOD_Smooth = 0x0000000000000001,
		STLOD_MAX    = 0x0000000000000002
	};

	/**
	 * Enum Engine.ESpeedTreeWindType
	 */
	enum class ESpeedTreeWindType : uint8_t
	{
		STW_None     = 0x0000000000000000,
		STW_Fastest  = 0x0000000000000001,
		STW_Fast     = 0x0000000000000002,
		STW_Better   = 0x0000000000000003,
		STW_Best     = 0x0000000000000004,
		STW_Palm     = 0x0000000000000005,
		STW_BestPlus = 0x0000000000000006,
		STW_MAX      = 0x0000000000000007
	};

	/**
	 * Enum Engine.ESpeedTreeGeometryType
	 */
	enum class ESpeedTreeGeometryType : uint8_t
	{
		STG_Branch     = 0x0000000000000000,
		STG_Frond      = 0x0000000000000001,
		STG_Leaf       = 0x0000000000000002,
		STG_FacingLeaf = 0x0000000000000003,
		STG_Billboard  = 0x0000000000000004,
		STG_MAX        = 0x0000000000000005
	};

	/**
	 * Enum Engine.EMaterialExposedTextureProperty
	 */
	enum class EMaterialExposedTextureProperty : uint8_t
	{
		TMTM_TextureSize = 0x0000000000000000,
		TMTM_TexelSize   = 0x0000000000000001,
		TMTM_MAX         = 0x0000000000000002
	};

	/**
	 * Enum Engine.ETextureMipValueMode
	 */
	enum class ETextureMipValueMode : uint8_t
	{
		TMVM_None       = 0x0000000000000000,
		TMVM_MipLevel   = 0x0000000000000001,
		TMVM_MipBias    = 0x0000000000000002,
		TMVM_Derivative = 0x0000000000000003,
		TMVM_MAX        = 0x0000000000000004
	};

	/**
	 * Enum Engine.EMaterialVectorCoordTransform
	 */
	enum class EMaterialVectorCoordTransform : uint8_t
	{
		TRANSFORM_Tangent       = 0x0000000000000000,
		TRANSFORM_Local         = 0x0000000000000001,
		TRANSFORM_World         = 0x0000000000000002,
		TRANSFORM_View          = 0x0000000000000003,
		TRANSFORM_Camera        = 0x0000000000000004,
		TRANSFORM_ParticleWorld = 0x0000000000000005,
		TRANSFORM_MAX           = 0x0000000000000006
	};

	/**
	 * Enum Engine.EMaterialVectorCoordTransformSource
	 */
	enum class EMaterialVectorCoordTransformSource : uint8_t
	{
		TRANSFORMSOURCE_Tangent       = 0x0000000000000000,
		TRANSFORMSOURCE_Local         = 0x0000000000000001,
		TRANSFORMSOURCE_World         = 0x0000000000000002,
		TRANSFORMSOURCE_View          = 0x0000000000000003,
		TRANSFORMSOURCE_Camera        = 0x0000000000000004,
		TRANSFORMSOURCE_ParticleWorld = 0x0000000000000005,
		TRANSFORMSOURCE_MAX           = 0x0000000000000006
	};

	/**
	 * Enum Engine.EMaterialPositionTransformSource
	 */
	enum class EMaterialPositionTransformSource : uint8_t
	{
		TRANSFORMPOSSOURCE_Local           = 0x0000000000000000,
		TRANSFORMPOSSOURCE_World           = 0x0000000000000001,
		TRANSFORMPOSSOURCE_TranslatedWorld = 0x0000000000000002,
		TRANSFORMPOSSOURCE_View            = 0x0000000000000003,
		TRANSFORMPOSSOURCE_Camera          = 0x0000000000000004,
		TRANSFORMPOSSOURCE_Particle        = 0x0000000000000005,
		TRANSFORMPOSSOURCE_MAX             = 0x0000000000000006
	};

	/**
	 * Enum Engine.EVectorNoiseFunction
	 */
	enum class EVectorNoiseFunction : uint8_t
	{
		VNF_CellnoiseALU = 0x0000000000000000,
		VNF_VectorALU    = 0x0000000000000001,
		VNF_GradientALU  = 0x0000000000000002,
		VNF_CurlALU      = 0x0000000000000003,
		VNF_VoronoiALU   = 0x0000000000000004,
		VNF_MAX          = 0x0000000000000005
	};

	/**
	 * Enum Engine.EMaterialExposedViewProperty
	 */
	enum class EMaterialExposedViewProperty : uint8_t
	{
		MEVP_BufferSize                            = 0x0000000000000000,
		MEVP_FieldOfView                           = 0x0000000000000001,
		MEVP_TanHalfFieldOfView                    = 0x0000000000000002,
		MEVP_ViewSize                              = 0x0000000000000003,
		MEVP_WorldSpaceViewPosition                = 0x0000000000000004,
		MEVP_WorldSpaceCameraPosition              = 0x0000000000000005,
		MEVP_ViewportOffset                        = 0x0000000000000006,
		MEVP_TemporalSampleCount                   = 0x0000000000000007,
		MEVP_TemporalSampleIndex                   = 0x0000000000000008,
		MEVP_TemporalSampleOffset                  = 0x0000000000000009,
		MEVP_RuntimeVirtualTextureOutputLevel      = 0x000000000000000A,
		MEVP_RuntimeVirtualTextureOutputDerivative = 0x000000000000000B,
		MEVP_PreExposure                           = 0x000000000000000C,
		MEVP_RuntimeVirtualTextureMaxLevel         = 0x000000000000000D,
		MEVP_MAX                                   = 0x000000000000000E
	};

	/**
	 * Enum Engine.EWorldPositionIncludedOffsets
	 */
	enum class EWorldPositionIncludedOffsets : uint8_t
	{
		WPT_Default                 = 0x0000000000000000,
		WPT_ExcludeAllShaderOffsets = 0x0000000000000001,
		WPT_CameraRelative          = 0x0000000000000002,
		WPT_CameraRelativeNoOffsets = 0x0000000000000003,
		WPT_MAX                     = 0x0000000000000004
	};

	/**
	 * Enum Engine.EMaterialFunctionUsage
	 */
	enum class EMaterialFunctionUsage : uint8_t
	{
		Default            = 0x0000000000000000,
		MaterialLayer      = 0x0000000000000001,
		MaterialLayerBlend = 0x0000000000000002,
		MAX                = 0x0000000000000003
	};

	/**
	 * Enum Engine.EMaterialUsage
	 */
	enum class EMaterialUsage : uint8_t
	{
		MATUSAGE_SkeletalMesh           = 0x0000000000000000,
		MATUSAGE_ParticleSprites        = 0x0000000000000001,
		MATUSAGE_BeamTrails             = 0x0000000000000002,
		MATUSAGE_MeshParticles          = 0x0000000000000003,
		MATUSAGE_StaticLighting         = 0x0000000000000004,
		MATUSAGE_MorphTargets           = 0x0000000000000005,
		MATUSAGE_SplineMesh             = 0x0000000000000006,
		MATUSAGE_InstancedStaticMeshes  = 0x0000000000000007,
		MATUSAGE_GeometryCollections    = 0x0000000000000008,
		MATUSAGE_Clothing               = 0x0000000000000009,
		MATUSAGE_NiagaraSprites         = 0x000000000000000A,
		MATUSAGE_NiagaraRibbons         = 0x000000000000000B,
		MATUSAGE_NiagaraMeshParticles   = 0x000000000000000C,
		MATUSAGE_GeometryCache          = 0x000000000000000D,
		MATUSAGE_Water                  = 0x000000000000000E,
		MATUSAGE_HairStrands            = 0x000000000000000F,
		MATUSAGE_LidarPointCloud        = 0x0000000000000010,
		MATUSAGE_VirtualHeightfieldMesh = 0x0000000000000011,
		MATUSAGE_MAX                    = 0x0000000000000012
	};

	/**
	 * Enum Engine.EMaterialLayerLinkState
	 */
	enum class EMaterialLayerLinkState : uint8_t
	{
		Uninitialized      = 0x0000000000000000,
		LinkedToParent     = 0x0000000000000001,
		UnlinkedFromParent = 0x0000000000000002,
		NotFromParent      = 0x0000000000000003,
		MAX                = 0x0000000000000004
	};

	/**
	 * Enum Engine.EMaterialParameterAssociation
	 */
	enum class EMaterialParameterAssociation : uint8_t
	{
		LayerParameter  = 0x0000000000000000,
		BlendParameter  = 0x0000000000000001,
		GlobalParameter = 0x0000000000000002,
		MAX             = 0x0000000000000003
	};

	/**
	 * Enum Engine.EMaterialMergeType
	 */
	enum class EMaterialMergeType : uint8_t
	{
		MaterialMergeType_Default   = 0x0000000000000000,
		MaterialMergeType_Simplygon = 0x0000000000000001,
		MaterialMergeType_MAX       = 0x0000000000000002
	};

	/**
	 * Enum Engine.ETextureSizingType
	 */
	enum class ETextureSizingType : uint8_t
	{
		TextureSizingType_UseSingleTextureSize         = 0x0000000000000000,
		TextureSizingType_UseAutomaticBiasedSizes      = 0x0000000000000001,
		TextureSizingType_UseManualOverrideTextureSize = 0x0000000000000002,
		TextureSizingType_UseSimplygonAutomaticSizing  = 0x0000000000000003,
		TextureSizingType_MAX                          = 0x0000000000000004
	};

	/**
	 * Enum Engine.ESceneTextureId
	 */
	enum class ESceneTextureId : uint8_t
	{
		PPI_SceneColor           = 0x0000000000000000,
		PPI_SceneDepth           = 0x0000000000000001,
		PPI_DiffuseColor         = 0x0000000000000002,
		PPI_SpecularColor        = 0x0000000000000003,
		PPI_SubsurfaceColor      = 0x0000000000000004,
		PPI_BaseColor            = 0x0000000000000005,
		PPI_Specular             = 0x0000000000000006,
		PPI_Metallic             = 0x0000000000000007,
		PPI_WorldNormal          = 0x0000000000000008,
		PPI_SeparateTranslucency = 0x0000000000000009,
		PPI_Opacity              = 0x000000000000000A,
		PPI_Roughness            = 0x000000000000000B,
		PPI_MaterialAO           = 0x000000000000000C,
		PPI_CustomDepth          = 0x000000000000000D,
		PPI_PostProcessInput0    = 0x000000000000000E,
		PPI_PostProcessInput1    = 0x000000000000000F,
		PPI_PostProcessInput2    = 0x0000000000000010,
		PPI_PostProcessInput3    = 0x0000000000000011,
		PPI_PostProcessInput4    = 0x0000000000000012,
		PPI_PostProcessInput5    = 0x0000000000000013,
		PPI_PostProcessInput6    = 0x0000000000000014,
		PPI_DecalMask            = 0x0000000000000015,
		PPI_ShadingModelColor    = 0x0000000000000016,
		PPI_ShadingModelID       = 0x0000000000000017,
		PPI_AmbientOcclusion     = 0x0000000000000018,
		PPI_CustomStencil        = 0x0000000000000019,
		PPI_StoredBaseColor      = 0x000000000000001A,
		PPI_StoredSpecular       = 0x000000000000001B,
		PPI_Velocity             = 0x000000000000001C,
		PPI_WorldTangent         = 0x000000000000001D,
		PPI_Anisotropy           = 0x000000000000001E,
		PPI_MAX                  = 0x000000000000001F
	};

	/**
	 * Enum Engine.EMaterialDomain
	 */
	enum class EMaterialDomain : uint8_t
	{
		MD_Surface               = 0x0000000000000000,
		MD_DeferredDecal         = 0x0000000000000001,
		MD_LightFunction         = 0x0000000000000002,
		MD_Volume                = 0x0000000000000003,
		MD_PostProcess           = 0x0000000000000004,
		MD_UI                    = 0x0000000000000005,
		MD_RuntimeVirtualTexture = 0x0000000000000006,
		MD_MAX                   = 0x0000000000000007
	};

	/**
	 * Enum Engine.EMeshInstancingReplacementMethod
	 */
	enum class EMeshInstancingReplacementMethod : uint8_t
	{
		RemoveOriginalActors           = 0x0000000000000000,
		KeepOriginalActorsAsEditorOnly = 0x0000000000000001,
		MAX                            = 0x0000000000000002
	};

	/**
	 * Enum Engine.EUVOutput
	 */
	enum class EUVOutput : uint8_t
	{
		DoNotOutputChannel = 0x0000000000000000,
		OutputChannel      = 0x0000000000000001,
		MAX                = 0x0000000000000002
	};

	/**
	 * Enum Engine.EMeshMergeType
	 */
	enum class EMeshMergeType : uint8_t
	{
		MeshMergeType_Default    = 0x0000000000000000,
		MeshMergeType_MergeActor = 0x0000000000000001,
		MeshMergeType_MAX        = 0x0000000000000002
	};

	/**
	 * Enum Engine.EMeshLODSelectionType
	 */
	enum class EMeshLODSelectionType : uint8_t
	{
		AllLODs         = 0x0000000000000000,
		SpecificLOD     = 0x0000000000000001,
		CalculateLOD    = 0x0000000000000002,
		LowestDetailLOD = 0x0000000000000003,
		MAX             = 0x0000000000000004
	};

	/**
	 * Enum Engine.EProxyNormalComputationMethod
	 */
	enum class EProxyNormalComputationMethod : uint8_t
	{
		AngleWeighted = 0x0000000000000000,
		AreaWeighted  = 0x0000000000000001,
		EqualWeighted = 0x0000000000000002,
		MAX           = 0x0000000000000003
	};

	/**
	 * Enum Engine.ELandscapeCullingPrecision
	 */
	enum class ELandscapeCullingPrecision : uint8_t
	{
		High   = 0x0000000000000000,
		Medium = 0x0000000000000001,
		Low    = 0x0000000000000002,
		MAX    = 0x0000000000000003
	};

	/**
	 * Enum Engine.EStaticMeshReductionTerimationCriterion
	 */
	enum class EStaticMeshReductionTerimationCriterion : uint8_t
	{
		Triangles = 0x0000000000000000,
		Vertices  = 0x0000000000000001,
		Any       = 0x0000000000000002,
		MAX       = 0x0000000000000003
	};

	/**
	 * Enum Engine.EMeshFeatureImportance
	 */
	enum class EMeshFeatureImportance : uint8_t
	{
		Off     = 0x0000000000000000,
		Lowest  = 0x0000000000000001,
		Low     = 0x0000000000000002,
		Normal  = 0x0000000000000003,
		High    = 0x0000000000000004,
		Highest = 0x0000000000000005,
		MAX     = 0x0000000000000006
	};

	/**
	 * Enum Engine.EVertexPaintAxis
	 */
	enum class EVertexPaintAxis : uint8_t
	{
		X   = 0x0000000000000000,
		Y   = 0x0000000000000001,
		Z   = 0x0000000000000002,
		MAX = 0x0000000000000003
	};

	/**
	 * Enum Engine.EMicroTransactionResult
	 */
	enum class EMicroTransactionResult : uint8_t
	{
		MTR_Succeeded          = 0x0000000000000000,
		MTR_Failed             = 0x0000000000000001,
		MTR_Canceled           = 0x0000000000000002,
		MTR_RestoredFromServer = 0x0000000000000003,
		MTR_MAX                = 0x0000000000000004
	};

	/**
	 * Enum Engine.EMicroTransactionDelegate
	 */
	enum class EMicroTransactionDelegate : uint8_t
	{
		MTD_PurchaseQueryComplete = 0x0000000000000000,
		MTD_PurchaseComplete      = 0x0000000000000001,
		MTD_MAX                   = 0x0000000000000002
	};

	/**
	 * Enum Engine.FNavigationSystemRunMode
	 */
	enum class EFNavigationSystemRunMode : uint8_t
	{
		FNavigationSystemRunMode__InvalidMode                  = 0x0000000000000000,
		FNavigationSystemRunMode__GameMode                     = 0x0000000000000001,
		FNavigationSystemRunMode__EditorMode                   = 0x0000000000000002,
		FNavigationSystemRunMode__SimulationMode               = 0x0000000000000003,
		FNavigationSystemRunMode__PIEMode                      = 0x0000000000000004,
		FNavigationSystemRunMode__InferFromWorldMode           = 0x0000000000000005,
		FNavigationSystemRunMode__FNavigationSystemRunMode_MAX = 0x0000000000000006
	};

	/**
	 * Enum Engine.ENavigationQueryResult
	 */
	enum class ENavigationQueryResult : uint8_t
	{
		Invalid = 0x0000000000000000,
		Error   = 0x0000000000000001,
		Fail    = 0x0000000000000002,
		Success = 0x0000000000000003,
		MAX     = 0x0000000000000004
	};

	/**
	 * Enum Engine.ENavPathEvent
	 */
	enum class ENavPathEvent : uint8_t
	{
		Cleared                       = 0x0000000000000000,
		NewPath                       = 0x0000000000000001,
		UpdatedDueToGoalMoved         = 0x0000000000000002,
		UpdatedDueToNavigationChanged = 0x0000000000000003,
		Invalidated                   = 0x0000000000000004,
		RePathFailed                  = 0x0000000000000005,
		MetaPathUpdate                = 0x0000000000000006,
		Custom                        = 0x0000000000000007,
		MAX                           = 0x0000000000000008
	};

	/**
	 * Enum Engine.ENavDataGatheringModeConfig
	 */
	enum class ENavDataGatheringModeConfig : uint8_t
	{
		Invalid = 0x0000000000000000,
		Instant = 0x0000000000000001,
		Lazy    = 0x0000000000000002,
		MAX     = 0x0000000000000003
	};

	/**
	 * Enum Engine.ENavDataGatheringMode
	 */
	enum class ENavDataGatheringMode : uint8_t
	{
		Default = 0x0000000000000000,
		Instant = 0x0000000000000001,
		Lazy    = 0x0000000000000002,
		MAX     = 0x0000000000000003
	};

	/**
	 * Enum Engine.ENavigationOptionFlag
	 */
	enum class ENavigationOptionFlag : uint8_t
	{
		Default = 0x0000000000000000,
		Enable  = 0x0000000000000001,
		Disable = 0x0000000000000002,
		MAX     = 0x0000000000000003
	};

	/**
	 * Enum Engine.ENavLinkDirection
	 */
	enum class ENavLinkDirection : uint8_t
	{
		BothWays    = 0x0000000000000000,
		LeftToRight = 0x0000000000000001,
		RightToLeft = 0x0000000000000002,
		MAX         = 0x0000000000000003
	};

	/**
	 * Enum Engine.EFastArraySerializerDeltaFlags
	 */
	enum class EFastArraySerializerDeltaFlags : uint8_t
	{
		None                      = 0x0000000000000000,
		HasBeenSerialized         = 0x0000000000000001,
		HasDeltaBeenRequested     = 0x0000000000000002,
		IsUsingDeltaSerialization = 0x0000000000000003,
		MAX                       = 0x0000000000000004
	};

	/**
	 * Enum Engine.EEmitterRenderMode
	 */
	enum class EEmitterRenderMode : uint8_t
	{
		ERM_Normal     = 0x0000000000000000,
		ERM_Point      = 0x0000000000000001,
		ERM_Cross      = 0x0000000000000002,
		ERM_LightsOnly = 0x0000000000000003,
		ERM_None       = 0x0000000000000004,
		ERM_MAX        = 0x0000000000000005
	};

	/**
	 * Enum Engine.EParticleSubUVInterpMethod
	 */
	enum class EParticleSubUVInterpMethod : uint8_t
	{
		PSUVIM_None         = 0x0000000000000000,
		PSUVIM_Linear       = 0x0000000000000001,
		PSUVIM_Linear_Blend = 0x0000000000000002,
		PSUVIM_Random       = 0x0000000000000003,
		PSUVIM_Random_Blend = 0x0000000000000004,
		PSUVIM_MAX          = 0x0000000000000005
	};

	/**
	 * Enum Engine.EParticleBurstMethod
	 */
	enum class EParticleBurstMethod : uint8_t
	{
		EPBM_Instant      = 0x0000000000000000,
		EPBM_Interpolated = 0x0000000000000001,
		EPBM_MAX          = 0x0000000000000002
	};

	/**
	 * Enum Engine.EParticleSystemInsignificanceReaction
	 */
	enum class EParticleSystemInsignificanceReaction : uint8_t
	{
		Auto               = 0x0000000000000000,
		Complete           = 0x0000000000000001,
		DisableTick        = 0x0000000000000002,
		DisableTickAndKill = 0x0000000000000003,
		Num                = 0x0000000000000004,
		MAX                = 0x0000000000000005
	};

	/**
	 * Enum Engine.EParticleSignificanceLevel
	 */
	enum class EParticleSignificanceLevel : uint8_t
	{
		Low      = 0x0000000000000000,
		Medium   = 0x0000000000000001,
		High     = 0x0000000000000002,
		Critical = 0x0000000000000003,
		Num      = 0x0000000000000004,
		MAX      = 0x0000000000000005
	};

	/**
	 * Enum Engine.EParticleDetailMode
	 */
	enum class EParticleDetailMode : uint8_t
	{
		PDM_Low    = 0x0000000000000000,
		PDM_Medium = 0x0000000000000001,
		PDM_High   = 0x0000000000000002,
		PDM_MAX    = 0x0000000000000003
	};

	/**
	 * Enum Engine.EParticleSourceSelectionMethod
	 */
	enum class EParticleSourceSelectionMethod : uint8_t
	{
		EPSSM_Random     = 0x0000000000000000,
		EPSSM_Sequential = 0x0000000000000001,
		EPSSM_MAX        = 0x0000000000000002
	};

	/**
	 * Enum Engine.EModuleType
	 */
	enum class EModuleType : uint8_t
	{
		EPMT_General  = 0x0000000000000000,
		EPMT_TypeData = 0x0000000000000001,
		EPMT_Beam     = 0x0000000000000002,
		EPMT_Trail    = 0x0000000000000003,
		EPMT_Spawn    = 0x0000000000000004,
		EPMT_Required = 0x0000000000000005,
		EPMT_Event    = 0x0000000000000006,
		EPMT_Light    = 0x0000000000000007,
		EPMT_SubUV    = 0x0000000000000008,
		EPMT_MAX      = 0x0000000000000009
	};

	/**
	 * Enum Engine.EAttractorParticleSelectionMethod
	 */
	enum class EAttractorParticleSelectionMethod : uint8_t
	{
		EAPSM_Random     = 0x0000000000000000,
		EAPSM_Sequential = 0x0000000000000001,
		EAPSM_MAX        = 0x0000000000000002
	};

	/**
	 * Enum Engine.Beam2SourceTargetTangentMethod
	 */
	enum class EBeam2SourceTargetTangentMethod : uint8_t
	{
		PEB2STTM_Direct       = 0x0000000000000000,
		PEB2STTM_UserSet      = 0x0000000000000001,
		PEB2STTM_Distribution = 0x0000000000000002,
		PEB2STTM_Emitter      = 0x0000000000000003,
		PEB2STTM_MAX          = 0x0000000000000004
	};

	/**
	 * Enum Engine.Beam2SourceTargetMethod
	 */
	enum class EBeam2SourceTargetMethod : uint8_t
	{
		PEB2STM_Default  = 0x0000000000000000,
		PEB2STM_UserSet  = 0x0000000000000001,
		PEB2STM_Emitter  = 0x0000000000000002,
		PEB2STM_Particle = 0x0000000000000003,
		PEB2STM_Actor    = 0x0000000000000004,
		PEB2STM_MAX      = 0x0000000000000005
	};

	/**
	 * Enum Engine.BeamModifierType
	 */
	enum class EBeamModifierType : uint8_t
	{
		PEB2MT_Source = 0x0000000000000000,
		PEB2MT_Target = 0x0000000000000001,
		PEB2MT_MAX    = 0x0000000000000002
	};

	/**
	 * Enum Engine.EParticleCameraOffsetUpdateMethod
	 */
	enum class EParticleCameraOffsetUpdateMethod : uint8_t
	{
		EPCOUM_DirectSet = 0x0000000000000000,
		EPCOUM_Additive  = 0x0000000000000001,
		EPCOUM_Scalar    = 0x0000000000000002,
		EPCOUM_MAX       = 0x0000000000000003
	};

	/**
	 * Enum Engine.EParticleCollisionComplete
	 */
	enum class EParticleCollisionComplete : uint8_t
	{
		EPCC_Kill              = 0x0000000000000000,
		EPCC_Freeze            = 0x0000000000000001,
		EPCC_HaltCollisions    = 0x0000000000000002,
		EPCC_FreezeTranslation = 0x0000000000000003,
		EPCC_FreezeRotation    = 0x0000000000000004,
		EPCC_FreezeMovement    = 0x0000000000000005,
		EPCC_MAX               = 0x0000000000000006
	};

	/**
	 * Enum Engine.EParticleCollisionResponse
	 */
	enum class EParticleCollisionResponse : uint8_t
	{
		Bounce = 0x0000000000000000,
		Stop   = 0x0000000000000001,
		Kill   = 0x0000000000000002,
		MAX    = 0x0000000000000003
	};

	/**
	 * Enum Engine.ELocationBoneSocketSelectionMethod
	 */
	enum class ELocationBoneSocketSelectionMethod : uint8_t
	{
		BONESOCKETSEL_Sequential = 0x0000000000000000,
		BONESOCKETSEL_Random     = 0x0000000000000001,
		BONESOCKETSEL_MAX        = 0x0000000000000002
	};

	/**
	 * Enum Engine.ELocationBoneSocketSource
	 */
	enum class ELocationBoneSocketSource : uint8_t
	{
		BONESOCKETSOURCE_Bones   = 0x0000000000000000,
		BONESOCKETSOURCE_Sockets = 0x0000000000000001,
		BONESOCKETSOURCE_MAX     = 0x0000000000000002
	};

	/**
	 * Enum Engine.ELocationEmitterSelectionMethod
	 */
	enum class ELocationEmitterSelectionMethod : uint8_t
	{
		ELESM_Random     = 0x0000000000000000,
		ELESM_Sequential = 0x0000000000000001,
		ELESM_MAX        = 0x0000000000000002
	};

	/**
	 * Enum Engine.CylinderHeightAxis
	 */
	enum class ECylinderHeightAxis : uint8_t
	{
		PMLPC_HEIGHTAXIS_X   = 0x0000000000000000,
		PMLPC_HEIGHTAXIS_Y   = 0x0000000000000001,
		PMLPC_HEIGHTAXIS_Z   = 0x0000000000000002,
		PMLPC_HEIGHTAXIS_MAX = 0x0000000000000003
	};

	/**
	 * Enum Engine.ELocationSkelVertSurfaceSource
	 */
	enum class ELocationSkelVertSurfaceSource : uint8_t
	{
		VERTSURFACESOURCE_Vert    = 0x0000000000000000,
		VERTSURFACESOURCE_Surface = 0x0000000000000001,
		VERTSURFACESOURCE_MAX     = 0x0000000000000002
	};

	/**
	 * Enum Engine.EOrbitChainMode
	 */
	enum class EOrbitChainMode : uint8_t
	{
		EOChainMode_Add   = 0x0000000000000000,
		EOChainMode_Scale = 0x0000000000000001,
		EOChainMode_Link  = 0x0000000000000002,
		EOChainMode_MAX   = 0x0000000000000003
	};

	/**
	 * Enum Engine.EParticleAxisLock
	 */
	enum class EParticleAxisLock : uint8_t
	{
		EPAL_NONE       = 0x0000000000000000,
		EPAL_X          = 0x0000000000000001,
		EPAL_Y          = 0x0000000000000002,
		EPAL_Z          = 0x0000000000000003,
		EPAL_NEGATIVE_X = 0x0000000000000004,
		EPAL_NEGATIVE_Y = 0x0000000000000005,
		EPAL_NEGATIVE_Z = 0x0000000000000006,
		EPAL_ROTATE_X   = 0x0000000000000007,
		EPAL_ROTATE_Y   = 0x0000000000000008,
		EPAL_ROTATE_Z   = 0x0000000000000009,
		EPAL_MAX        = 0x000000000000000A
	};

	/**
	 * Enum Engine.EEmitterDynamicParameterValue
	 */
	enum class EEmitterDynamicParameterValue : uint8_t
	{
		EDPV_UserSet     = 0x0000000000000000,
		EDPV_AutoSet     = 0x0000000000000001,
		EDPV_VelocityX   = 0x0000000000000002,
		EDPV_VelocityY   = 0x0000000000000003,
		EDPV_VelocityZ   = 0x0000000000000004,
		EDPV_VelocityMag = 0x0000000000000005,
		EDPV_MAX         = 0x0000000000000006
	};

	/**
	 * Enum Engine.EEmitterNormalsMode
	 */
	enum class EEmitterNormalsMode : uint8_t
	{
		ENM_CameraFacing = 0x0000000000000000,
		ENM_Spherical    = 0x0000000000000001,
		ENM_Cylindrical  = 0x0000000000000002,
		ENM_MAX          = 0x0000000000000003
	};

	/**
	 * Enum Engine.EParticleSortMode
	 */
	enum class EParticleSortMode : uint8_t
	{
		PSORTMODE_None            = 0x0000000000000000,
		PSORTMODE_ViewProjDepth   = 0x0000000000000001,
		PSORTMODE_DistanceToView  = 0x0000000000000002,
		PSORTMODE_Age_OldestFirst = 0x0000000000000003,
		PSORTMODE_Age_NewestFirst = 0x0000000000000004,
		PSORTMODE_MAX             = 0x0000000000000005
	};

	/**
	 * Enum Engine.EParticleUVFlipMode
	 */
	enum class EParticleUVFlipMode : uint8_t
	{
		None                    = 0x0000000000000000,
		FlipUV                  = 0x0000000000000001,
		FlipUOnly               = 0x0000000000000002,
		FlipVOnly               = 0x0000000000000003,
		RandomFlipUV            = 0x0000000000000004,
		RandomFlipUOnly         = 0x0000000000000005,
		RandomFlipVOnly         = 0x0000000000000006,
		RandomFlipUVIndependent = 0x0000000000000007,
		MAX                     = 0x0000000000000008
	};

	/**
	 * Enum Engine.ETrail2SourceMethod
	 */
	enum class ETrail2SourceMethod : uint8_t
	{
		PET2SRCM_Default  = 0x0000000000000000,
		PET2SRCM_Particle = 0x0000000000000001,
		PET2SRCM_Actor    = 0x0000000000000002,
		PET2SRCM_MAX      = 0x0000000000000003
	};

	/**
	 * Enum Engine.EBeamTaperMethod
	 */
	enum class EBeamTaperMethod : uint8_t
	{
		PEBTM_None    = 0x0000000000000000,
		PEBTM_Full    = 0x0000000000000001,
		PEBTM_Partial = 0x0000000000000002,
		PEBTM_MAX     = 0x0000000000000003
	};

	/**
	 * Enum Engine.EBeam2Method
	 */
	enum class EBeam2Method : uint8_t
	{
		PEB2M_Distance = 0x0000000000000000,
		PEB2M_Target   = 0x0000000000000001,
		PEB2M_Branch   = 0x0000000000000002,
		PEB2M_MAX      = 0x0000000000000003
	};

	/**
	 * Enum Engine.EMeshCameraFacingOptions
	 */
	enum class EMeshCameraFacingOptions : uint8_t
	{
		XAxisFacing_NoUp                    = 0x0000000000000000,
		XAxisFacing_ZUp                     = 0x0000000000000001,
		XAxisFacing_NegativeZUp             = 0x0000000000000002,
		XAxisFacing_YUp                     = 0x0000000000000003,
		XAxisFacing_NegativeYUp             = 0x0000000000000004,
		LockedAxis_ZAxisFacing              = 0x0000000000000005,
		LockedAxis_NegativeZAxisFacing      = 0x0000000000000006,
		LockedAxis_YAxisFacing              = 0x0000000000000007,
		LockedAxis_NegativeYAxisFacing      = 0x0000000000000008,
		VelocityAligned_ZAxisFacing         = 0x0000000000000009,
		VelocityAligned_NegativeZAxisFacing = 0x000000000000000A,
		VelocityAligned_YAxisFacing         = 0x000000000000000B,
		VelocityAligned_NegativeYAxisFacing = 0x000000000000000C,
		MAX                                 = 0x000000000000000D
	};

	/**
	 * Enum Engine.EMeshCameraFacingUpAxis
	 */
	enum class EMeshCameraFacingUpAxis : uint8_t
	{
		CameraFacing_NoneUP      = 0x0000000000000000,
		CameraFacing_ZUp         = 0x0000000000000001,
		CameraFacing_NegativeZUp = 0x0000000000000002,
		CameraFacing_YUp         = 0x0000000000000003,
		CameraFacing_NegativeYUp = 0x0000000000000004,
		CameraFacing_MAX         = 0x0000000000000005
	};

	/**
	 * Enum Engine.EMeshScreenAlignment
	 */
	enum class EMeshScreenAlignment : uint8_t
	{
		PSMA_MeshFaceCameraWithRoll       = 0x0000000000000000,
		PSMA_MeshFaceCameraWithSpin       = 0x0000000000000001,
		PSMA_MeshFaceCameraWithLockedAxis = 0x0000000000000002,
		PSMA_MAX                          = 0x0000000000000003
	};

	/**
	 * Enum Engine.ETrailsRenderAxisOption
	 */
	enum class ETrailsRenderAxisOption : uint8_t
	{
		Trails_CameraUp = 0x0000000000000000,
		Trails_SourceUp = 0x0000000000000001,
		Trails_WorldUp  = 0x0000000000000002,
		Trails_MAX      = 0x0000000000000003
	};

	/**
	 * Enum Engine.EParticleScreenAlignment
	 */
	enum class EParticleScreenAlignment : uint8_t
	{
		PSA_FacingCameraPosition      = 0x0000000000000000,
		PSA_Square                    = 0x0000000000000001,
		PSA_Rectangle                 = 0x0000000000000002,
		PSA_Velocity                  = 0x0000000000000003,
		PSA_AwayFromCenter            = 0x0000000000000004,
		PSA_TypeSpecific              = 0x0000000000000005,
		PSA_FacingCameraDistanceBlend = 0x0000000000000006,
		PSA_MAX                       = 0x0000000000000007
	};

	/**
	 * Enum Engine.EParticleSystemOcclusionBoundsMethod
	 */
	enum class EParticleSystemOcclusionBoundsMethod : uint8_t
	{
		EPSOBM_None           = 0x0000000000000000,
		EPSOBM_ParticleBounds = 0x0000000000000001,
		EPSOBM_CustomBounds   = 0x0000000000000002,
		EPSOBM_MAX            = 0x0000000000000003
	};

	/**
	 * Enum Engine.ParticleSystemLODMethod
	 */
	enum class EParticleSystemLODMethod : uint8_t
	{
		PARTICLESYSTEMLODMETHOD_Automatic         = 0x0000000000000000,
		PARTICLESYSTEMLODMETHOD_DirectSet         = 0x0000000000000001,
		PARTICLESYSTEMLODMETHOD_ActivateAutomatic = 0x0000000000000002,
		PARTICLESYSTEMLODMETHOD_MAX               = 0x0000000000000003
	};

	/**
	 * Enum Engine.EParticleSystemUpdateMode
	 */
	enum class EParticleSystemUpdateMode : uint8_t
	{
		EPSUM_RealTime  = 0x0000000000000000,
		EPSUM_FixedTime = 0x0000000000000001,
		EPSUM_MAX       = 0x0000000000000002
	};

	/**
	 * Enum Engine.EParticleEventType
	 */
	enum class EParticleEventType : uint8_t
	{
		EPET_Any       = 0x0000000000000000,
		EPET_Spawn     = 0x0000000000000001,
		EPET_Death     = 0x0000000000000002,
		EPET_Collision = 0x0000000000000003,
		EPET_Burst     = 0x0000000000000004,
		EPET_Blueprint = 0x0000000000000005,
		EPET_MAX       = 0x0000000000000006
	};

	/**
	 * Enum Engine.ParticleReplayState
	 */
	enum class EParticleReplayState : uint8_t
	{
		PRS_Disabled  = 0x0000000000000000,
		PRS_Capturing = 0x0000000000000001,
		PRS_Replaying = 0x0000000000000002,
		PRS_MAX       = 0x0000000000000003
	};

	/**
	 * Enum Engine.EParticleSysParamType
	 */
	enum class EParticleSysParamType : uint8_t
	{
		PSPT_None           = 0x0000000000000000,
		PSPT_Scalar         = 0x0000000000000001,
		PSPT_ScalarRand     = 0x0000000000000002,
		PSPT_Vector         = 0x0000000000000003,
		PSPT_VectorRand     = 0x0000000000000004,
		PSPT_Color          = 0x0000000000000005,
		PSPT_Actor          = 0x0000000000000006,
		PSPT_Material       = 0x0000000000000007,
		PSPT_VectorUnitRand = 0x0000000000000008,
		PSPT_MAX            = 0x0000000000000009
	};

	/**
	 * Enum Engine.ESettingsLockedAxis
	 */
	enum class ESettingsLockedAxis : uint8_t
	{
		None    = 0x0000000000000000,
		X       = 0x0000000000000001,
		Y       = 0x0000000000000002,
		Z       = 0x0000000000000003,
		Invalid = 0x0000000000000004,
		MAX     = 0x0000000000000005
	};

	/**
	 * Enum Engine.ESettingsDOF
	 */
	enum class ESettingsDOF : uint8_t
	{
		Full3D  = 0x0000000000000000,
		YZPlane = 0x0000000000000001,
		XZPlane = 0x0000000000000002,
		XYPlane = 0x0000000000000003,
		MAX     = 0x0000000000000004
	};

	/**
	 * Enum Engine.EViewTargetBlendFunction
	 */
	enum class EViewTargetBlendFunction : uint8_t
	{
		VTBlend_Linear    = 0x0000000000000000,
		VTBlend_Cubic     = 0x0000000000000001,
		VTBlend_EaseIn    = 0x0000000000000002,
		VTBlend_EaseOut   = 0x0000000000000003,
		VTBlend_EaseInOut = 0x0000000000000004,
		VTBlend_MAX       = 0x0000000000000005
	};

	/**
	 * Enum Engine.EDynamicForceFeedbackAction
	 */
	enum class EDynamicForceFeedbackAction : uint8_t
	{
		Start  = 0x0000000000000000,
		Update = 0x0000000000000001,
		Stop   = 0x0000000000000002,
		MAX    = 0x0000000000000003
	};

	/**
	 * Enum Engine.EHasCustomNavigableGeometry
	 */
	enum class EHasCustomNavigableGeometry : uint8_t
	{
		No                  = 0x0000000000000000,
		Yes                 = 0x0000000000000001,
		EvenIfNotCollidable = 0x0000000000000002,
		DontExport          = 0x0000000000000003,
		MAX                 = 0x0000000000000004
	};

	/**
	 * Enum Engine.EQuarztQuantizationReference
	 */
	enum class EQuarztQuantizationReference : uint8_t
	{
		BarRelative         = 0x0000000000000000,
		TransportRelative   = 0x0000000000000001,
		CurrentTimeRelative = 0x0000000000000002,
		Count               = 0x0000000000000003,
		MAX                 = 0x0000000000000004
	};

	/**
	 * Enum Engine.EQuartzDelegateType
	 */
	enum class EQuartzDelegateType : uint8_t
	{
		MetronomeTick = 0x0000000000000000,
		CommandEvent  = 0x0000000000000001,
		Count         = 0x0000000000000002,
		MAX           = 0x0000000000000003
	};

	/**
	 * Enum Engine.EQuartzTimeSignatureQuantization
	 */
	enum class EQuartzTimeSignatureQuantization : uint8_t
	{
		HalfNote         = 0x0000000000000000,
		QuarterNote      = 0x0000000000000001,
		EighthNote       = 0x0000000000000002,
		SixteenthNote    = 0x0000000000000003,
		ThirtySecondNote = 0x0000000000000004,
		Count            = 0x0000000000000005,
		MAX              = 0x0000000000000006
	};

	/**
	 * Enum Engine.ERichCurveExtrapolation
	 */
	enum class ERichCurveExtrapolation : uint8_t
	{
		RCCE_Cycle           = 0x0000000000000000,
		RCCE_CycleWithOffset = 0x0000000000000001,
		RCCE_Oscillate       = 0x0000000000000002,
		RCCE_Linear          = 0x0000000000000003,
		RCCE_Constant        = 0x0000000000000004,
		RCCE_None            = 0x0000000000000005,
		RCCE_MAX             = 0x0000000000000006
	};

	/**
	 * Enum Engine.ERichCurveInterpMode
	 */
	enum class ERichCurveInterpMode : uint8_t
	{
		RCIM_Linear   = 0x0000000000000000,
		RCIM_Constant = 0x0000000000000001,
		RCIM_Cubic    = 0x0000000000000002,
		RCIM_None     = 0x0000000000000003,
		RCIM_MAX      = 0x0000000000000004
	};

	/**
	 * Enum Engine.EMobileReflectionCompression
	 */
	enum class EMobileReflectionCompression : uint8_t
	{
		Default = 0x0000000000000000,
		On      = 0x0000000000000001,
		Off     = 0x0000000000000002,
		MAX     = 0x0000000000000003
	};

	/**
	 * Enum Engine.EReflectionSourceType
	 */
	enum class EReflectionSourceType : uint8_t
	{
		CapturedScene    = 0x0000000000000000,
		SpecifiedCubemap = 0x0000000000000001,
		MAX              = 0x0000000000000002
	};

	/**
	 * Enum Engine.EDefaultBackBufferPixelFormat
	 */
	enum class EDefaultBackBufferPixelFormat : uint8_t
	{
		DBBPF_B8G8R8A8                = 0x0000000000000000,
		DBBPF_A16B16G16R16_DEPRECATED = 0x0000000000000001,
		DBBPF_FloatRGB_DEPRECATED     = 0x0000000000000002,
		DBBPF_FloatRGBA               = 0x0000000000000003,
		DBBPF_A2B10G10R10             = 0x0000000000000004,
		DBBPF_MAX                     = 0x0000000000000005
	};

	/**
	 * Enum Engine.EAutoExposureMethodUI
	 */
	enum class EAutoExposureMethodUI : uint8_t
	{
		AEM_Histogram = 0x0000000000000000,
		AEM_Basic     = 0x0000000000000001,
		AEM_Manual    = 0x0000000000000002,
		AEM_MAX       = 0x0000000000000003
	};

	/**
	 * Enum Engine.EAlphaChannelMode
	 */
	enum class EAlphaChannelMode : uint8_t
	{
		Disabled               = 0x0000000000000000,
		LinearColorSpaceOnly   = 0x0000000000000001,
		AllowThroughTonemapper = 0x0000000000000002,
		MAX                    = 0x0000000000000003
	};

	/**
	 * Enum Engine.EEarlyZPass
	 */
	enum class EEarlyZPass : uint8_t
	{
		None            = 0x0000000000000000,
		OpaqueOnly      = 0x0000000000000001,
		OpaqueAndMasked = 0x0000000000000002,
		Auto            = 0x0000000000000003,
		MAX             = 0x0000000000000004
	};

	/**
	 * Enum Engine.ECustomDepthStencil
	 */
	enum class ECustomDepthStencil : uint8_t
	{
		Disabled           = 0x0000000000000000,
		Enabled            = 0x0000000000000001,
		EnabledOnDemand    = 0x0000000000000002,
		EnabledWithStencil = 0x0000000000000003,
		MAX                = 0x0000000000000004
	};

	/**
	 * Enum Engine.EMobileMSAASampleCount
	 */
	enum class EMobileMSAASampleCount : uint8_t
	{
		One   = 0x0000000000000000,
		Two   = 0x0000000000000001,
		Four  = 0x0000000000000002,
		Eight = 0x0000000000000003,
		MAX   = 0x0000000000000004
	};

	/**
	 * Enum Engine.ECompositingSampleCount
	 */
	enum class ECompositingSampleCount : uint8_t
	{
		One   = 0x0000000000000000,
		Two   = 0x0000000000000001,
		Four  = 0x0000000000000002,
		Eight = 0x0000000000000003,
		MAX   = 0x0000000000000004
	};

	/**
	 * Enum Engine.EClearSceneOptions
	 */
	enum class EClearSceneOptions : uint8_t
	{
		NoClear       = 0x0000000000000000,
		HardwareClear = 0x0000000000000001,
		QuadAtMaxZ    = 0x0000000000000002,
		MAX           = 0x0000000000000003
	};

	/**
	 * Enum Engine.EReporterLineStyle
	 */
	enum class EReporterLineStyle : uint8_t
	{
		Line = 0x0000000000000000,
		Dash = 0x0000000000000001,
		MAX  = 0x0000000000000002
	};

	/**
	 * Enum Engine.ELegendPosition
	 */
	enum class ELegendPosition : uint8_t
	{
		Outside = 0x0000000000000000,
		Inside  = 0x0000000000000001,
		MAX     = 0x0000000000000002
	};

	/**
	 * Enum Engine.EGraphDataStyle
	 */
	enum class EGraphDataStyle : uint8_t
	{
		Lines  = 0x0000000000000000,
		Filled = 0x0000000000000001,
		MAX    = 0x0000000000000002
	};

	/**
	 * Enum Engine.EGraphAxisStyle
	 */
	enum class EGraphAxisStyle : uint8_t
	{
		Lines   = 0x0000000000000000,
		Notches = 0x0000000000000001,
		Grid    = 0x0000000000000002,
		MAX     = 0x0000000000000003
	};

	/**
	 * Enum Engine.ReverbPreset
	 */
	enum class EReverbPreset : uint8_t
	{
		REVERB_Default       = 0x0000000000000000,
		REVERB_Bathroom      = 0x0000000000000001,
		REVERB_StoneRoom     = 0x0000000000000002,
		REVERB_Auditorium    = 0x0000000000000003,
		REVERB_ConcertHall   = 0x0000000000000004,
		REVERB_Cave          = 0x0000000000000005,
		REVERB_Hallway       = 0x0000000000000006,
		REVERB_StoneCorridor = 0x0000000000000007,
		REVERB_Alley         = 0x0000000000000008,
		REVERB_Forest        = 0x0000000000000009,
		REVERB_City          = 0x000000000000000A,
		REVERB_Mountains     = 0x000000000000000B,
		REVERB_Quarry        = 0x000000000000000C,
		REVERB_Plain         = 0x000000000000000D,
		REVERB_ParkingLot    = 0x000000000000000E,
		REVERB_SewerPipe     = 0x000000000000000F,
		REVERB_Underwater    = 0x0000000000000010,
		REVERB_SmallRoom     = 0x0000000000000011,
		REVERB_MediumRoom    = 0x0000000000000012,
		REVERB_LargeRoom     = 0x0000000000000013,
		REVERB_MediumHall    = 0x0000000000000014,
		REVERB_LargeHall     = 0x0000000000000015,
		REVERB_Plate         = 0x0000000000000016,
		REVERB_MAX           = 0x0000000000000017
	};

	/**
	 * Enum Engine.ERichCurveKeyTimeCompressionFormat
	 */
	enum class ERichCurveKeyTimeCompressionFormat : uint8_t
	{
		RCKTCF_uint16  = 0x0000000000000000,
		RCKTCF_float32 = 0x0000000000000001,
		RCKTCF_MAX     = 0x0000000000000002
	};

	/**
	 * Enum Engine.ERichCurveCompressionFormat
	 */
	enum class ERichCurveCompressionFormat : uint8_t
	{
		RCCF_Empty    = 0x0000000000000000,
		RCCF_Constant = 0x0000000000000001,
		RCCF_Linear   = 0x0000000000000002,
		RCCF_Cubic    = 0x0000000000000003,
		RCCF_Mixed    = 0x0000000000000004,
		RCCF_Weighted = 0x0000000000000005,
		RCCF_MAX      = 0x0000000000000006
	};

	/**
	 * Enum Engine.ERichCurveTangentWeightMode
	 */
	enum class ERichCurveTangentWeightMode : uint8_t
	{
		RCTWM_WeightedNone   = 0x0000000000000000,
		RCTWM_WeightedArrive = 0x0000000000000001,
		RCTWM_WeightedLeave  = 0x0000000000000002,
		RCTWM_WeightedBoth   = 0x0000000000000003,
		RCTWM_MAX            = 0x0000000000000004
	};

	/**
	 * Enum Engine.ERichCurveTangentMode
	 */
	enum class ERichCurveTangentMode : uint8_t
	{
		RCTM_Auto  = 0x0000000000000000,
		RCTM_User  = 0x0000000000000001,
		RCTM_Break = 0x0000000000000002,
		RCTM_None  = 0x0000000000000003,
		RCTM_MAX   = 0x0000000000000004
	};

	/**
	 * Enum Engine.EConstraintTransform
	 */
	enum class EConstraintTransform : uint8_t
	{
		Absolute = 0x0000000000000000,
		Relative = 0x0000000000000001,
		MAX      = 0x0000000000000002
	};

	/**
	 * Enum Engine.EControlConstraint
	 */
	enum class EControlConstraint : uint8_t
	{
		Orientation = 0x0000000000000000,
		Translation = 0x0000000000000001,
		MAX         = 0x0000000000000002
	};

	/**
	 * Enum Engine.ERootMotionFinishVelocityMode
	 */
	enum class ERootMotionFinishVelocityMode : uint8_t
	{
		MaintainLastRootMotionVelocity = 0x0000000000000000,
		SetVelocity                    = 0x0000000000000001,
		ClampVelocity                  = 0x0000000000000002,
		MAX                            = 0x0000000000000003
	};

	/**
	 * Enum Engine.ERootMotionSourceSettingsFlags
	 */
	enum class ERootMotionSourceSettingsFlags : uint8_t
	{
		UseSensitiveLiftoffCheck = 0x0000000000000000,
		DisablePartialEndTick    = 0x0000000000000001,
		IgnoreZAccumulate        = 0x0000000000000002,
		MAX                      = 0x0000000000000003
	};

	/**
	 * Enum Engine.ERootMotionSourceStatusFlags
	 */
	enum class ERootMotionSourceStatusFlags : uint8_t
	{
		Prepared         = 0x0000000000000000,
		Finished         = 0x0000000000000001,
		MarkedForRemoval = 0x0000000000000002,
		MAX              = 0x0000000000000003
	};

	/**
	 * Enum Engine.ERootMotionAccumulateMode
	 */
	enum class ERootMotionAccumulateMode : uint8_t
	{
		Override = 0x0000000000000000,
		Additive = 0x0000000000000001,
		MAX      = 0x0000000000000002
	};

	/**
	 * Enum Engine.ERuntimeVirtualTextureMainPassType
	 */
	enum class ERuntimeVirtualTextureMainPassType : uint8_t
	{
		Never     = 0x0000000000000000,
		Exclusive = 0x0000000000000001,
		Always    = 0x0000000000000002,
		MAX       = 0x0000000000000003
	};

	/**
	 * Enum Engine.ERuntimeVirtualTextureMaterialType
	 */
	enum class ERuntimeVirtualTextureMaterialType : uint8_t
	{
		BaseColor                            = 0x0000000000000000,
		BaseColor_Normal_DEPRECATED          = 0x0000000000000001,
		BaseColor_Normal_Specular            = 0x0000000000000002,
		BaseColor_Normal_Specular_YCoCg      = 0x0000000000000003,
		BaseColor_Normal_Specular_Mask_YCoCg = 0x0000000000000004,
		WorldHeight                          = 0x0000000000000005,
		Count                                = 0x0000000000000006,
		MAX                                  = 0x0000000000000007
	};

	/**
	 * Enum Engine.EMobilePixelProjectedReflectionQuality
	 */
	enum class EMobilePixelProjectedReflectionQuality : uint8_t
	{
		Disabled        = 0x0000000000000000,
		BestPerformance = 0x0000000000000001,
		BetterQuality   = 0x0000000000000002,
		BestQuality     = 0x0000000000000003,
		MAX             = 0x0000000000000004
	};

	/**
	 * Enum Engine.EMobilePlanarReflectionMode
	 */
	enum class EMobilePlanarReflectionMode : uint8_t
	{
		Usual              = 0x0000000000000000,
		MobilePPRExclusive = 0x0000000000000001,
		MobilePPR          = 0x0000000000000002,
		MAX                = 0x0000000000000003
	};

	/**
	 * Enum Engine.EReflectedAndRefractedRayTracedShadows
	 */
	enum class EReflectedAndRefractedRayTracedShadows : uint8_t
	{
		Disabled     = 0x0000000000000000,
		Hard_shadows = 0x0000000000000001,
		Area_shadows = 0x0000000000000002,
		MAX          = 0x0000000000000003
	};

	/**
	 * Enum Engine.ERayTracingGlobalIlluminationType
	 */
	enum class ERayTracingGlobalIlluminationType : uint8_t
	{
		Disabled    = 0x0000000000000000,
		BruteForce  = 0x0000000000000001,
		FinalGather = 0x0000000000000002,
		MAX         = 0x0000000000000003
	};

	/**
	 * Enum Engine.ETranslucencyType
	 */
	enum class ETranslucencyType : uint8_t
	{
		Raster     = 0x0000000000000000,
		RayTracing = 0x0000000000000001,
		MAX        = 0x0000000000000002
	};

	/**
	 * Enum Engine.EReflectionsType
	 */
	enum class EReflectionsType : uint8_t
	{
		ScreenSpace = 0x0000000000000000,
		RayTracing  = 0x0000000000000001,
		MAX         = 0x0000000000000002
	};

	/**
	 * Enum Engine.ELightUnits
	 */
	enum class ELightUnits : uint8_t
	{
		Unitless = 0x0000000000000000,
		Candelas = 0x0000000000000001,
		Lumens   = 0x0000000000000002,
		MAX      = 0x0000000000000003
	};

	/**
	 * Enum Engine.EBloomMethod
	 */
	enum class EBloomMethod : uint8_t
	{
		BM_SOG = 0x0000000000000000,
		BM_FFT = 0x0000000000000001,
		BM_MAX = 0x0000000000000002
	};

	/**
	 * Enum Engine.EAutoExposureMethod
	 */
	enum class EAutoExposureMethod : uint8_t
	{
		AEM_Histogram = 0x0000000000000000,
		AEM_Basic     = 0x0000000000000001,
		AEM_Manual    = 0x0000000000000002,
		AEM_MAX       = 0x0000000000000003
	};

	/**
	 * Enum Engine.EAntiAliasingMethod
	 */
	enum class EAntiAliasingMethod : uint8_t
	{
		AAM_None       = 0x0000000000000000,
		AAM_FXAA       = 0x0000000000000001,
		AAM_TemporalAA = 0x0000000000000002,
		AAM_MSAA       = 0x0000000000000003,
		AAM_MAX        = 0x0000000000000004
	};

	/**
	 * Enum Engine.EDepthOfFieldMethod
	 */
	enum class EDepthOfFieldMethod : uint8_t
	{
		DOFM_BokehDOF  = 0x0000000000000000,
		DOFM_Gaussian  = 0x0000000000000001,
		DOFM_CircleDOF = 0x0000000000000002,
		DOFM_MAX       = 0x0000000000000003
	};

	/**
	 * Enum Engine.ESceneCapturePrimitiveRenderMode
	 */
	enum class ESceneCapturePrimitiveRenderMode : uint8_t
	{
		PRM_LegacySceneCapture    = 0x0000000000000000,
		PRM_RenderScenePrimitives = 0x0000000000000001,
		PRM_UseShowOnlyList       = 0x0000000000000002,
		PRM_MAX                   = 0x0000000000000003
	};

	/**
	 * Enum Engine.EMaterialProperty
	 */
	enum class EMaterialProperty : uint8_t
	{
		MP_EmissiveColor          = 0x0000000000000000,
		MP_Opacity                = 0x0000000000000001,
		MP_OpacityMask            = 0x0000000000000002,
		MP_DiffuseColor           = 0x0000000000000003,
		MP_SpecularColor          = 0x0000000000000004,
		MP_BaseColor              = 0x0000000000000005,
		MP_Metallic               = 0x0000000000000006,
		MP_Specular               = 0x0000000000000007,
		MP_Roughness              = 0x0000000000000008,
		MP_Anisotropy             = 0x0000000000000009,
		MP_Normal                 = 0x000000000000000A,
		MP_Tangent                = 0x000000000000000B,
		MP_WorldPositionOffset    = 0x000000000000000C,
		MP_WorldDisplacement      = 0x000000000000000D,
		MP_TessellationMultiplier = 0x000000000000000E,
		MP_SubsurfaceColor        = 0x000000000000000F,
		MP_CustomData0            = 0x0000000000000010,
		MP_CustomData1            = 0x0000000000000011,
		MP_AmbientOcclusion       = 0x0000000000000012,
		MP_Refraction             = 0x0000000000000013,
		MP_CustomizedUVs0         = 0x0000000000000014,
		MP_CustomizedUVs1         = 0x0000000000000015,
		MP_CustomizedUVs2         = 0x0000000000000016,
		MP_CustomizedUVs3         = 0x0000000000000017,
		MP_CustomizedUVs4         = 0x0000000000000018,
		MP_CustomizedUVs5         = 0x0000000000000019,
		MP_CustomizedUVs6         = 0x000000000000001A,
		MP_CustomizedUVs7         = 0x000000000000001B,
		MP_PixelDepthOffset       = 0x000000000000001C,
		MP_ShadingModel           = 0x000000000000001D,
		MP_MaterialAttributes     = 0x000000000000001E,
		MP_CustomOutput           = 0x000000000000001F,
		MP_MAX                    = 0x0000000000000020
	};

	/**
	 * Enum Engine.ESkinCacheDefaultBehavior
	 */
	enum class ESkinCacheDefaultBehavior : uint8_t
	{
		Exclusive = 0x0000000000000000,
		Inclusive = 0x0000000000000001,
		MAX       = 0x0000000000000002
	};

	/**
	 * Enum Engine.ESkinCacheUsage
	 */
	enum class ESkinCacheUsage : uint8_t
	{
		Auto     = 0x0000000000000000,
		Disabled = 0x0000000000000001,
		Enabled  = 0x0000000000000002,
		MAX      = 0x0000000000000003
	};

	/**
	 * Enum Engine.EPhysicsTransformUpdateMode
	 */
	enum class EPhysicsTransformUpdateMode : uint8_t
	{
		SimulationUpatesComponentTransform = 0x0000000000000000,
		ComponentTransformIsKinematic      = 0x0000000000000001,
		MAX                                = 0x0000000000000002
	};

	/**
	 * Enum Engine.EAnimationMode
	 */
	enum class EAnimationMode : uint8_t
	{
		AnimationBlueprint  = 0x0000000000000000,
		AnimationSingleNode = 0x0000000000000001,
		AnimationCustomMode = 0x0000000000000002,
		MAX                 = 0x0000000000000003
	};

	/**
	 * Enum Engine.EKinematicBonesUpdateToPhysics
	 */
	enum class EKinematicBonesUpdateToPhysics : uint8_t
	{
		SkipSimulatingBones = 0x0000000000000000,
		SkipAllBones        = 0x0000000000000001,
		MAX                 = 0x0000000000000002
	};

	/**
	 * Enum Engine.ECustomBoneAttributeLookup
	 */
	enum class ECustomBoneAttributeLookup : uint8_t
	{
		BoneOnly        = 0x0000000000000000,
		ImmediateParent = 0x0000000000000001,
		ParentHierarchy = 0x0000000000000002,
		MAX             = 0x0000000000000003
	};

	/**
	 * Enum Engine.EClothMassMode
	 */
	enum class EClothMassMode : uint8_t
	{
		UniformMass      = 0x0000000000000000,
		TotalMass        = 0x0000000000000001,
		Density          = 0x0000000000000002,
		MaxClothMassMode = 0x0000000000000003,
		MAX              = 0x0000000000000004
	};

	/**
	 * Enum Engine.EAnimCurveType
	 */
	enum class EAnimCurveType : uint8_t
	{
		AttributeCurve   = 0x0000000000000000,
		MaterialCurve    = 0x0000000000000001,
		MorphTargetCurve = 0x0000000000000002,
		MaxAnimCurveType = 0x0000000000000003,
		MAX              = 0x0000000000000004
	};

	/**
	 * Enum Engine.ESkeletalMeshSkinningImportVersions
	 */
	enum class ESkeletalMeshSkinningImportVersions : uint8_t
	{
		Before_Versionning        = 0x0000000000000000,
		SkeletalMeshBuildRefactor = 0x0000000000000001,
		VersionPlusOne            = 0x0000000000000002,
		LatestVersion             = 0x0000000000000003,
		MAX                       = 0x0000000000000004
	};

	/**
	 * Enum Engine.ESkeletalMeshGeoImportVersions
	 */
	enum class ESkeletalMeshGeoImportVersions : uint8_t
	{
		Before_Versionning        = 0x0000000000000000,
		SkeletalMeshBuildRefactor = 0x0000000000000001,
		VersionPlusOne            = 0x0000000000000002,
		LatestVersion             = 0x0000000000000003,
		MAX                       = 0x0000000000000004
	};

	/**
	 * Enum Engine.EBoneFilterActionOption
	 */
	enum class EBoneFilterActionOption : uint8_t
	{
		Remove  = 0x0000000000000000,
		Keep    = 0x0000000000000001,
		Invalid = 0x0000000000000002,
		MAX     = 0x0000000000000003
	};

	/**
	 * Enum Engine.SkeletalMeshOptimizationImportance
	 */
	enum class ESkeletalMeshOptimizationImportance : uint8_t
	{
		SMOI_Off     = 0x0000000000000000,
		SMOI_Lowest  = 0x0000000000000001,
		SMOI_Low     = 0x0000000000000002,
		SMOI_Normal  = 0x0000000000000003,
		SMOI_High    = 0x0000000000000004,
		SMOI_Highest = 0x0000000000000005,
		SMOI_MAX     = 0x0000000000000006
	};

	/**
	 * Enum Engine.SkeletalMeshOptimizationType
	 */
	enum class ESkeletalMeshOptimizationType : uint8_t
	{
		SMOT_NumOfTriangles      = 0x0000000000000000,
		SMOT_MaxDeviation        = 0x0000000000000001,
		SMOT_TriangleOrDeviation = 0x0000000000000002,
		SMOT_MAX                 = 0x0000000000000003
	};

	/**
	 * Enum Engine.SkeletalMeshTerminationCriterion
	 */
	enum class ESkeletalMeshTerminationCriterion : uint8_t
	{
		SMTC_NumOfTriangles    = 0x0000000000000000,
		SMTC_NumOfVerts        = 0x0000000000000001,
		SMTC_TriangleOrVert    = 0x0000000000000002,
		SMTC_AbsNumOfTriangles = 0x0000000000000003,
		SMTC_AbsNumOfVerts     = 0x0000000000000004,
		SMTC_AbsTriangleOrVert = 0x0000000000000005,
		SMTC_MAX               = 0x0000000000000006
	};

	/**
	 * Enum Engine.EBoneTranslationRetargetingMode
	 */
	enum class EBoneTranslationRetargetingMode : uint8_t
	{
		Animation         = 0x0000000000000000,
		Skeleton          = 0x0000000000000001,
		AnimationScaled   = 0x0000000000000002,
		AnimationRelative = 0x0000000000000003,
		OrientAndScale    = 0x0000000000000004,
		MAX               = 0x0000000000000005
	};

	/**
	 * Enum Engine.EVertexOffsetUsageType
	 */
	enum class EVertexOffsetUsageType : uint8_t
	{
		None               = 0x0000000000000000,
		PreSkinningOffset  = 0x0000000000000001,
		PostSkinningOffset = 0x0000000000000002,
		MAX                = 0x0000000000000003
	};

	/**
	 * Enum Engine.EBoneSpaces
	 */
	enum class EBoneSpaces : uint8_t
	{
		WorldSpace     = 0x0000000000000000,
		ComponentSpace = 0x0000000000000001,
		MAX            = 0x0000000000000002
	};

	/**
	 * Enum Engine.EVisibilityBasedAnimTickOption
	 */
	enum class EVisibilityBasedAnimTickOption : uint8_t
	{
		AlwaysTickPoseAndRefreshBones   = 0x0000000000000000,
		AlwaysTickPose                  = 0x0000000000000001,
		OnlyTickMontagesWhenNotRendered = 0x0000000000000002,
		OnlyTickPoseWhenRendered        = 0x0000000000000003,
		MAX                             = 0x0000000000000004
	};

	/**
	 * Enum Engine.EPhysBodyOp
	 */
	enum class EPhysBodyOp : uint8_t
	{
		PBO_None = 0x0000000000000000,
		PBO_Term = 0x0000000000000001,
		PBO_MAX  = 0x0000000000000002
	};

	/**
	 * Enum Engine.EBoneVisibilityStatus
	 */
	enum class EBoneVisibilityStatus : uint8_t
	{
		BVS_HiddenByParent   = 0x0000000000000000,
		BVS_Visible          = 0x0000000000000001,
		BVS_ExplicitlyHidden = 0x0000000000000002,
		BVS_MAX              = 0x0000000000000003
	};

	/**
	 * Enum Engine.ESkyAtmosphereTransformMode
	 */
	enum class ESkyAtmosphereTransformMode : uint8_t
	{
		PlanetTopAtAbsoluteWorldOrigin   = 0x0000000000000000,
		PlanetTopAtComponentTransform    = 0x0000000000000001,
		PlanetCenterAtComponentTransform = 0x0000000000000002,
		MAX                              = 0x0000000000000003
	};

	/**
	 * Enum Engine.ESkyLightSourceType
	 */
	enum class ESkyLightSourceType : uint8_t
	{
		SLS_CapturedScene    = 0x0000000000000000,
		SLS_SpecifiedCubemap = 0x0000000000000001,
		SLS_MAX              = 0x0000000000000002
	};

	/**
	 * Enum Engine.EPriorityAttenuationMethod
	 */
	enum class EPriorityAttenuationMethod : uint8_t
	{
		Linear      = 0x0000000000000000,
		CustomCurve = 0x0000000000000001,
		Manual      = 0x0000000000000002,
		MAX         = 0x0000000000000003
	};

	/**
	 * Enum Engine.ESubmixSendMethod
	 */
	enum class ESubmixSendMethod : uint8_t
	{
		Linear      = 0x0000000000000000,
		CustomCurve = 0x0000000000000001,
		Manual      = 0x0000000000000002,
		MAX         = 0x0000000000000003
	};

	/**
	 * Enum Engine.EReverbSendMethod
	 */
	enum class EReverbSendMethod : uint8_t
	{
		Linear      = 0x0000000000000000,
		CustomCurve = 0x0000000000000001,
		Manual      = 0x0000000000000002,
		MAX         = 0x0000000000000003
	};

	/**
	 * Enum Engine.EAirAbsorptionMethod
	 */
	enum class EAirAbsorptionMethod : uint8_t
	{
		Linear      = 0x0000000000000000,
		CustomCurve = 0x0000000000000001,
		MAX         = 0x0000000000000002
	};

	/**
	 * Enum Engine.ESoundSpatializationAlgorithm
	 */
	enum class ESoundSpatializationAlgorithm : uint8_t
	{
		SPATIALIZATION_Default = 0x0000000000000000,
		SPATIALIZATION_HRTF    = 0x0000000000000001,
		SPATIALIZATION_MAX     = 0x0000000000000002
	};

	/**
	 * Enum Engine.ESoundDistanceCalc
	 */
	enum class ESoundDistanceCalc : uint8_t
	{
		SOUNDDISTANCE_Normal          = 0x0000000000000000,
		SOUNDDISTANCE_InfiniteXYPlane = 0x0000000000000001,
		SOUNDDISTANCE_InfiniteXZPlane = 0x0000000000000002,
		SOUNDDISTANCE_InfiniteYZPlane = 0x0000000000000003,
		SOUNDDISTANCE_MAX             = 0x0000000000000004
	};

	/**
	 * Enum Engine.EVirtualizationMode
	 */
	enum class EVirtualizationMode : uint8_t
	{
		Disabled       = 0x0000000000000000,
		PlayWhenSilent = 0x0000000000000001,
		Restart        = 0x0000000000000002,
		MAX            = 0x0000000000000003
	};

	/**
	 * Enum Engine.EConcurrencyVolumeScaleMode
	 */
	enum class EConcurrencyVolumeScaleMode : uint8_t
	{
		Default  = 0x0000000000000000,
		Distance = 0x0000000000000001,
		Priority = 0x0000000000000002,
		MAX      = 0x0000000000000003
	};

	/**
	 * Enum Engine.EMaxConcurrentResolutionRule
	 */
	enum class EMaxConcurrentResolutionRule : uint8_t
	{
		PreventNew                       = 0x0000000000000000,
		StopOldest                       = 0x0000000000000001,
		StopFarthestThenPreventNew       = 0x0000000000000002,
		StopFarthestThenOldest           = 0x0000000000000003,
		StopLowestPriority               = 0x0000000000000004,
		StopQuietest                     = 0x0000000000000005,
		StopLowestPriorityThenPreventNew = 0x0000000000000006,
		Count                            = 0x0000000000000007,
		MAX                              = 0x0000000000000008
	};

	/**
	 * Enum Engine.ESoundGroup
	 */
	enum class ESoundGroup : uint8_t
	{
		SOUNDGROUP_Default          = 0x0000000000000000,
		SOUNDGROUP_Effects          = 0x0000000000000001,
		SOUNDGROUP_UI               = 0x0000000000000002,
		SOUNDGROUP_Music            = 0x0000000000000003,
		SOUNDGROUP_Voice            = 0x0000000000000004,
		SOUNDGROUP_GameSoundGroup1  = 0x0000000000000005,
		SOUNDGROUP_GameSoundGroup2  = 0x0000000000000006,
		SOUNDGROUP_GameSoundGroup3  = 0x0000000000000007,
		SOUNDGROUP_GameSoundGroup4  = 0x0000000000000008,
		SOUNDGROUP_GameSoundGroup5  = 0x0000000000000009,
		SOUNDGROUP_GameSoundGroup6  = 0x000000000000000A,
		SOUNDGROUP_GameSoundGroup7  = 0x000000000000000B,
		SOUNDGROUP_GameSoundGroup8  = 0x000000000000000C,
		SOUNDGROUP_GameSoundGroup9  = 0x000000000000000D,
		SOUNDGROUP_GameSoundGroup10 = 0x000000000000000E,
		SOUNDGROUP_GameSoundGroup11 = 0x000000000000000F,
		SOUNDGROUP_GameSoundGroup12 = 0x0000000000000010,
		SOUNDGROUP_GameSoundGroup13 = 0x0000000000000011,
		SOUNDGROUP_GameSoundGroup14 = 0x0000000000000012,
		SOUNDGROUP_GameSoundGroup15 = 0x0000000000000013,
		SOUNDGROUP_GameSoundGroup16 = 0x0000000000000014,
		SOUNDGROUP_GameSoundGroup17 = 0x0000000000000015,
		SOUNDGROUP_GameSoundGroup18 = 0x0000000000000016,
		SOUNDGROUP_GameSoundGroup19 = 0x0000000000000017,
		SOUNDGROUP_GameSoundGroup20 = 0x0000000000000018,
		SOUNDGROUP_MAX              = 0x0000000000000019
	};

	/**
	 * Enum Engine.EModulationRouting
	 */
	enum class EModulationRouting : uint8_t
	{
		Disable  = 0x0000000000000000,
		Inherit  = 0x0000000000000001,
		Override = 0x0000000000000002,
		MAX      = 0x0000000000000003
	};

	/**
	 * Enum Engine.ModulationParamMode
	 */
	enum class EModulationParamMode : uint8_t
	{
		MPM_Normal = 0x0000000000000000,
		MPM_Abs    = 0x0000000000000001,
		MPM_Direct = 0x0000000000000002,
		MPM_MAX    = 0x0000000000000003
	};

	/**
	 * Enum Engine.ESourceBusChannels
	 */
	enum class ESourceBusChannels : uint8_t
	{
		Mono   = 0x0000000000000000,
		Stereo = 0x0000000000000001,
		MAX    = 0x0000000000000002
	};

	/**
	 * Enum Engine.ESourceBusSendLevelControlMethod
	 */
	enum class ESourceBusSendLevelControlMethod : uint8_t
	{
		Linear      = 0x0000000000000000,
		CustomCurve = 0x0000000000000001,
		Manual      = 0x0000000000000002,
		MAX         = 0x0000000000000003
	};

	/**
	 * Enum Engine.EGainParamMode
	 */
	enum class EGainParamMode : uint8_t
	{
		Linear   = 0x0000000000000000,
		Decibels = 0x0000000000000001,
		MAX      = 0x0000000000000002
	};

	/**
	 * Enum Engine.EAudioSpectrumType
	 */
	enum class EAudioSpectrumType : uint8_t
	{
		MagnitudeSpectrum = 0x0000000000000000,
		PowerSpectrum     = 0x0000000000000001,
		Decibel           = 0x0000000000000002,
		MAX               = 0x0000000000000003
	};

	/**
	 * Enum Engine.EFFTWindowType
	 */
	enum class EFFTWindowType : uint8_t
	{
		None     = 0x0000000000000000,
		Hamming  = 0x0000000000000001,
		Hann     = 0x0000000000000002,
		Blackman = 0x0000000000000003,
		MAX      = 0x0000000000000004
	};

	/**
	 * Enum Engine.EFFTPeakInterpolationMethod
	 */
	enum class EFFTPeakInterpolationMethod : uint8_t
	{
		NearestNeighbor = 0x0000000000000000,
		Linear          = 0x0000000000000001,
		Quadratic       = 0x0000000000000002,
		ConstantQ       = 0x0000000000000003,
		MAX             = 0x0000000000000004
	};

	/**
	 * Enum Engine.EFFTSize
	 */
	enum class EFFTSize : uint8_t
	{
		DefaultSize = 0x0000000000000000,
		Min         = 0x0000000000000001,
		Small       = 0x0000000000000002,
		Medium      = 0x0000000000000003,
		Large       = 0x0000000000000004,
		VeryLarge   = 0x0000000000000005,
		Max         = 0x0000000000000006
	};

	/**
	 * Enum Engine.ESubmixSendStage
	 */
	enum class ESubmixSendStage : uint8_t
	{
		PostDistanceAttenuation = 0x0000000000000000,
		PreDistanceAttenuation  = 0x0000000000000001,
		MAX                     = 0x0000000000000002
	};

	/**
	 * Enum Engine.ESendLevelControlMethod
	 */
	enum class ESendLevelControlMethod : uint8_t
	{
		Linear      = 0x0000000000000000,
		CustomCurve = 0x0000000000000001,
		Manual      = 0x0000000000000002,
		MAX         = 0x0000000000000003
	};

	/**
	 * Enum Engine.EAudioRecordingExportType
	 */
	enum class EAudioRecordingExportType : uint8_t
	{
		SoundWave = 0x0000000000000000,
		WavFile   = 0x0000000000000001,
		MAX       = 0x0000000000000002
	};

	/**
	 * Enum Engine.EAudioSpectrumBandPresetType
	 */
	enum class EAudioSpectrumBandPresetType : uint8_t
	{
		KickDrum  = 0x0000000000000000,
		SnareDrum = 0x0000000000000001,
		Voice     = 0x0000000000000002,
		Cymbals   = 0x0000000000000003,
		MAX       = 0x0000000000000004
	};

	/**
	 * Enum Engine.ESoundWaveFFTSize
	 */
	enum class ESoundWaveFFTSize : uint8_t
	{
		VerySmall = 0x0000000000000000,
		Small     = 0x0000000000000001,
		Medium    = 0x0000000000000002,
		Large     = 0x0000000000000003,
		VeryLarge = 0x0000000000000004,
		MAX       = 0x0000000000000005
	};

	/**
	 * Enum Engine.EDecompressionType
	 */
	enum class EDecompressionType : uint8_t
	{
		DTYPE_Setup      = 0x0000000000000000,
		DTYPE_Invalid    = 0x0000000000000001,
		DTYPE_Preview    = 0x0000000000000002,
		DTYPE_Native     = 0x0000000000000003,
		DTYPE_RealTime   = 0x0000000000000004,
		DTYPE_Procedural = 0x0000000000000005,
		DTYPE_Xenon      = 0x0000000000000006,
		DTYPE_Streaming  = 0x0000000000000007,
		DTYPE_MAX        = 0x0000000000000008
	};

	/**
	 * Enum Engine.ESoundWaveLoadingBehavior
	 */
	enum class ESoundWaveLoadingBehavior : uint8_t
	{
		Inherited     = 0x0000000000000000,
		RetainOnLoad  = 0x0000000000000001,
		PrimeOnLoad   = 0x0000000000000002,
		LoadOnDemand  = 0x0000000000000003,
		ForceInline   = 0x0000000000000004,
		Uninitialized = 0x0000000000000005,
		MAX           = 0x0000000000000006
	};

	/**
	 * Enum Engine.ESplineCoordinateSpace
	 */
	enum class ESplineCoordinateSpace : uint8_t
	{
		Local = 0x0000000000000000,
		World = 0x0000000000000001,
		MAX   = 0x0000000000000002
	};

	/**
	 * Enum Engine.ESplinePointType
	 */
	enum class ESplinePointType : uint8_t
	{
		Linear             = 0x0000000000000000,
		Curve              = 0x0000000000000001,
		Constant           = 0x0000000000000002,
		CurveClamped       = 0x0000000000000003,
		CurveCustomTangent = 0x0000000000000004,
		MAX                = 0x0000000000000005
	};

	/**
	 * Enum Engine.ESplineMeshAxis
	 */
	enum class ESplineMeshAxis : uint8_t
	{
		X   = 0x0000000000000000,
		Y   = 0x0000000000000001,
		Z   = 0x0000000000000002,
		MAX = 0x0000000000000003
	};

	/**
	 * Enum Engine.EOptimizationType
	 */
	enum class EOptimizationType : uint8_t
	{
		OT_NumOfTriangles = 0x0000000000000000,
		OT_MaxDeviation   = 0x0000000000000001,
		OT_MAX            = 0x0000000000000002
	};

	/**
	 * Enum Engine.EImportanceLevel
	 */
	enum class EImportanceLevel : uint8_t
	{
		IL_Off       = 0x0000000000000000,
		IL_Lowest    = 0x0000000000000001,
		IL_Low       = 0x0000000000000002,
		IL_Normal    = 0x0000000000000003,
		IL_High      = 0x0000000000000004,
		IL_Highest   = 0x0000000000000005,
		TEMP_BROKEN2 = 0x0000000000000006,
		MAX          = 0x0000000000000007
	};

	/**
	 * Enum Engine.ENormalMode
	 */
	enum class ENormalMode : uint8_t
	{
		NM_PreserveSmoothingGroups  = 0x0000000000000000,
		NM_RecalculateNormals       = 0x0000000000000001,
		NM_RecalculateNormalsSmooth = 0x0000000000000002,
		NM_RecalculateNormalsHard   = 0x0000000000000003,
		TEMP_BROKEN                 = 0x0000000000000004,
		MAX                         = 0x0000000000000005
	};

	/**
	 * Enum Engine.EStereoLayerShape
	 */
	enum class EStereoLayerShape : uint8_t
	{
		SLSH_QuadLayer     = 0x0000000000000000,
		SLSH_CylinderLayer = 0x0000000000000001,
		SLSH_CubemapLayer  = 0x0000000000000002,
		SLSH_EquirectLayer = 0x0000000000000003,
		SLSH_MAX           = 0x0000000000000004
	};

	/**
	 * Enum Engine.EStereoLayerType
	 */
	enum class EStereoLayerType : uint8_t
	{
		SLT_WorldLocked   = 0x0000000000000000,
		SLT_TrackerLocked = 0x0000000000000001,
		SLT_FaceLocked    = 0x0000000000000002,
		SLT_MAX           = 0x0000000000000003
	};

	/**
	 * Enum Engine.EOpacitySourceMode
	 */
	enum class EOpacitySourceMode : uint8_t
	{
		OSM_Alpha           = 0x0000000000000000,
		OSM_ColorBrightness = 0x0000000000000001,
		OSM_RedChannel      = 0x0000000000000002,
		OSM_GreenChannel    = 0x0000000000000003,
		OSM_BlueChannel     = 0x0000000000000004,
		OSM_MAX             = 0x0000000000000005
	};

	/**
	 * Enum Engine.ESubUVBoundingVertexCount
	 */
	enum class ESubUVBoundingVertexCount : uint8_t
	{
		BVC_FourVertices  = 0x0000000000000000,
		BVC_EightVertices = 0x0000000000000001,
		BVC_MAX           = 0x0000000000000002
	};

	/**
	 * Enum Engine.EVerticalTextAligment
	 */
	enum class EVerticalTextAligment : uint8_t
	{
		EVRTA_TextTop    = 0x0000000000000000,
		EVRTA_TextCenter = 0x0000000000000001,
		EVRTA_TextBottom = 0x0000000000000002,
		EVRTA_QuadTop    = 0x0000000000000003,
		EVRTA_MAX        = 0x0000000000000004
	};

	/**
	 * Enum Engine.EHorizTextAligment
	 */
	enum class EHorizTextAligment : uint8_t
	{
		EHTA_Left   = 0x0000000000000000,
		EHTA_Center = 0x0000000000000001,
		EHTA_Right  = 0x0000000000000002,
		EHTA_MAX    = 0x0000000000000003
	};

	/**
	 * Enum Engine.ETextureLossyCompressionAmount
	 */
	enum class ETextureLossyCompressionAmount : uint8_t
	{
		TLCA_Default = 0x0000000000000000,
		TLCA_None    = 0x0000000000000001,
		TLCA_Lowest  = 0x0000000000000002,
		TLCA_Low     = 0x0000000000000003,
		TLCA_Medium  = 0x0000000000000004,
		TLCA_High    = 0x0000000000000005,
		TLCA_Highest = 0x0000000000000006,
		TLCA_MAX     = 0x0000000000000007
	};

	/**
	 * Enum Engine.ETextureCompressionQuality
	 */
	enum class ETextureCompressionQuality : uint8_t
	{
		TCQ_Default = 0x0000000000000000,
		TCQ_Lowest  = 0x0000000000000001,
		TCQ_Low     = 0x0000000000000002,
		TCQ_Medium  = 0x0000000000000003,
		TCQ_High    = 0x0000000000000004,
		TCQ_Highest = 0x0000000000000005,
		TCQ_MAX     = 0x0000000000000006
	};

	/**
	 * Enum Engine.ETextureSourceFormat
	 */
	enum class ETextureSourceFormat : uint8_t
	{
		TSF_Invalid = 0x0000000000000000,
		TSF_G8      = 0x0000000000000001,
		TSF_BGRA8   = 0x0000000000000002,
		TSF_BGRE8   = 0x0000000000000003,
		TSF_RGBA16  = 0x0000000000000004,
		TSF_RGBA16F = 0x0000000000000005,
		TSF_RGBA8   = 0x0000000000000006,
		TSF_RGBE8   = 0x0000000000000007,
		TSF_G16     = 0x0000000000000008,
		TSF_MAX     = 0x0000000000000009
	};

	/**
	 * Enum Engine.ETextureSourceArtType
	 */
	enum class ETextureSourceArtType : uint8_t
	{
		TSAT_Uncompressed  = 0x0000000000000000,
		TSAT_PNGCompressed = 0x0000000000000001,
		TSAT_DDSFile       = 0x0000000000000002,
		TSAT_MAX           = 0x0000000000000003
	};

	/**
	 * Enum Engine.ETextureMipCount
	 */
	enum class ETextureMipCount : uint8_t
	{
		TMC_ResidentMips  = 0x0000000000000000,
		TMC_AllMips       = 0x0000000000000001,
		TMC_AllMipsBiased = 0x0000000000000002,
		TMC_MAX           = 0x0000000000000003
	};

	/**
	 * Enum Engine.ECompositeTextureMode
	 */
	enum class ECompositeTextureMode : uint8_t
	{
		CTM_Disabled               = 0x0000000000000000,
		CTM_NormalRoughnessToRed   = 0x0000000000000001,
		CTM_NormalRoughnessToGreen = 0x0000000000000002,
		CTM_NormalRoughnessToBlue  = 0x0000000000000003,
		CTM_NormalRoughnessToAlpha = 0x0000000000000004,
		CTM_MAX                    = 0x0000000000000005
	};

	/**
	 * Enum Engine.TextureAddress
	 */
	enum class ETextureAddress : uint8_t
	{
		TA_Wrap   = 0x0000000000000000,
		TA_Clamp  = 0x0000000000000001,
		TA_Mirror = 0x0000000000000002,
		TA_MAX    = 0x0000000000000003
	};

	/**
	 * Enum Engine.TextureFilter
	 */
	enum class ETextureFilter : uint8_t
	{
		TF_Nearest   = 0x0000000000000000,
		TF_Bilinear  = 0x0000000000000001,
		TF_Trilinear = 0x0000000000000002,
		TF_Default   = 0x0000000000000003,
		TF_MAX       = 0x0000000000000004
	};

	/**
	 * Enum Engine.TextureCompressionSettings
	 */
	enum class ETextureCompressionSettings : uint8_t
	{
		TC_Default               = 0x0000000000000000,
		TC_Normalmap             = 0x0000000000000001,
		TC_Masks                 = 0x0000000000000002,
		TC_Grayscale             = 0x0000000000000003,
		TC_Displacementmap       = 0x0000000000000004,
		TC_VectorDisplacementmap = 0x0000000000000005,
		TC_HDR                   = 0x0000000000000006,
		TC_EditorIcon            = 0x0000000000000007,
		TC_Alpha                 = 0x0000000000000008,
		TC_DistanceFieldFont     = 0x0000000000000009,
		TC_HDR_Compressed        = 0x000000000000000A,
		TC_BC7                   = 0x000000000000000B,
		TC_HalfFloat             = 0x000000000000000C,
		TC_ReflectionCapture     = 0x000000000000000D,
		TC_MAX                   = 0x000000000000000E
	};

	/**
	 * Enum Engine.ETextureDownscaleOptions
	 */
	enum class ETextureDownscaleOptions : uint8_t
	{
		Default       = 0x0000000000000000,
		Unfiltered    = 0x0000000000000001,
		SimpleAverage = 0x0000000000000002,
		Sharpen0      = 0x0000000000000003,
		Sharpen1      = 0x0000000000000004,
		Sharpen2      = 0x0000000000000005,
		Sharpen3      = 0x0000000000000006,
		Sharpen4      = 0x0000000000000007,
		Sharpen5      = 0x0000000000000008,
		Sharpen6      = 0x0000000000000009,
		Sharpen7      = 0x000000000000000A,
		Sharpen8      = 0x000000000000000B,
		Sharpen9      = 0x000000000000000C,
		Sharpen10     = 0x000000000000000D,
		MAX           = 0x000000000000000E
	};

	/**
	 * Enum Engine.ETextureMipLoadOptions
	 */
	enum class ETextureMipLoadOptions : uint8_t
	{
		Default      = 0x0000000000000000,
		AllMips      = 0x0000000000000001,
		OnlyFirstMip = 0x0000000000000002,
		MAX          = 0x0000000000000003
	};

	/**
	 * Enum Engine.ETextureSamplerFilter
	 */
	enum class ETextureSamplerFilter : uint8_t
	{
		Point             = 0x0000000000000000,
		Bilinear          = 0x0000000000000001,
		Trilinear         = 0x0000000000000002,
		AnisotropicPoint  = 0x0000000000000003,
		AnisotropicLinear = 0x0000000000000004,
		MAX               = 0x0000000000000005
	};

	/**
	 * Enum Engine.ETexturePowerOfTwoSetting
	 */
	enum class ETexturePowerOfTwoSetting : uint8_t
	{
		None                  = 0x0000000000000000,
		PadToPowerOfTwo       = 0x0000000000000001,
		PadToSquarePowerOfTwo = 0x0000000000000002,
		MAX                   = 0x0000000000000003
	};

	/**
	 * Enum Engine.TextureMipGenSettings
	 */
	enum class ETextureMipGenSettings : uint8_t
	{
		TMGS_FromTextureGroup  = 0x0000000000000000,
		TMGS_SimpleAverage     = 0x0000000000000001,
		TMGS_Sharpen0          = 0x0000000000000002,
		TMGS_Sharpen1          = 0x0000000000000003,
		TMGS_Sharpen2          = 0x0000000000000004,
		TMGS_Sharpen3          = 0x0000000000000005,
		TMGS_Sharpen4          = 0x0000000000000006,
		TMGS_Sharpen5          = 0x0000000000000007,
		TMGS_Sharpen6          = 0x0000000000000008,
		TMGS_Sharpen7          = 0x0000000000000009,
		TMGS_Sharpen8          = 0x000000000000000A,
		TMGS_Sharpen9          = 0x000000000000000B,
		TMGS_Sharpen10         = 0x000000000000000C,
		TMGS_NoMipmaps         = 0x000000000000000D,
		TMGS_LeaveExistingMips = 0x000000000000000E,
		TMGS_Blur1             = 0x000000000000000F,
		TMGS_Blur2             = 0x0000000000000010,
		TMGS_Blur3             = 0x0000000000000011,
		TMGS_Blur4             = 0x0000000000000012,
		TMGS_Blur5             = 0x0000000000000013,
		TMGS_Unfiltered        = 0x0000000000000014,
		TMGS_MAX               = 0x0000000000000015
	};

	/**
	 * Enum Engine.TextureGroup
	 */
	enum class ETextureGroup : uint8_t
	{
		TEXTUREGROUP_World                 = 0x0000000000000000,
		TEXTUREGROUP_WorldNormalMap        = 0x0000000000000001,
		TEXTUREGROUP_WorldSpecular         = 0x0000000000000002,
		TEXTUREGROUP_Character             = 0x0000000000000003,
		TEXTUREGROUP_CharacterNormalMap    = 0x0000000000000004,
		TEXTUREGROUP_CharacterSpecular     = 0x0000000000000005,
		TEXTUREGROUP_Weapon                = 0x0000000000000006,
		TEXTUREGROUP_WeaponNormalMap       = 0x0000000000000007,
		TEXTUREGROUP_WeaponSpecular        = 0x0000000000000008,
		TEXTUREGROUP_Vehicle               = 0x0000000000000009,
		TEXTUREGROUP_VehicleNormalMap      = 0x000000000000000A,
		TEXTUREGROUP_VehicleSpecular       = 0x000000000000000B,
		TEXTUREGROUP_Cinematic             = 0x000000000000000C,
		TEXTUREGROUP_Effects               = 0x000000000000000D,
		TEXTUREGROUP_EffectsNotFiltered    = 0x000000000000000E,
		TEXTUREGROUP_Skybox                = 0x000000000000000F,
		TEXTUREGROUP_UI                    = 0x0000000000000010,
		TEXTUREGROUP_Lightmap              = 0x0000000000000011,
		TEXTUREGROUP_RenderTarget          = 0x0000000000000012,
		TEXTUREGROUP_MobileFlattened       = 0x0000000000000013,
		TEXTUREGROUP_ProcBuilding_Face     = 0x0000000000000014,
		TEXTUREGROUP_ProcBuilding_LightMap = 0x0000000000000015,
		TEXTUREGROUP_Shadowmap             = 0x0000000000000016,
		TEXTUREGROUP_ColorLookupTable      = 0x0000000000000017,
		TEXTUREGROUP_Terrain_Heightmap     = 0x0000000000000018,
		TEXTUREGROUP_Terrain_Weightmap     = 0x0000000000000019,
		TEXTUREGROUP_Bokeh                 = 0x000000000000001A,
		TEXTUREGROUP_IESLightProfile       = 0x000000000000001B,
		TEXTUREGROUP_Pixels2D              = 0x000000000000001C,
		TEXTUREGROUP_HierarchicalLOD       = 0x000000000000001D,
		TEXTUREGROUP_Impostor              = 0x000000000000001E,
		TEXTUREGROUP_ImpostorNormalDepth   = 0x000000000000001F,
		TEXTUREGROUP_8BitData              = 0x0000000000000020,
		TEXTUREGROUP_16BitData             = 0x0000000000000021,
		TEXTUREGROUP_Project01             = 0x0000000000000022,
		TEXTUREGROUP_Project02             = 0x0000000000000023,
		TEXTUREGROUP_Project03             = 0x0000000000000024,
		TEXTUREGROUP_Project04             = 0x0000000000000025,
		TEXTUREGROUP_Project05             = 0x0000000000000026,
		TEXTUREGROUP_Project06             = 0x0000000000000027,
		TEXTUREGROUP_Project07             = 0x0000000000000028,
		TEXTUREGROUP_Project08             = 0x0000000000000029,
		TEXTUREGROUP_Project09             = 0x000000000000002A,
		TEXTUREGROUP_Project10             = 0x000000000000002B,
		TEXTUREGROUP_Project11             = 0x000000000000002C,
		TEXTUREGROUP_Project12             = 0x000000000000002D,
		TEXTUREGROUP_Project13             = 0x000000000000002E,
		TEXTUREGROUP_Project14             = 0x000000000000002F,
		TEXTUREGROUP_Project15             = 0x0000000000000030,
		TEXTUREGROUP_MAX                   = 0x0000000000000031
	};

	/**
	 * Enum Engine.ETextureRenderTargetFormat
	 */
	enum class ETextureRenderTargetFormat : uint8_t
	{
		RTF_R8         = 0x0000000000000000,
		RTF_RG8        = 0x0000000000000001,
		RTF_RGBA8      = 0x0000000000000002,
		RTF_RGBA8_SRGB = 0x0000000000000003,
		RTF_R16f       = 0x0000000000000004,
		RTF_RG16f      = 0x0000000000000005,
		RTF_RGBA16f    = 0x0000000000000006,
		RTF_R32f       = 0x0000000000000007,
		RTF_RG32f      = 0x0000000000000008,
		RTF_RGBA32f    = 0x0000000000000009,
		RTF_RGB10A2    = 0x000000000000000A,
		RTF_MAX        = 0x000000000000000B
	};

	/**
	 * Enum Engine.ETimecodeProviderSynchronizationState
	 */
	enum class ETimecodeProviderSynchronizationState : uint8_t
	{
		Closed        = 0x0000000000000000,
		Error         = 0x0000000000000001,
		Synchronized  = 0x0000000000000002,
		Synchronizing = 0x0000000000000003,
		MAX           = 0x0000000000000004
	};

	/**
	 * Enum Engine.ETimelineDirection
	 */
	enum class ETimelineDirection : uint8_t
	{
		Forward  = 0x0000000000000000,
		Backward = 0x0000000000000001,
		MAX      = 0x0000000000000002
	};

	/**
	 * Enum Engine.ETimelineLengthMode
	 */
	enum class ETimelineLengthMode : uint8_t
	{
		TL_TimelineLength = 0x0000000000000000,
		TL_LastKeyFrame   = 0x0000000000000001,
		TL_MAX            = 0x0000000000000002
	};

	/**
	 * Enum Engine.ETimeStretchCurveMapping
	 */
	enum class ETimeStretchCurveMapping : uint8_t
	{
		T_Original  = 0x0000000000000000,
		T_TargetMin = 0x0000000000000001,
		T_TargetMax = 0x0000000000000002,
		MAX         = 0x0000000000000003
	};

	/**
	 * Enum Engine.ETwitterIntegrationDelegate
	 */
	enum class ETwitterIntegrationDelegate : uint8_t
	{
		TID_AuthorizeComplete = 0x0000000000000000,
		TID_TweetUIComplete   = 0x0000000000000001,
		TID_RequestComplete   = 0x0000000000000002,
		TID_MAX               = 0x0000000000000003
	};

	/**
	 * Enum Engine.ETwitterRequestMethod
	 */
	enum class ETwitterRequestMethod : uint8_t
	{
		TRM_Get    = 0x0000000000000000,
		TRM_Post   = 0x0000000000000001,
		TRM_Delete = 0x0000000000000002,
		TRM_MAX    = 0x0000000000000003
	};

	/**
	 * Enum Engine.EUserDefinedStructureStatus
	 */
	enum class EUserDefinedStructureStatus : uint8_t
	{
		UDSS_UpToDate  = 0x0000000000000000,
		UDSS_Dirty     = 0x0000000000000001,
		UDSS_Error     = 0x0000000000000002,
		UDSS_Duplicate = 0x0000000000000003,
		UDSS_MAX       = 0x0000000000000004
	};

	/**
	 * Enum Engine.EUIScalingRule
	 */
	enum class EUIScalingRule : uint8_t
	{
		ShortestSide = 0x0000000000000000,
		LongestSide  = 0x0000000000000001,
		Horizontal   = 0x0000000000000002,
		Vertical     = 0x0000000000000003,
		ScaleToFit   = 0x0000000000000004,
		Custom       = 0x0000000000000005,
		MAX          = 0x0000000000000006
	};

	/**
	 * Enum Engine.ERenderFocusRule
	 */
	enum class ERenderFocusRule : uint8_t
	{
		Always         = 0x0000000000000000,
		NonPointer     = 0x0000000000000001,
		NavigationOnly = 0x0000000000000002,
		Never          = 0x0000000000000003,
		MAX            = 0x0000000000000004
	};

	/**
	 * Enum Engine.EVectorFieldConstructionOp
	 */
	enum class EVectorFieldConstructionOp : uint8_t
	{
		VFCO_Extrude = 0x0000000000000000,
		VFCO_Revolve = 0x0000000000000001,
		VFCO_MAX     = 0x0000000000000002
	};

	/**
	 * Enum Engine.EWindSourceType
	 */
	enum class EWindSourceType : uint8_t
	{
		Directional = 0x0000000000000000,
		Point       = 0x0000000000000001,
		MAX         = 0x0000000000000002
	};

	/**
	 * Enum Engine.EPSCPoolMethod
	 */
	enum class EPSCPoolMethod : uint8_t
	{
		None                     = 0x0000000000000000,
		AutoRelease              = 0x0000000000000001,
		ManualRelease            = 0x0000000000000002,
		ManualRelease_OnComplete = 0x0000000000000003,
		FreeInPool               = 0x0000000000000004,
		MAX                      = 0x0000000000000005
	};

	/**
	 * Enum Engine.EVolumeLightingMethod
	 */
	enum class EVolumeLightingMethod : uint8_t
	{
		VLM_VolumetricLightmap          = 0x0000000000000000,
		VLM_SparseVolumeLightingSamples = 0x0000000000000001,
		VLM_MAX                         = 0x0000000000000002
	};

	/**
	 * Enum Engine.EVisibilityAggressiveness
	 */
	enum class EVisibilityAggressiveness : uint8_t
	{
		VIS_LeastAggressive      = 0x0000000000000000,
		VIS_ModeratelyAggressive = 0x0000000000000001,
		VIS_MostAggressive       = 0x0000000000000002,
		VIS_Max                  = 0x0000000000000003
	};

	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * ScriptStruct Engine.TickFunction
	 * Size -> 0x0028
	 */
	struct FTickFunction
	{
	public:
		unsigned char                                              UnknownData_6KKR[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		ETickingGroup                                              TickGroup;                                               // 0x0008(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETickingGroup                                              EndTickGroup;                                            // 0x0009(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bTickEvenWhenPaused : 1;                                 // 0x000A(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bCanEverTick : 1;                                        // 0x000A(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bStartWithTickEnabled : 1;                               // 0x000A(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bAllowTickOnDedicatedServer : 1;                         // 0x000A(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_G3RF[0x1];                                   // 0x000B(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      TickInterval;                                            // 0x000C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GP1P[0x18];                                  // 0x0010(0x0018) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.ActorComponentTickFunction
	 * Size -> 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
	 */
	struct FActorComponentTickFunction : public FTickFunction
	{
	public:
		unsigned char                                              UnknownData_LT7M[0x8];                                   // 0x0028(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.SimpleMemberReference
	 * Size -> 0x0020
	 */
	struct FSimpleMemberReference
	{
	public:
		class UObject*                                             MemberParent;                                            // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                MemberName;                                              // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGuid                                               MemberGuid;                                              // 0x0010(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.LightingChannels
	 * Size -> 0x0001
	 */
	struct FLightingChannels
	{
	public:
		unsigned char                                              bChannel0 : 1;                                           // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bChannel1 : 1;                                           // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bChannel2 : 1;                                           // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.CustomPrimitiveData
	 * Size -> 0x0010
	 */
	struct FCustomPrimitiveData
	{
	public:
		TArray<float>                                              Data;                                                    // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.CollisionResponseContainer
	 * Size -> 0x0020
	 */
	struct FCollisionResponseContainer
	{
	public:
		ECollisionResponse                                         WorldStatic;                                             // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         WorldDynamic;                                            // 0x0001(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         Pawn;                                                    // 0x0002(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         Visibility;                                              // 0x0003(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         Camera;                                                  // 0x0004(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         PhysicsBody;                                             // 0x0005(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         Vehicle;                                                 // 0x0006(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         Destructible;                                            // 0x0007(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         EngineTraceChannel1;                                     // 0x0008(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         EngineTraceChannel2;                                     // 0x0009(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         EngineTraceChannel3;                                     // 0x000A(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         EngineTraceChannel4;                                     // 0x000B(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         EngineTraceChannel5;                                     // 0x000C(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         EngineTraceChannel6;                                     // 0x000D(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel1;                                       // 0x000E(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel2;                                       // 0x000F(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel3;                                       // 0x0010(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel4;                                       // 0x0011(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel5;                                       // 0x0012(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel6;                                       // 0x0013(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel7;                                       // 0x0014(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel8;                                       // 0x0015(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel9;                                       // 0x0016(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel10;                                      // 0x0017(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel11;                                      // 0x0018(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel12;                                      // 0x0019(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel13;                                      // 0x001A(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel14;                                      // 0x001B(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel15;                                      // 0x001C(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel16;                                      // 0x001D(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel17;                                      // 0x001E(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         GameTraceChannel18;                                      // 0x001F(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.ResponseChannel
	 * Size -> 0x000C
	 */
	struct FResponseChannel
	{
	public:
		class FName                                                Channel;                                                 // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionResponse                                         Response;                                                // 0x0008(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CY1L[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.CollisionResponse
	 * Size -> 0x0030
	 */
	struct FCollisionResponse
	{
	public:
		struct FCollisionResponseContainer                         ResponseToChannels;                                      // 0x0000(0x0020) Transient, NoDestructor, NativeAccessSpecifierPrivate
		TArray<struct FResponseChannel>                            ResponseArray;                                           // 0x0020(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct Engine.WalkableSlopeOverride
	 * Size -> 0x0010
	 */
	struct FWalkableSlopeOverride
	{
	public:
		EWalkableSlopeBehavior                                     WalkableSlopeBehavior;                                   // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_J5BE[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      WalkableSlopeAngle;                                      // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RJMF[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.BodyInstance
	 * Size -> 0x0140 (FullSize[0x0158] - InheritedSize[0x0018])
	 */
	struct FBodyInstance : public FBodyInstanceCore
	{
	public:
		unsigned char                                              UnknownData_LGNX[0x6];                                   // 0x0018(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		ECollisionChannel                                          ObjectType;                                              // 0x001E(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_FTPH[0x1];                                   // 0x001F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		ECollisionEnabled                                          CollisionEnabled;                                        // 0x0020(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_DJQB[0x38];                                  // 0x0021(0x0038) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		ESleepFamily                                               SleepFamily;                                             // 0x0059(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDOFMode                                                   DOFMode;                                                 // 0x005A(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bUseCCD : 1;                                             // 0x005B(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bIgnoreAnalyticCollisions : 1;                           // 0x005B(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bNotifyRigidBodyCollision : 1;                           // 0x005B(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_107N : 1;                                    // 0x005B(0x0001) BIT_FIELD (PADDING)
		unsigned char                                              bLockTranslation : 1;                                    // 0x005B(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bLockRotation : 1;                                       // 0x005B(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bLockXTranslation : 1;                                   // 0x005B(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bLockYTranslation : 1;                                   // 0x005B(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bLockZTranslation : 1;                                   // 0x005C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bLockXRotation : 1;                                      // 0x005C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bLockYRotation : 1;                                      // 0x005C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bLockZRotation : 1;                                      // 0x005C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverrideMaxAngularVelocity : 1;                         // 0x005C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PBV7 : 2;                                    // 0x005C(0x0001) BIT_FIELD (PADDING)
		unsigned char                                              bOverrideMaxDepenetrationVelocity : 1;                   // 0x005C(0x0001) BIT_FIELD Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bOverrideWalkableSlopeOnInstance : 1;                    // 0x005D(0x0001) BIT_FIELD Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bInterpolateWhenSubStepping : 1;                         // 0x005D(0x0001) BIT_FIELD NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_F7LE[0xE];                                   // 0x005E(0x000E) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                CollisionProfileName;                                    // 0x006C(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              PositionSolverIterationCount;                            // 0x0074(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              VelocitySolverIterationCount;                            // 0x0075(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_55W9[0x2];                                   // 0x0076(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FCollisionResponse                                  CollisionResponses;                                      // 0x0078(0x0030) Edit, NativeAccessSpecifierPrivate
		float                                                      MaxDepenetrationVelocity;                                // 0x00A8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      MassInKgOverride;                                        // 0x00AC(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_T8LO[0x8];                                   // 0x00B0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      LinearDamping;                                           // 0x00B8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AngularDamping;                                          // 0x00BC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             CustomDOFPlaneNormal;                                    // 0x00C0(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             COMNudge;                                                // 0x00CC(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MassScale;                                               // 0x00D8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             InertiaTensorScale;                                      // 0x00DC(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TD1G[0x10];                                  // 0x00E8(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FWalkableSlopeOverride                              WalkableSlopeOverride;                                   // 0x00F8(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected
		class UPhysicalMaterial*                                   PhysMaterialOverride;                                    // 0x0108(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      MaxAngularVelocity;                                      // 0x0110(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CustomSleepThresholdMultiplier;                          // 0x0114(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StabilizationThresholdMultiplier;                        // 0x0118(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PhysicsBlendWeight;                                      // 0x011C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AIN1[0x38];                                  // 0x0120(0x0038) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.ActorTickFunction
	 * Size -> 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
	 */
	struct FActorTickFunction : public FTickFunction
	{
	public:
		unsigned char                                              UnknownData_2J7N[0x8];                                   // 0x0028(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.RepMovement
	 * Size -> 0x0034
	 */
	struct FRepMovement
	{
	public:
		struct FVector                                             LinearVelocity;                                          // 0x0000(0x000C) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             AngularVelocity;                                         // 0x000C(0x000C) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             Location;                                                // 0x0018(0x000C) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            Rotation;                                                // 0x0024(0x000C) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              bSimulatedPhysicSleep : 1;                               // 0x0030(0x0001) BIT_FIELD Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bRepPhysics : 1;                                         // 0x0030(0x0001) BIT_FIELD Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EVectorQuantization                                        LocationQuantizationLevel;                               // 0x0031(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EVectorQuantization                                        VelocityQuantizationLevel;                               // 0x0032(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ERotatorQuantization                                       RotationQuantizationLevel;                               // 0x0033(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.Vector_NetQuantize100
	 * Size -> 0x0000 (FullSize[0x000C] - InheritedSize[0x000C])
	 */
	struct FVector_NetQuantize100 : public FVector
	{	};

	/**
	 * ScriptStruct Engine.RepAttachment
	 * Size -> 0x0040
	 */
	struct FRepAttachment
	{
	public:
		class AActor*                                              AttachParent;                                            // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector_NetQuantize100                              LocationOffset;                                          // 0x0008(0x000C) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector_NetQuantize100                              RelativeScale3D;                                         // 0x0014(0x000C) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            RotationOffset;                                          // 0x0020(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		class FName                                                AttachSocket;                                            // 0x002C(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1Z0K[0x4];                                   // 0x0034(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USceneComponent*                                     AttachComponent;                                         // 0x0038(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.BasedMovementInfo
	 * Size -> 0x0030
	 */
	struct FBasedMovementInfo
	{
	public:
		class UPrimitiveComponent*                                 MovementBase;                                            // 0x0000(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                BoneName;                                                // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector_NetQuantize100                              Location;                                                // 0x0010(0x000C) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            Rotation;                                                // 0x001C(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bServerHasBaseComponent;                                 // 0x0028(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRelativeRotation;                                       // 0x0029(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bServerHasVelocity;                                      // 0x002A(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GOLF[0x5];                                   // 0x002B(0x0005) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.RootMotionSourceSettings
	 * Size -> 0x0001
	 */
	struct FRootMotionSourceSettings
	{
	public:
		unsigned char                                              Flags;                                                   // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.Vector_NetQuantize10
	 * Size -> 0x0000 (FullSize[0x000C] - InheritedSize[0x000C])
	 */
	struct FVector_NetQuantize10 : public FVector
	{	};

	/**
	 * ScriptStruct Engine.RootMotionSourceGroup
	 * Size -> 0x0038
	 */
	struct FRootMotionSourceGroup
	{
	public:
		unsigned char                                              UnknownData_AX24[0x28];                                  // 0x0000(0x0028) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              bHasAdditiveSources : 1;                                 // 0x0028(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bHasOverrideSources : 1;                                 // 0x0028(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bHasOverrideSourcesWithIgnoreZAccumulate : 1;            // 0x0028(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bIsAdditiveVelocityApplied : 1;                          // 0x0028(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRootMotionSourceSettings                           LastAccumulatedSettings;                                 // 0x0029(0x0001) NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_94DA[0x2];                                   // 0x002A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector_NetQuantize10                               LastPreAdditiveVelocity;                                 // 0x002C(0x000C) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.RootMotionMovementParams
	 * Size -> 0x0040
	 */
	struct FRootMotionMovementParams
	{
	public:
		bool                                                       bHasRootMotion;                                          // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KCUI[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BlendWeight;                                             // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_G4X2[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTransform                                          RootMotionTransform;                                     // 0x0010(0x0030) IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.RepRootMotionMontage
	 * Size -> 0x0098
	 */
	struct FRepRootMotionMontage
	{
	public:
		bool                                                       bIsActive;                                               // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4FAE[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAnimMontage*                                        AnimMontage;                                             // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Position;                                                // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector_NetQuantize100                              Location;                                                // 0x0014(0x000C) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            Rotation;                                                // 0x0020(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OLI9[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UPrimitiveComponent*                                 MovementBase;                                            // 0x0030(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                MovementBaseBoneName;                                    // 0x0038(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRelativePosition;                                       // 0x0040(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRelativeRotation;                                       // 0x0041(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4SAA[0x6];                                   // 0x0042(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRootMotionSourceGroup                              AuthoritativeRootMotion;                                 // 0x0048(0x0038) NativeAccessSpecifierPublic
		struct FVector_NetQuantize10                               Acceleration;                                            // 0x0080(0x000C) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector_NetQuantize10                               LinearVelocity;                                          // 0x008C(0x000C) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.SimulatedRootMotionReplicatedMove
	 * Size -> 0x00A0
	 */
	struct FSimulatedRootMotionReplicatedMove
	{
	public:
		float                                                      Time;                                                    // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TBVR[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRepRootMotionMontage                               RootMotion;                                              // 0x0008(0x0098) ContainsInstancedReference, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.GeomSelection
	 * Size -> 0x000C
	 */
	struct FGeomSelection
	{
	public:
		int32_t                                                    Type;                                                    // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Index;                                                   // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    SelectionIndex;                                          // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.StaticMeshComponentLODInfo
	 * Size -> 0x0090
	 */
	struct FStaticMeshComponentLODInfo
	{
	public:
		unsigned char                                              UnknownData_U46N[0x90];                                  // 0x0000(0x0090) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.StreamingTextureBuildInfo
	 * Size -> 0x000C
	 */
	struct FStreamingTextureBuildInfo
	{
	public:
		uint32_t                                                   PackedRelativeBox;                                       // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    TextureLevelIndex;                                       // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TexelFactor;                                             // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.LightmassPrimitiveSettings
	 * Size -> 0x0018
	 */
	struct FLightmassPrimitiveSettings
	{
	public:
		unsigned char                                              bUseTwoSidedLighting : 1;                                // 0x0000(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bShadowIndirectOnly : 1;                                 // 0x0000(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bUseEmissiveForStaticLighting : 1;                       // 0x0000(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bUseVertexNormalForHemisphereGather : 1;                 // 0x0000(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_A7P8[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      EmissiveLightFalloffExponent;                            // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EmissiveLightExplicitInfluenceRadius;                    // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EmissiveBoost;                                           // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DiffuseBoost;                                            // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FullyOccludedSamplesFraction;                            // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.InstancedStaticMeshInstanceData
	 * Size -> 0x0040
	 */
	struct FInstancedStaticMeshInstanceData
	{
	public:
		struct FMatrix                                             Transform;                                               // 0x0000(0x0040) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.InstancedStaticMeshMappingInfo
	 * Size -> 0x0008
	 */
	struct FInstancedStaticMeshMappingInfo
	{
	public:
		unsigned char                                              UnknownData_S6RV[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.SoundConcurrencySettings
	 * Size -> 0x0028
	 */
	struct FSoundConcurrencySettings
	{
	public:
		int32_t                                                    MaxCount;                                                // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bLimitToOwner : 1;                                       // 0x0004(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3P50[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		EMaxConcurrentResolutionRule                               ResolutionRule;                                          // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FECX[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RetriggerTime;                                           // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      VolumeScale;                                             // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		EConcurrencyVolumeScaleMode                                VolumeScaleMode;                                         // 0x0014(0x0001) ELEMENT_SIZE_MISMATCH Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_01N0[0x3];                                   // 0x0014(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		float                                                      VolumeScaleAttackTime;                                   // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bVolumeScaleCanRelease : 1;                              // 0x001C(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2HWU[0x3];                                   // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      VolumeScaleReleaseTime;                                  // 0x0020(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      VoiceStealReleaseTime;                                   // 0x0024(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.SoundModulationDestinationSettings
	 * Size -> 0x0010
	 */
	struct FSoundModulationDestinationSettings
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JN3S[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USoundModulatorBase*                                 Modulator;                                               // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.SoundModulationDefaultSettings
	 * Size -> 0x0040
	 */
	struct FSoundModulationDefaultSettings
	{
	public:
		struct FSoundModulationDestinationSettings                 VolumeModulationDestination;                             // 0x0000(0x0010) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FSoundModulationDestinationSettings                 PitchModulationDestination;                              // 0x0010(0x0010) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FSoundModulationDestinationSettings                 HighpassModulationDestination;                           // 0x0020(0x0010) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FSoundModulationDestinationSettings                 LowpassModulationDestination;                            // 0x0030(0x0010) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.SoundModulationDefaultRoutingSettings
	 * Size -> 0x0008 (FullSize[0x0048] - InheritedSize[0x0040])
	 */
	struct FSoundModulationDefaultRoutingSettings : public FSoundModulationDefaultSettings
	{
	public:
		EModulationRouting                                         VolumeRouting;                                           // 0x0040(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EModulationRouting                                         PitchRouting;                                            // 0x0041(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EModulationRouting                                         HighpassRouting;                                         // 0x0042(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EModulationRouting                                         LowpassRouting;                                          // 0x0043(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MDIW[0x4];                                   // 0x0044(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.KeyHandleMap
	 * Size -> 0x0060
	 */
	struct FKeyHandleMap
	{
	public:
		unsigned char                                              UnknownData_0Q29[0x60];                                  // 0x0000(0x0060) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.IndexedCurve
	 * Size -> 0x0068
	 */
	struct FIndexedCurve
	{
	public:
		unsigned char                                              UnknownData_36KO[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FKeyHandleMap                                       KeyHandlesToIndices;                                     // 0x0008(0x0060) Transient, Protected, NativeAccessSpecifierProtected
	};

	/**
	 * ScriptStruct Engine.RealCurve
	 * Size -> 0x0008 (FullSize[0x0070] - InheritedSize[0x0068])
	 */
	struct FRealCurve : public FIndexedCurve
	{
	public:
		float                                                      DefaultValue;                                            // 0x0068(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ERichCurveExtrapolation                                    PreInfinityExtrap;                                       // 0x006C(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ERichCurveExtrapolation                                    PostInfinityExtrap;                                      // 0x006D(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KWIT[0x2];                                   // 0x006E(0x0002) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.RichCurveKey
	 * Size -> 0x001C
	 */
	struct FRichCurveKey
	{
	public:
		ERichCurveInterpMode                                       InterpMode;                                              // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ERichCurveTangentMode                                      TangentMode;                                             // 0x0001(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ERichCurveTangentWeightMode                                TangentWeightMode;                                       // 0x0002(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JMN9[0x1];                                   // 0x0003(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Time;                                                    // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Value;                                                   // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ArriveTangent;                                           // 0x000C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ArriveTangentWeight;                                     // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LeaveTangent;                                            // 0x0014(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LeaveTangentWeight;                                      // 0x0018(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.RichCurve
	 * Size -> 0x0010 (FullSize[0x0080] - InheritedSize[0x0070])
	 */
	struct FRichCurve : public FRealCurve
	{
	public:
		TArray<struct FRichCurveKey>                               Keys;                                                    // 0x0070(0x0010) Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.RuntimeFloatCurve
	 * Size -> 0x0088
	 */
	struct FRuntimeFloatCurve
	{
	public:
		struct FRichCurve                                          EditorCurveData;                                         // 0x0000(0x0080) NativeAccessSpecifierPublic
		class UCurveFloat*                                         ExternalCurve;                                           // 0x0080(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.SoundSubmixSendInfo
	 * Size -> 0x00B0
	 */
	struct FSoundSubmixSendInfo
	{
	public:
		ESendLevelControlMethod                                    SendLevelControlMethod;                                  // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESubmixSendStage                                           SendStage;                                               // 0x0001(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CR8J[0x6];                                   // 0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USoundSubmixBase*                                    SoundSubmix;                                             // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SendLevel;                                               // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinSendLevel;                                            // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxSendLevel;                                            // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinSendDistance;                                         // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxSendDistance;                                         // 0x0020(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1OUS[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRuntimeFloatCurve                                  CustomSendLevelCurve;                                    // 0x0028(0x0088) Edit, BlueprintVisible, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.SoundSourceBusSendInfo
	 * Size -> 0x00B8
	 */
	struct FSoundSourceBusSendInfo
	{
	public:
		ESourceBusSendLevelControlMethod                           SourceBusSendLevelControlMethod;                         // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_T19S[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USoundSourceBus*                                     SoundSourceBus;                                          // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAudioBus*                                           AudioBus;                                                // 0x0010(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SendLevel;                                               // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinSendLevel;                                            // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxSendLevel;                                            // 0x0020(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinSendDistance;                                         // 0x0024(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxSendDistance;                                         // 0x0028(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KZ9M[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRuntimeFloatCurve                                  CustomSendLevelCurve;                                    // 0x0030(0x0088) Edit, BlueprintVisible, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.SoundWaveSpectralDataEntry
	 * Size -> 0x0008
	 */
	struct FSoundWaveSpectralDataEntry
	{
	public:
		float                                                      Magnitude;                                               // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      NormalizedMagnitude;                                     // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.SoundWaveSpectralTimeData
	 * Size -> 0x0018
	 */
	struct FSoundWaveSpectralTimeData
	{
	public:
		TArray<struct FSoundWaveSpectralDataEntry>                 Data;                                                    // 0x0000(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		float                                                      TimeSec;                                                 // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TZM0[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.SoundWaveEnvelopeTimeData
	 * Size -> 0x0008
	 */
	struct FSoundWaveEnvelopeTimeData
	{
	public:
		float                                                      Amplitude;                                               // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TimeSec;                                                 // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.SubtitleCue
	 * Size -> 0x0020
	 */
	struct FSubtitleCue
	{
	public:
		class FText                                                Text;                                                    // 0x0000(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		float                                                      Time;                                                    // 0x0018(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_G7UO[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.UniqueNetIdRepl
	 * Size -> 0x0027 (FullSize[0x0028] - InheritedSize[0x0001])
	 */
	struct FUniqueNetIdRepl : public FUniqueNetIdWrapper
	{
	public:
		unsigned char                                              UnknownData_S2Y6[0x17];                                  // 0x0001(0x0017) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<unsigned char>                                      ReplicationBytes;                                        // 0x0018(0x0010) ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected
	};

	/**
	 * ScriptStruct Engine.ChannelDefinition
	 * Size -> 0x0028
	 */
	struct FChannelDefinition
	{
	public:
		class FName                                                ChannelName;                                             // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                ClassName;                                               // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              ChannelClass;                                            // 0x0010(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    StaticChannelIndex;                                      // 0x0018(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bTickOnCreate;                                           // 0x001C(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bServerOpen;                                             // 0x001D(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bClientOpen;                                             // 0x001E(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bInitialServer;                                          // 0x001F(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bInitialClient;                                          // 0x0020(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RLUR[0x7];                                   // 0x0021(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.PerPlatformFloat
	 * Size -> 0x0004
	 */
	struct FPerPlatformFloat
	{
	public:
		float                                                      Default;                                                 // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.ExpressionInput
	 * Size -> 0x000C
	 */
	struct FExpressionInput
	{
	public:
		int32_t                                                    OutputIndex;                                             // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                ExpressionName;                                          // 0x0004(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.SplineCurves
	 * Size -> 0x0070
	 */
	struct FSplineCurves
	{
	public:
		struct FInterpCurveVector                                  Position;                                                // 0x0000(0x0018) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FInterpCurveQuat                                    Rotation;                                                // 0x0018(0x0018) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FInterpCurveVector                                  Scale;                                                   // 0x0030(0x0018) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FInterpCurveFloat                                   ReparamTable;                                            // 0x0048(0x0018) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USplineMetadata*                                     MetaData;                                                // 0x0060(0x0008) ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		uint32_t                                                   Version;                                                 // 0x0068(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IO2Y[0x4];                                   // 0x006C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.VertexOffsetUsage
	 * Size -> 0x0004
	 */
	struct FVertexOffsetUsage
	{
	public:
		int32_t                                                    Usage;                                                   // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.SkelMeshComponentLODInfo
	 * Size -> 0x0048
	 */
	struct FSkelMeshComponentLODInfo
	{
	public:
		TArray<bool>                                               HiddenMaterials;                                         // 0x0000(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3RPL[0x38];                                  // 0x0010(0x0038) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.SingleAnimationPlayData
	 * Size -> 0x0018
	 */
	struct FSingleAnimationPlayData
	{
	public:
		class UAnimationAsset*                                     AnimToPlay;                                              // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bSavedLooping : 1;                                       // 0x0008(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bSavedPlaying : 1;                                       // 0x0008(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SADG[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SavedPosition;                                           // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SavedPlayRate;                                           // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TCX1[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.AnimNotifyEventReference
	 * Size -> 0x0010
	 */
	struct FAnimNotifyEventReference
	{
	public:
		unsigned char                                              UnknownData_DRAN[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UObject*                                             NotifySource;                                            // 0x0008(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct Engine.AnimNotifyArray
	 * Size -> 0x0010
	 */
	struct FAnimNotifyArray
	{
	public:
		TArray<struct FAnimNotifyEventReference>                   Notifies;                                                // 0x0000(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.AnimNotifyQueue
	 * Size -> 0x0070
	 */
	struct FAnimNotifyQueue
	{
	public:
		unsigned char                                              UnknownData_PFXR[0x10];                                  // 0x0000(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FAnimNotifyEventReference>                   AnimNotifies;                                            // 0x0010(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPublic
		TMap<class FName, struct FAnimNotifyArray>                 UnfilteredMontageAnimNotifies;                           // 0x0020(0x0050) Transient, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.AnimLinkableElement
	 * Size -> 0x0030
	 */
	struct FAnimLinkableElement
	{
	public:
		unsigned char                                              UnknownData_3J51[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAnimMontage*                                        LinkedMontage;                                           // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    SlotIndex;                                               // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    SegmentIndex;                                            // 0x0014(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EAnimLinkMethod                                            LinkMethod;                                              // 0x0018(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EAnimLinkMethod                                            CachedLinkMethod;                                        // 0x0019(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_7P7K[0x2];                                   // 0x001A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SegmentBeginTime;                                        // 0x001C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      SegmentLength;                                           // 0x0020(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      LinkValue;                                               // 0x0024(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UAnimSequenceBase*                                   LinkedSequence;                                          // 0x0028(0x0008) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
	};

	/**
	 * ScriptStruct Engine.AnimNotifyEvent
	 * Size -> 0x0088 (FullSize[0x00B8] - InheritedSize[0x0030])
	 */
	struct FAnimNotifyEvent : public FAnimLinkableElement
	{
	public:
		float                                                      DisplayTime;                                             // 0x0030(0x0004) ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TriggerTimeOffset;                                       // 0x0034(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EndTriggerTimeOffset;                                    // 0x0038(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TriggerWeightThreshold;                                  // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                NotifyName;                                              // 0x0040(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimNotify*                                         Notify;                                                  // 0x0048(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimNotifyState*                                    NotifyStateClass;                                        // 0x0050(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Duration;                                                // 0x0058(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MCF0[0x4];                                   // 0x005C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAnimLinkableElement                                EndLink;                                                 // 0x0060(0x0030) NativeAccessSpecifierPublic
		bool                                                       bConvertedFromBranchingPoint;                            // 0x0090(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EMontageNotifyTickType                                     MontageTickType;                                         // 0x0091(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PL4P[0x2];                                   // 0x0092(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      NotifyTriggerChance;                                     // 0x0094(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ENotifyFilterType                                          NotifyFilterType;                                        // 0x0098(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1CTS[0x3];                                   // 0x0099(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    NotifyFilterLOD;                                         // 0x009C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bTriggerOnDedicatedServer;                               // 0x00A0(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bTriggerOnFollower;                                      // 0x00A1(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_135Z[0x2];                                   // 0x00A2(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    TrackIndex;                                              // 0x00A4(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9DET[0x10];                                  // 0x00A8(0x0010) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.AudioComponentParam
	 * Size -> 0x0020
	 */
	struct FAudioComponentParam
	{
	public:
		class FName                                                ParamName;                                               // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FloatParam;                                              // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       BoolParam;                                               // 0x000C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IRPQ[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    IntParam;                                                // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TLSA[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USoundWave*                                          SoundWaveParam;                                          // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.BaseAttenuationSettings
	 * Size -> 0x00B0
	 */
	struct FBaseAttenuationSettings
	{
	public:
		unsigned char                                              UnknownData_7ZIZ[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		EAttenuationDistanceModel                                  DistanceAlgorithm;                                       // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAttenuationShape                                          AttenuationShape;                                        // 0x0009(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZJ0B[0x2];                                   // 0x000A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      dBAttenuationAtMax;                                      // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ENaturalSoundFalloffMode                                   FalloffMode;                                             // 0x0010(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_I2QK[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             AttenuationShapeExtents;                                 // 0x0014(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ConeOffset;                                              // 0x0020(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FalloffDistance;                                         // 0x0024(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRuntimeFloatCurve                                  CustomAttenuationCurve;                                  // 0x0028(0x0088) Edit, BlueprintVisible, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.AttenuationSubmixSendSettings
	 * Size -> 0x00A8
	 */
	struct FAttenuationSubmixSendSettings
	{
	public:
		class USoundSubmixBase*                                    Submix;                                                  // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESubmixSendMethod                                          SubmixSendMethod;                                        // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_42UY[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SubmixSendLevelMin;                                      // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SubmixSendLevelMax;                                      // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SubmixSendDistanceMin;                                   // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SubmixSendDistanceMax;                                   // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ManualSubmixSendLevel;                                   // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRuntimeFloatCurve                                  CustomSubmixSendCurve;                                   // 0x0020(0x0088) Edit, BlueprintVisible, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.SoundAttenuationPluginSettings
	 * Size -> 0x0030
	 */
	struct FSoundAttenuationPluginSettings
	{
	public:
		TArray<class USpatializationPluginSourceSettingsBase*>     SpatializationPluginSettingsArray;                       // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class UOcclusionPluginSourceSettingsBase*>          OcclusionPluginSettingsArray;                            // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class UReverbPluginSourceSettingsBase*>             ReverbPluginSettingsArray;                               // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.SoundAttenuationSettings
	 * Size -> 0x02F0 (FullSize[0x03A0] - InheritedSize[0x00B0])
	 */
	struct FSoundAttenuationSettings : public FBaseAttenuationSettings
	{
	public:
		unsigned char                                              bAttenuate : 1;                                          // 0x00B0(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bSpatialize : 1;                                         // 0x00B0(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bAttenuateWithLPF : 1;                                   // 0x00B0(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bEnableListenerFocus : 1;                                // 0x00B0(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bEnableFocusInterpolation : 1;                           // 0x00B0(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bEnableOcclusion : 1;                                    // 0x00B0(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bUseComplexCollisionForOcclusion : 1;                    // 0x00B0(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bEnableReverbSend : 1;                                   // 0x00B0(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bEnablePriorityAttenuation : 1;                          // 0x00B1(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bApplyNormalizationToStereoSounds : 1;                   // 0x00B1(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bEnableLogFrequencyScaling : 1;                          // 0x00B1(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bEnableSubmixSends : 1;                                  // 0x00B1(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESoundSpatializationAlgorithm                              SpatializationAlgorithm;                                 // 0x00B2(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_G783[0x1];                                   // 0x00B3(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BinauralRadius;                                          // 0x00B4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAirAbsorptionMethod                                       AbsorptionMethod;                                        // 0x00B8(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionChannel                                          OcclusionTraceChannel;                                   // 0x00B9(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EReverbSendMethod                                          ReverbSendMethod;                                        // 0x00BA(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EPriorityAttenuationMethod                                 PriorityAttenuationMethod;                               // 0x00BB(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      OmniRadius;                                              // 0x00BC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StereoSpread;                                            // 0x00C0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LPFRadiusMin;                                            // 0x00C4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LPFRadiusMax;                                            // 0x00C8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1XH1[0x4];                                   // 0x00CC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRuntimeFloatCurve                                  CustomLowpassAirAbsorptionCurve;                         // 0x00D0(0x0088) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		struct FRuntimeFloatCurve                                  CustomHighpassAirAbsorptionCurve;                        // 0x0158(0x0088) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		float                                                      LPFFrequencyAtMin;                                       // 0x01E0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LPFFrequencyAtMax;                                       // 0x01E4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      HPFFrequencyAtMin;                                       // 0x01E8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      HPFFrequencyAtMax;                                       // 0x01EC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FocusAzimuth;                                            // 0x01F0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      NonFocusAzimuth;                                         // 0x01F4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FocusDistanceScale;                                      // 0x01F8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      NonFocusDistanceScale;                                   // 0x01FC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FocusPriorityScale;                                      // 0x0200(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      NonFocusPriorityScale;                                   // 0x0204(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FocusVolumeAttenuation;                                  // 0x0208(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      NonFocusVolumeAttenuation;                               // 0x020C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FocusAttackInterpSpeed;                                  // 0x0210(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FocusReleaseInterpSpeed;                                 // 0x0214(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      OcclusionLowPassFilterFrequency;                         // 0x0218(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      OcclusionVolumeAttenuation;                              // 0x021C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      OcclusionInterpolationTime;                              // 0x0220(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ReverbWetLevelMin;                                       // 0x0224(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ReverbWetLevelMax;                                       // 0x0228(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ReverbDistanceMin;                                       // 0x022C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ReverbDistanceMax;                                       // 0x0230(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ManualReverbSendLevel;                                   // 0x0234(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRuntimeFloatCurve                                  CustomReverbSendCurve;                                   // 0x0238(0x0088) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		TArray<struct FAttenuationSubmixSendSettings>              SubmixSendSettings;                                      // 0x02C0(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		float                                                      PriorityAttenuationMin;                                  // 0x02D0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PriorityAttenuationMax;                                  // 0x02D4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PriorityAttenuationDistanceMin;                          // 0x02D8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PriorityAttenuationDistanceMax;                          // 0x02DC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ManualPriorityAttenuation;                               // 0x02E0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RJRP[0x4];                                   // 0x02E4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRuntimeFloatCurve                                  CustomPriorityAttenuationCurve;                          // 0x02E8(0x0088) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		struct FSoundAttenuationPluginSettings                     PluginSettings;                                          // 0x0370(0x0030) Edit, BlueprintVisible, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.ActiveForceFeedbackEffect
	 * Size -> 0x0018
	 */
	struct FActiveForceFeedbackEffect
	{
	public:
		class UForceFeedbackEffect*                                ForceFeedbackEffect;                                     // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7IK2[0x10];                                  // 0x0008(0x0010) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.MovementProperties
	 * Size -> 0x0001
	 */
	struct FMovementProperties
	{
	public:
		unsigned char                                              bCanCrouch : 1;                                          // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bCanJump : 1;                                            // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bCanWalk : 1;                                            // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bCanSwim : 1;                                            // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bCanFly : 1;                                             // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.NavAgentProperties
	 * Size -> 0x002F (FullSize[0x0030] - InheritedSize[0x0001])
	 */
	struct FNavAgentProperties : public FMovementProperties
	{
	public:
		unsigned char                                              UnknownData_TD2Z[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      AgentRadius;                                             // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AgentHeight;                                             // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AgentStepHeight;                                         // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      NavWalkingSearchHeightScale;                             // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NGZ9[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSoftClassPath                                      PreferredNavData;                                        // 0x0018(0x0018) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.Vector_NetQuantize
	 * Size -> 0x0000 (FullSize[0x000C] - InheritedSize[0x000C])
	 */
	struct FVector_NetQuantize : public FVector
	{	};

	/**
	 * ScriptStruct Engine.Vector_NetQuantizeNormal
	 * Size -> 0x0000 (FullSize[0x000C] - InheritedSize[0x000C])
	 */
	struct FVector_NetQuantizeNormal : public FVector
	{	};

	/**
	 * ScriptStruct Engine.HitResult
	 * Size -> 0x008C
	 */
	struct FHitResult
	{
	public:
		unsigned char                                              bBlockingHit : 1;                                        // 0x0000(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bStartPenetrating : 1;                                   // 0x0000(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WQTC[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    FaceIndex;                                               // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Time;                                                    // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Distance;                                                // 0x000C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector_NetQuantize                                 Location;                                                // 0x0010(0x000C) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector_NetQuantize                                 ImpactPoint;                                             // 0x001C(0x000C) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector_NetQuantizeNormal                           Normal;                                                  // 0x0028(0x000C) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector_NetQuantizeNormal                           ImpactNormal;                                            // 0x0034(0x000C) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector_NetQuantize                                 TraceStart;                                              // 0x0040(0x000C) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector_NetQuantize                                 TraceEnd;                                                // 0x004C(0x000C) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PenetrationDepth;                                        // 0x0058(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Item;                                                    // 0x005C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              ElementIndex;                                            // 0x0060(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SI5F[0x3];                                   // 0x0061(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TWeakObjectPtr<class UPhysicalMaterial>                    PhysMaterial;                                            // 0x0064(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TWeakObjectPtr<class AActor>                               Actor;                                                   // 0x006C(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TWeakObjectPtr<class UPrimitiveComponent>                  Component;                                               // 0x0074(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                BoneName;                                                // 0x007C(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                MyBoneName;                                              // 0x0084(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.FindFloorResult
	 * Size -> 0x0098
	 */
	struct FFindFloorResult
	{
	public:
		unsigned char                                              bBlockingHit : 1;                                        // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bWalkableFloor : 1;                                      // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bLineTrace : 1;                                          // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KW92[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      FloorDist;                                               // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LineDist;                                                // 0x0008(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FHitResult                                          HitResult;                                               // 0x000C(0x008C) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.NavAvoidanceMask
	 * Size -> 0x0004
	 */
	struct FNavAvoidanceMask
	{
	public:
		unsigned char                                              bGroup0 : 1;                                             // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup1 : 1;                                             // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup2 : 1;                                             // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup3 : 1;                                             // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup4 : 1;                                             // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup5 : 1;                                             // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup6 : 1;                                             // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup7 : 1;                                             // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup8 : 1;                                             // 0x0001(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup9 : 1;                                             // 0x0001(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup10 : 1;                                            // 0x0001(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup11 : 1;                                            // 0x0001(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup12 : 1;                                            // 0x0001(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup13 : 1;                                            // 0x0001(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup14 : 1;                                            // 0x0001(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup15 : 1;                                            // 0x0001(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup16 : 1;                                            // 0x0002(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup17 : 1;                                            // 0x0002(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup18 : 1;                                            // 0x0002(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup19 : 1;                                            // 0x0002(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup20 : 1;                                            // 0x0002(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup21 : 1;                                            // 0x0002(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup22 : 1;                                            // 0x0002(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup23 : 1;                                            // 0x0002(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup24 : 1;                                            // 0x0003(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup25 : 1;                                            // 0x0003(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup26 : 1;                                            // 0x0003(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup27 : 1;                                            // 0x0003(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup28 : 1;                                            // 0x0003(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup29 : 1;                                            // 0x0003(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup30 : 1;                                            // 0x0003(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGroup31 : 1;                                            // 0x0003(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.CharacterMovementComponentPostPhysicsTickFunction
	 * Size -> 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
	 */
	struct FCharacterMovementComponentPostPhysicsTickFunction : public FTickFunction
	{
	public:
		unsigned char                                              UnknownData_GEXX[0x8];                                   // 0x0028(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.StatColorMapEntry
	 * Size -> 0x0008
	 */
	struct FStatColorMapEntry
	{
	public:
		float                                                      In;                                                      // 0x0000(0x0004) ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FColor                                              Out;                                                     // 0x0004(0x0004) ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.StatColorMapping
	 * Size -> 0x0028
	 */
	struct FStatColorMapping
	{
	public:
		class FString                                              StatName;                                                // 0x0000(0x0010) ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FStatColorMapEntry>                          ColorMap;                                                // 0x0010(0x0010) ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic
		unsigned char                                              DisableBlend : 1;                                        // 0x0020(0x0001) BIT_FIELD Config, GlobalConfig, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BYIJ[0x7];                                   // 0x0021(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.GameNameRedirect
	 * Size -> 0x0010
	 */
	struct FGameNameRedirect
	{
	public:
		class FName                                                OldGameName;                                             // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                NewGameName;                                             // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.ClassRedirect
	 * Size -> 0x003C
	 */
	struct FClassRedirect
	{
	public:
		class FName                                                ObjectName;                                              // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                OldClassName;                                            // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                NewClassName;                                            // 0x0010(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                OldSubobjName;                                           // 0x0018(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                NewSubobjName;                                           // 0x0020(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                NewClassClass;                                           // 0x0028(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                NewClassPackage;                                         // 0x0030(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       InstanceOnly;                                            // 0x0038(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_A74I[0x3];                                   // 0x0039(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.PluginRedirect
	 * Size -> 0x0020
	 */
	struct FPluginRedirect
	{
	public:
		class FString                                              OldPluginName;                                           // 0x0000(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              NewPluginName;                                           // 0x0010(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.StructRedirect
	 * Size -> 0x0010
	 */
	struct FStructRedirect
	{
	public:
		class FName                                                OldStructName;                                           // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                NewStructName;                                           // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.DirectoryPath
	 * Size -> 0x0010
	 */
	struct FDirectoryPath
	{
	public:
		class FString                                              Path;                                                    // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.DropNoteInfo
	 * Size -> 0x0028
	 */
	struct FDropNoteInfo
	{
	public:
		struct FVector                                             Location;                                                // 0x0000(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            Rotation;                                                // 0x000C(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		class FString                                              Comment;                                                 // 0x0018(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.NetDriverDefinition
	 * Size -> 0x0018
	 */
	struct FNetDriverDefinition
	{
	public:
		class FName                                                DefName;                                                 // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                DriverClassName;                                         // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                DriverClassNameFallback;                                 // 0x0010(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.LightmassMaterialInterfaceSettings
	 * Size -> 0x0010
	 */
	struct FLightmassMaterialInterfaceSettings
	{
	public:
		float                                                      EmissiveBoost;                                           // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DiffuseBoost;                                            // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ExportResolutionScale;                                   // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bCastShadowAsMasked : 1;                                 // 0x000C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverrideCastShadowAsMasked : 1;                         // 0x000C(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverrideEmissiveBoost : 1;                              // 0x000C(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverrideDiffuseBoost : 1;                               // 0x000C(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverrideExportResolutionScale : 1;                      // 0x000C(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BG3F[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.MaterialTextureInfo
	 * Size -> 0x0010
	 */
	struct FMaterialTextureInfo
	{
	public:
		float                                                      SamplingScale;                                           // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    UVChannelIndex;                                          // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                TextureName;                                             // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.MaterialParameterInfo
	 * Size -> 0x0010
	 */
	struct FMaterialParameterInfo
	{
	public:
		class FName                                                Name;                                                    // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EMaterialParameterAssociation                              Association;                                             // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CQUC[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    Index;                                                   // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.ScalarParameterValue
	 * Size -> 0x0024
	 */
	struct FScalarParameterValue
	{
	public:
		struct FMaterialParameterInfo                              ParameterInfo;                                           // 0x0000(0x0010) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ParameterValue;                                          // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGuid                                               ExpressionGUID;                                          // 0x0014(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.VectorParameterValue
	 * Size -> 0x0030
	 */
	struct FVectorParameterValue
	{
	public:
		struct FMaterialParameterInfo                              ParameterInfo;                                           // 0x0000(0x0010) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        ParameterValue;                                          // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGuid                                               ExpressionGUID;                                          // 0x0020(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.TextureParameterValue
	 * Size -> 0x0028
	 */
	struct FTextureParameterValue
	{
	public:
		struct FMaterialParameterInfo                              ParameterInfo;                                           // 0x0000(0x0010) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTexture*                                            ParameterValue;                                          // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGuid                                               ExpressionGUID;                                          // 0x0018(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.RuntimeVirtualTextureParameterValue
	 * Size -> 0x0028
	 */
	struct FRuntimeVirtualTextureParameterValue
	{
	public:
		struct FMaterialParameterInfo                              ParameterInfo;                                           // 0x0000(0x0010) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class URuntimeVirtualTexture*                              ParameterValue;                                          // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGuid                                               ExpressionGUID;                                          // 0x0018(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.FontParameterValue
	 * Size -> 0x0030
	 */
	struct FFontParameterValue
	{
	public:
		struct FMaterialParameterInfo                              ParameterInfo;                                           // 0x0000(0x0010) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UFont*                                               FontValue;                                               // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    FontPage;                                                // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGuid                                               ExpressionGUID;                                          // 0x001C(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2TST[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.MaterialInstanceBasePropertyOverrides
	 * Size -> 0x0008
	 */
	struct FMaterialInstanceBasePropertyOverrides
	{
	public:
		unsigned char                                              bOverride_OpacityMaskClipValue : 1;                      // 0x0000(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_BlendMode : 1;                                 // 0x0000(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_ShadingModel : 1;                              // 0x0000(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_DitheredLODTransition : 1;                     // 0x0000(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_CastDynamicShadowAsMasked : 1;                 // 0x0000(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOverride_TwoSided : 1;                                  // 0x0000(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              TwoSided : 1;                                            // 0x0000(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              DitheredLODTransition : 1;                               // 0x0000(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bCastDynamicShadowAsMasked : 1;                          // 0x0001(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EBlendMode                                                 BlendMode;                                               // 0x0002(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EMaterialShadingModel                                      ShadingModel;                                            // 0x0003(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      OpacityMaskClipValue;                                    // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.StaticParameterBase
	 * Size -> 0x0024
	 */
	struct FStaticParameterBase
	{
	public:
		struct FMaterialParameterInfo                              ParameterInfo;                                           // 0x0000(0x0010) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bOverride;                                               // 0x0010(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_N6MI[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FGuid                                               ExpressionGUID;                                          // 0x0014(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.StaticSwitchParameter
	 * Size -> 0x0004 (FullSize[0x0028] - InheritedSize[0x0024])
	 */
	struct FStaticSwitchParameter : public FStaticParameterBase
	{
	public:
		bool                                                       Value;                                                   // 0x0024(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LXHD[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.StaticComponentMaskParameter
	 * Size -> 0x0004 (FullSize[0x0028] - InheritedSize[0x0024])
	 */
	struct FStaticComponentMaskParameter : public FStaticParameterBase
	{
	public:
		bool                                                       R;                                                       // 0x0024(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       G;                                                       // 0x0025(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       B;                                                       // 0x0026(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       A;                                                       // 0x0027(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.StaticTerrainLayerWeightParameter
	 * Size -> 0x0008 (FullSize[0x002C] - InheritedSize[0x0024])
	 */
	struct FStaticTerrainLayerWeightParameter : public FStaticParameterBase
	{
	public:
		int32_t                                                    WeightmapIndex;                                          // 0x0024(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bWeightBasedBlend;                                       // 0x0028(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_N1SP[0x3];                                   // 0x0029(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Engine.MaterialLayersFunctions
	 * Size -> 0x0040
	 */
	struct FMaterialLayersFunctions
	{
	public:
		TArray<class UMaterialFunctionInterface*>                  Layers;                                                  // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class UMaterialFunctionInterface*>                  Blends;                                                  // 0x0010(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<bool>                                               LayerStates;                                             // 0x0020(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		class FString                                              KeyString;                                               // 0x0030(0x0010) ZeroConstructor, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.StaticMaterialLayersParameter
	 * Size -> 0x0044 (FullSize[0x0068] - InheritedSize[0x0024])
	 */
	struct FStaticMaterialLayersParameter : public FStaticParameterBase
	{
	public:
		unsigned char                                              UnknownData_35XR[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FMaterialLayersFunctions                            Value;                                                   // 0x0028(0x0040) NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.StaticParameterSet
	 * Size -> 0x0040
	 */
	struct FStaticParameterSet
	{
	public:
		TArray<struct FStaticSwitchParameter>                      StaticSwitchParameters;                                  // 0x0000(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FStaticComponentMaskParameter>               StaticComponentMaskParameters;                           // 0x0010(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FStaticTerrainLayerWeightParameter>          TerrainLayerWeightParameters;                            // 0x0020(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FStaticMaterialLayersParameter>              MaterialLayersParameters;                                // 0x0030(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.MaterialCachedParameterEntry
	 * Size -> 0x0040
	 */
	struct FMaterialCachedParameterEntry
	{
	public:
		TArray<uint64_t>                                           NameHashes;                                              // 0x0000(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FMaterialParameterInfo>                      ParameterInfos;                                          // 0x0010(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FGuid>                                       ExpressionGuids;                                         // 0x0020(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<bool>                                               Overrides;                                               // 0x0030(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct Engine.MaterialCachedParameters
	 * Size -> 0x01A0
	 */
	struct FMaterialCachedParameters
	{
	public:
		struct FMaterialCachedParameterEntry                       RuntimeEntries[0x5];                                     // 0x0000(0x0140) NativeAccessSpecifierPublic
		TArray<float>                                              ScalarValues;                                            // 0x0140(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FLinearColor>                                VectorValues;                                            // 0x0150(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class UTexture*>                                    TextureValues;                                           // 0x0160(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class UFont*>                                       FontValues;                                              // 0x0170(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
