#pragma once

/**
 * Name: Hydroneer
 * Version: 2.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.InpActEvt_Crouch_K2Node_InputActionEvent_4
	 */
	struct ABP_ScreenshotCam_C_InpActEvt_Crouch_K2Node_InputActionEvent_4_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.InpActEvt_Crouch_K2Node_InputActionEvent_3
	 */
	struct ABP_ScreenshotCam_C_InpActEvt_Crouch_K2Node_InputActionEvent_3_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.InpActEvt_Jump_K2Node_InputActionEvent_2
	 */
	struct ABP_ScreenshotCam_C_InpActEvt_Jump_K2Node_InputActionEvent_2_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.InpActEvt_Jump_K2Node_InputActionEvent_1
	 */
	struct ABP_ScreenshotCam_C_InpActEvt_Jump_K2Node_InputActionEvent_1_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.ToggleCinematicBars
	 */
	struct ABP_ScreenshotCam_C_ToggleCinematicBars_Params
	{
	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.DownTime
	 */
	struct ABP_ScreenshotCam_C_DownTime_Params
	{
	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.UpTime
	 */
	struct ABP_ScreenshotCam_C_UpTime_Params
	{
	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.ChangeTime
	 */
	struct ABP_ScreenshotCam_C_ChangeTime_Params
	{
	public:
		float                                                      Amount;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.ReceiveBeginPlay
	 */
	struct ABP_ScreenshotCam_C_ReceiveBeginPlay_Params
	{
	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.ChangeFilter
	 */
	struct ABP_ScreenshotCam_C_ChangeFilter_Params
	{
	public:
		bool                                                       Next_;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.ResetFilters
	 */
	struct ABP_ScreenshotCam_C_ResetFilters_Params
	{
	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.InpAxisEvt_MouseRight_K2Node_InputAxisEvent_4
	 */
	struct ABP_ScreenshotCam_C_InpAxisEvt_MouseRight_K2Node_InputAxisEvent_4_Params
	{
	public:
		float                                                      AxisValue;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.InpAxisEvt_MouseUp_K2Node_InputAxisEvent_3
	 */
	struct ABP_ScreenshotCam_C_InpAxisEvt_MouseUp_K2Node_InputAxisEvent_3_Params
	{
	public:
		float                                                      AxisValue;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.ChangeFOV
	 */
	struct ABP_ScreenshotCam_C_ChangeFOV_Params
	{
	public:
		float                                                      Amount;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.ChangeSpeed
	 */
	struct ABP_ScreenshotCam_C_ChangeSpeed_Params
	{
	public:
		float                                                      Amount;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.ReceiveEndPlay
	 */
	struct ABP_ScreenshotCam_C_ReceiveEndPlay_Params
	{
	public:
		Engine_EEndPlayReason                                      EndPlayReason;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.ToggleGreenscreen
	 */
	struct ABP_ScreenshotCam_C_ToggleGreenscreen_Params
	{
	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.InpAxisEvt_MoveRight_K2Node_InputAxisEvent_2
	 */
	struct ABP_ScreenshotCam_C_InpAxisEvt_MoveRight_K2Node_InputAxisEvent_2_Params
	{
	public:
		float                                                      AxisValue;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.InpAxisEvt_MoveForward_K2Node_InputAxisEvent_1
	 */
	struct ABP_ScreenshotCam_C_InpAxisEvt_MoveForward_K2Node_InputAxisEvent_1_Params
	{
	public:
		float                                                      AxisValue;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ScreenshotCam.BP_ScreenshotCam_C.ExecuteUbergraph_BP_ScreenshotCam
	 */
	struct ABP_ScreenshotCam_C_ExecuteUbergraph_BP_ScreenshotCam_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
