#pragma once

/**
 * Name: Hydroneer
 * Version: 2.0.2
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class Voxel.AssetActorPrimitiveComponent
	 * Size -> 0x0000 (FullSize[0x0440] - InheritedSize[0x0440])
	 */
	class UAssetActorPrimitiveComponent : public UPrimitiveComponent
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelPlaceableItemActor
	 * Size -> 0x0010 (FullSize[0x0230] - InheritedSize[0x0220])
	 */
	class AVoxelPlaceableItemActor : public AActor
	{
	public:
		class AVoxelWorld*                                         PreviewWorld;                                            // 0x0220(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bOnlyImportIntoPreviewWorld;                             // 0x0228(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GUXJ[0x7];                                   // 0x0229(0x0007) MISSED OFFSET (PADDING)

	public:
		int32_t K2_GetPriority();
		void K2_AddItemToWorld(class AVoxelWorld* World);
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelAssetActor
	 * Size -> 0x00A8 (FullSize[0x02D8] - InheritedSize[0x0230])
	 */
	class AVoxelAssetActor : public AVoxelPlaceableItemActor
	{
	public:
		struct FVoxelTransformableGeneratorPicker                  Generator;                                               // 0x0230(0x0068) Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Priority;                                                // 0x0298(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bOverrideAssetBounds;                                    // 0x029C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7S3T[0x3];                                   // 0x029D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVoxelIntBox                                        AssetBounds;                                             // 0x02A0(0x0018) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bImportAsReference;                                      // 0x02B8(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSubtractiveAsset;                                       // 0x02B9(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EVoxelAssetMergeMode                                       MergeMode;                                               // 0x02BA(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSpawnNewVoxelWorld;                                     // 0x02BB(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSimulatePhysics;                                        // 0x02BC(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KJTJ[0x3];                                   // 0x02BD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    PreviewLOD;                                              // 0x02C0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EVoxelAssetActorPreviewUpdateType                          UpdateType;                                              // 0x02C4(0x0001) ELEMENT_SIZE_MISMATCH Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1URR[0x3];                                   // 0x02C4(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		bool                                                       bRoundAssetPosition;                                     // 0x02C8(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRoundAssetRotation;                                     // 0x02C9(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0K4L[0x2];                                   // 0x02CA(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		uint32_t                                                   MaxPreviewChunks;                                        // 0x02CC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USceneComponent*                                     Root;                                                    // 0x02D0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelAssetTools
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelAssetTools : public UBlueprintFunctionLibrary
	{
	public:
		void SetDataAssetMaterial(class UVoxelDataAsset* Asset, class UVoxelDataAsset** NewAsset, const struct FVoxelMaterial& Material);
		void InvertDataAsset(class UVoxelDataAsset* Asset, class UVoxelDataAsset** InvertedAsset);
		void ImportModifierAssetAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, class UVoxelTransformableGeneratorInstanceWrapper* Asset, const struct FTransform& Transform, const struct FVoxelIntBox& Bounds, bool bModifyValues, bool bModifyMaterials, bool bLockEntireWorld, bool bConvertToVoxelSpace, bool bHideLatentWarnings);
		void ImportModifierAsset(class AVoxelWorld* World, class UVoxelTransformableGeneratorInstanceWrapper* Asset, const struct FTransform& Transform, const struct FVoxelIntBox& Bounds, bool bModifyValues, bool bModifyMaterials, bool bLockEntireWorld, bool bConvertToVoxelSpace);
		void ImportDataAssetFastAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, class UVoxelDataAsset* Asset, const struct FVector& Position, EVoxelAssetMergeMode MergeMode, bool bConvertToVoxelSpace, bool bHideLatentWarnings);
		void ImportDataAssetFast(class AVoxelWorld* World, class UVoxelDataAsset* Asset, const struct FVector& Position, EVoxelAssetMergeMode MergeMode, bool bConvertToVoxelSpace);
		void ImportAssetAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, class UVoxelTransformableGeneratorInstanceWrapper* Asset, const struct FTransform& Transform, const struct FVoxelIntBox& Bounds, bool bSubtractive, EVoxelAssetMergeMode MergeMode, bool bConvertToVoxelSpace, bool bHideLatentWarnings);
		void ImportAssetAsReferenceAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, struct FVoxelAssetItemReference* Reference, class AVoxelWorld* World, class UVoxelTransformableGeneratorInstanceWrapper* Asset, const struct FTransform& Transform, const struct FVoxelIntBox& Bounds, int32_t Priority, bool bConvertToVoxelSpace, bool bUpdateRender, bool bHideLatentWarnings);
		void ImportAssetAsReference(struct FVoxelAssetItemReference* Reference, class AVoxelWorld* World, class UVoxelTransformableGeneratorInstanceWrapper* Asset, const struct FTransform& Transform, const struct FVoxelIntBox& Bounds, int32_t Priority, bool bConvertToVoxelSpace, bool bUpdateRender);
		void ImportAsset(class AVoxelWorld* World, class UVoxelTransformableGeneratorInstanceWrapper* Asset, const struct FTransform& Transform, const struct FVoxelIntBox& Bounds, bool bSubtractive, EVoxelAssetMergeMode MergeMode, bool bConvertToVoxelSpace);
		class UVoxelDataAsset* CreateDataAssetFromWorldSection(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bCopyMaterials);
		void AddDisableEditsBoxAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, struct FVoxelDisableEditsBoxItemReference* Reference, class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bHideLatentWarnings);
		void AddDisableEditsBox(struct FVoxelDisableEditsBoxItemReference* Reference, class AVoxelWorld* World, const struct FVoxelIntBox& Bounds);
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelMaterialCollectionBase
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelMaterialCollectionBase : public UObject
	{
	public:
		TArray<struct FVoxelMaterialCollectionMaterialInfo> GetMaterials();
		int32_t GetMaterialIndex(const class FName& Name);
		class UMaterialInterface* GetIndexMaterial(unsigned char Index);
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelBasicMaterialCollection
	 * Size -> 0x0010 (FullSize[0x0038] - InheritedSize[0x0028])
	 */
	class UVoxelBasicMaterialCollection : public UVoxelMaterialCollectionBase
	{
	public:
		TArray<struct FVoxelBasicMaterialCollectionLayer>          Layers;                                                  // 0x0028(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelBlueprintLibrary
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelBlueprintLibrary : public UBlueprintFunctionLibrary
	{
	public:
		void UpdatePosition(class AVoxelWorld* World, const struct FIntVector& Position);
		void UpdateBounds(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds);
		void UpdateAll(class AVoxelWorld* World);
		bool Undo(class AVoxelWorld* World, TArray<struct FVoxelIntBox>* OutUpdatedBounds);
		struct FBox TransformVoxelBoxToGlobalBox(class AVoxelWorld* World, const struct FVoxelIntBox& Box);
		struct FVoxelIntBox TransformGlobalBoxToVoxelBox(class AVoxelWorld* World, const struct FBox& Box);
		struct FIntVector Substract_IntVectorIntVector(const struct FIntVector& Left, const struct FIntVector& Right);
		void SetToolRenderingMaterial(class AVoxelWorld* World, const struct FVoxelToolRenderingRef& Ref, class UMaterialInterface* Material);
		void SetToolRenderingEnabled(class AVoxelWorld* World, const struct FVoxelToolRenderingRef& Ref, bool bEnabled);
		void SetToolRenderingBounds(class AVoxelWorld* World, const struct FVoxelToolRenderingRef& Ref, const struct FBox& Bounds);
		void SetNumberOfVoxelThreads(int32_t Number);
		void ScaleData(class AVoxelWorld* World, const struct FVector& Scale);
		void SaveFrame(class AVoxelWorld* World);
		void RegenerateSpawners(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds);
		bool Redo(class AVoxelWorld* World, TArray<struct FVoxelIntBox>* OutUpdatedBounds);
		void RecreateSpawners(class AVoxelWorld* World);
		void RecreateRender(class AVoxelWorld* World);
		void Recreate(class AVoxelWorld* World, bool bSaveData);
		void RecomputeComponentPositions(class AVoxelWorld* World);
		void RaiseWarning(const class FString& Message, class UObject* Object);
		void RaiseInfo(const class FString& Message, class UObject* Object);
		void RaiseError(const class FString& Message, class UObject* Object);
		int32_t NumberOfCores();
		struct FIntVector Multiply_IntVectorIntVector(const struct FIntVector& Left, const struct FIntVector& Right);
		struct FIntVector Multiply_IntVectorInt(const struct FIntVector& Left, int32_t Right);
		struct FIntVector Multiply_IntIntVector(int32_t Left, const struct FIntVector& Right);
		void MarkSpawnersDirty(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds);
		struct FVoxelMaterial MakeSingleIndexMaterial(unsigned char Index);
		struct FVoxelMaterial MakeRawMaterial(unsigned char R, unsigned char G, unsigned char B, unsigned char A, unsigned char U0, unsigned char V0, unsigned char U1, unsigned char v1, unsigned char U2, unsigned char v2, unsigned char U3, unsigned char V3);
		int32_t MakeMaterialMask(bool R, bool G, bool B, bool A, bool U0, bool V0, bool U1, bool v1, bool U2, bool v2, bool U3, bool V3);
		struct FVoxelIntBox MakeIntBoxFromGlobalPositionAndRadius(class AVoxelWorld* World, const struct FVector& GlobalPosition, float Radius);
		struct FVoxelMaterial MakeColorMaterial(const struct FLinearColor& Color);
		void LogMemoryStats();
		bool IsVoxelWorldMeshLoading(class AVoxelWorld* World);
		bool IsVoxelWorldFoliageLoading(class AVoxelWorld* World);
		bool IsVoxelPluginPro();
		bool IsVoxelFloatTextureValid(const struct FVoxelFloatTexture& Texture);
		bool IsVoxelColorTextureValid(const struct FVoxelFloatTexture& Texture);
		bool IsValidRef(class AVoxelWorld* World, const struct FVoxelToolRenderingRef& Ref);
		bool IntervalContains_Int32(const struct FVoxelInt32Interval& Interval, int32_t Value);
		bool IntervalContains_Float(const struct FVoxelFloatInterval& Interval, float Value);
		bool HasValueData(class AVoxelWorld* World);
		bool HasMaterialData(class AVoxelWorld* World);
		class AVoxelWorld* GetVoxelWorldOverlappingBox(class UObject* WorldContextObject, const struct FBox& Box);
		class AVoxelWorld* GetVoxelWorldOverlappingActor(class AActor* Actor);
		class AVoxelWorld* GetVoxelWorldContainingPosition(class UObject* WorldContextObject, const struct FVector& Position);
		struct FIntPoint GetVoxelFloatTextureSize(const struct FVoxelFloatTexture& Texture);
		struct FIntPoint GetVoxelColorTextureSize(const struct FVoxelColorTexture& Texture);
		struct FVector2D GetUV(const struct FVoxelMaterial& Material, int32_t Channel);
		int32_t GetTaskCount(class AVoxelWorld* World);
		unsigned char GetSingleIndex(const struct FVoxelMaterial& Material);
		struct FVoxelIntBox GetRenderBoundsOverlappingDataBounds(class AVoxelWorld* World, const struct FVoxelIntBox& DataBounds, int32_t LOD);
		void GetRawMaterial(const struct FVoxelMaterial& Material, unsigned char* R, unsigned char* G, unsigned char* B, unsigned char* A, unsigned char* U0, unsigned char* V0, unsigned char* U1, unsigned char* v1, unsigned char* U2, unsigned char* v2, unsigned char* U3, unsigned char* V3);
		float GetPeakMemoryUsageInMB(EVoxelMemoryUsageType Type);
		int32_t GetNumberOfVoxelThreads();
		struct FVector GetNormal(class AVoxelWorld* World, const struct FIntVector& Position);
		void GetMultiIndex(const struct FVoxelMaterial& Material, bool bSortByStrength, float* Strength0, unsigned char* Index0, float* Strength1, unsigned char* Index1, float* Strength2, unsigned char* Index2, float* Strength3, unsigned char* Index3, float* Wetness);
		int32_t GetMin_Intvector(const struct FIntVector& Vector);
		float GetMemoryUsageInMB(EVoxelMemoryUsageType Type);
		int32_t GetMax_Intvector(const struct FIntVector& Vector);
		int32_t GetIntOutput(class AVoxelWorld* World, const class FName& Name, float X, float Y, float Z, int32_t DefaultValue);
		int32_t GetHistoryPosition(class AVoxelWorld* World);
		float GetFloatOutput(class AVoxelWorld* World, const class FName& Name, float X, float Y, float Z, float DefaultValue);
		float GetEstimatedCollisionsMemoryUsageInMB(class AVoxelWorld* World);
		struct FLinearColor GetColor(const struct FVoxelMaterial& Material);
		struct FVoxelIntBox GetBounds(class AVoxelWorld* World);
		TArray<class AVoxelWorld*> GetAllVoxelWorldsOverlappingBox(class UObject* WorldContextObject, const struct FBox& Box);
		TArray<class AVoxelWorld*> GetAllVoxelWorldsOverlappingActor(class AActor* Actor);
		TArray<class AVoxelWorld*> GetAllVoxelWorldsContainingPosition(class UObject* WorldContextObject, const struct FVector& Position);
		struct FIntVector Divide_IntVectorInt(const struct FIntVector& Left, int32_t Right);
		void DestroyToolRendering(class AVoxelWorld* World, const struct FVoxelToolRenderingRef& Ref);
		struct FVoxelFloatTexture CreateVoxelFloatTextureFromTextureChannel(class UTexture2D* Texture, EVoxelRGBA Channel);
		struct FVoxelColorTexture CreateVoxelColorTextureFromVoxelFloatTexture(const struct FVoxelFloatTexture& Texture, EVoxelRGBA Channel, bool bNormalize);
		struct FVoxelPaintMaterial CreateUVPaintMaterial(const struct FVoxelPaintMaterialUV& UV);
		struct FVoxelToolRenderingRef CreateToolRendering(class AVoxelWorld* World);
		class UTexture2D* CreateTextureFromVoxelFloatTexture(const struct FVoxelFloatTexture& VoxelTexture);
		class UTexture2D* CreateTextureFromVoxelColorTexture(const struct FVoxelColorTexture& VoxelTexture);
		struct FVoxelPaintMaterial CreateSingleIndexPaintMaterial(const struct FVoxelPaintMaterialSingleIndex& SingleIndex);
		class UTexture2D* CreateOrUpdateTextureFromVoxelFloatTexture(const struct FVoxelFloatTexture& VoxelTexture, class UTexture2D** Texture);
		class UTexture2D* CreateOrUpdateTextureFromVoxelColorTexture(const struct FVoxelColorTexture& VoxelTexture, class UTexture2D** Texture);
		struct FVoxelPaintMaterial CreateMultiIndexWetnessPaintMaterial(const struct FVoxelPaintMaterialMultiIndexWetness& MultiIndexWetness);
		struct FVoxelPaintMaterial CreateMultiIndexRawPaintMaterial(const struct FVoxelPaintMaterialMultiIndexRaw& MultiIndexRaw);
		struct FVoxelPaintMaterial CreateMultiIndexPaintMaterial(const struct FVoxelPaintMaterialMultiIndex& MultiIndex);
		struct FVoxelPaintMaterial CreateFiveWayBlendPaintMaterial(const struct FVoxelPaintMaterialFiveWayBlend& FiveWayBlend);
		struct FVoxelPaintMaterial CreateColorPaintMaterial(const struct FVoxelPaintMaterialColor& Color);
		void CompactVoxelTexturePool(class AVoxelWorld* World);
		void ClearValueData(class AVoxelWorld* World, bool bUpdateRender);
		void ClearMaterialData(class AVoxelWorld* World, bool bUpdateRender);
		void ClearFrames(class AVoxelWorld* World);
		void ClearDirtyData(class AVoxelWorld* World, bool bUpdateRender);
		void ClearAllData(class AVoxelWorld* World, bool bUpdateRender);
		void BindVoxelGenerationEvent(class AVoxelWorld* World, const class FScriptDelegate& OnGenerate, bool bFireExistingOnes, int32_t ChunkSize, int32_t GenerationDistanceInChunks);
		void BindVoxelChunkEvents(class AVoxelWorld* World, const class FScriptDelegate& OnActivate, const class FScriptDelegate& OnDeactivate, bool bFireExistingOnes, int32_t ChunkSize, int32_t ActivationDistanceInChunks);
		bool AreCollisionsEnabled(class AVoxelWorld* World, const struct FVector& Position, int32_t* LOD, bool bConvertToVoxelSpace);
		struct FVoxelMaterial ApplyPaintMaterial(const struct FVoxelMaterial& Material, const struct FVoxelPaintMaterial& PaintMaterial, float Strength);
		void ApplyNewMaterials(class AVoxelWorld* World);
		void ApplyLODSettings(class AVoxelWorld* World);
		void AddNeighborsToSet();
		struct FIntVector Add_IntVectorIntVector(const struct FIntVector& Left, const struct FIntVector& Right);
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelBlueprintMaterialCollectionInterface
	 * Size -> 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
	 */
	class UVoxelBlueprintMaterialCollectionInterface : public UObject
	{
	public:
		int32_t                                                    MaxMaterialsToBlendAtOnce;                               // 0x0028(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bEnableCubicFaces;                                       // 0x002C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FQ47[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (PADDING)

	public:
		void InitializeCollection();
		TArray<struct FVoxelMaterialCollectionMaterialInfo> GetMaterials();
		class UMaterialInterface* GetMaterialForIndices(TArray<unsigned char> Indices);
		class UMaterialInterface* GetMaterialForIndex(int32_t Index, EVoxelCubicFace Face);
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelCachedMaterialCollection
	 * Size -> 0x0050 (FullSize[0x0078] - InheritedSize[0x0028])
	 */
	class UVoxelCachedMaterialCollection : public UVoxelMaterialCollectionBase
	{
	public:
		TMap<struct FVoxelMaterialIndices, class UMaterialInterface*> CachedMaterials;                                         // 0x0028(0x0050) Transient, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelBlueprintMaterialCollection
	 * Size -> 0x0008 (FullSize[0x0080] - InheritedSize[0x0078])
	 */
	class UVoxelBlueprintMaterialCollection : public UVoxelCachedMaterialCollection
	{
	public:
		class UVoxelBlueprintMaterialCollectionInterface*          Instance;                                                // 0x0078(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelToolsBase
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelToolsBase : public UBlueprintFunctionLibrary
	{
	public:
		struct FVoxelIntBox GetModifiedVoxelValuesBounds(TArray<struct FModifiedVoxelValue> ModifiedVoxels);
		struct FVoxelIntBox GetModifiedVoxelMaterialsBounds(TArray<struct FModifiedVoxelMaterial> ModifiedVoxels);
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelBoxTools
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelBoxTools : public UVoxelToolsBase
	{
	public:
		void SetValueBoxAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, TArray<struct FModifiedVoxelValue>* ModifiedValues, struct FVoxelIntBox* EditedBounds, class AVoxelWorld* VoxelWorld, const struct FVoxelIntBox& Bounds, float Value, bool bMultiThreaded, bool bRecordModifiedValues, bool bUpdateRender, bool bHideLatentWarnings);
		void SetValueBox(TArray<struct FModifiedVoxelValue>* ModifiedValues, struct FVoxelIntBox* EditedBounds, class AVoxelWorld* VoxelWorld, const struct FVoxelIntBox& Bounds, float Value, bool bMultiThreaded, bool bRecordModifiedValues, bool bUpdateRender);
		void SetMaterialBoxAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, TArray<struct FModifiedVoxelMaterial>* ModifiedMaterials, struct FVoxelIntBox* EditedBounds, class AVoxelWorld* VoxelWorld, const struct FVoxelIntBox& Bounds, const struct FVoxelPaintMaterial& PaintMaterial, bool bMultiThreaded, bool bRecordModifiedMaterials, bool bUpdateRender, bool bHideLatentWarnings);
		void SetMaterialBox(TArray<struct FModifiedVoxelMaterial>* ModifiedMaterials, struct FVoxelIntBox* EditedBounds, class AVoxelWorld* VoxelWorld, const struct FVoxelIntBox& Bounds, const struct FVoxelPaintMaterial& PaintMaterial, bool bMultiThreaded, bool bRecordModifiedMaterials, bool bUpdateRender);
		void RemoveBoxAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, TArray<struct FModifiedVoxelValue>* ModifiedValues, struct FVoxelIntBox* EditedBounds, class AVoxelWorld* VoxelWorld, const struct FVoxelIntBox& Bounds, bool bMultiThreaded, bool bRecordModifiedValues, bool bUpdateRender, bool bHideLatentWarnings);
		void RemoveBox(TArray<struct FModifiedVoxelValue>* ModifiedValues, struct FVoxelIntBox* EditedBounds, class AVoxelWorld* VoxelWorld, const struct FVoxelIntBox& Bounds, bool bMultiThreaded, bool bRecordModifiedValues, bool bUpdateRender);
		void AddBoxAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, TArray<struct FModifiedVoxelValue>* ModifiedValues, struct FVoxelIntBox* EditedBounds, class AVoxelWorld* VoxelWorld, const struct FVoxelIntBox& Bounds, bool bMultiThreaded, bool bRecordModifiedValues, bool bUpdateRender, bool bHideLatentWarnings);
		void AddBox(TArray<struct FModifiedVoxelValue>* ModifiedValues, struct FVoxelIntBox* EditedBounds, class AVoxelWorld* VoxelWorld, const struct FVoxelIntBox& Bounds, bool bMultiThreaded, bool bRecordModifiedValues, bool bUpdateRender);
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelCharacter
	 * Size -> 0x0000 (FullSize[0x04C0] - InheritedSize[0x04C0])
	 */
	class AVoxelCharacter : public ACharacter
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelSubsystemProxy
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelSubsystemProxy : public UObject
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelStaticSubsystemProxy
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelStaticSubsystemProxy : public UVoxelSubsystemProxy
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelChunksSubsystemProxy
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelChunksSubsystemProxy : public UVoxelStaticSubsystemProxy
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelGenerator
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelGenerator : public UObject
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelChunkGenerator
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelChunkGenerator : public UVoxelGenerator
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelCookingLibrary
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelCookingLibrary : public UBlueprintFunctionLibrary
	{
	public:
		struct FVoxelCookingSettings MakeVoxelCookingSettingsFromVoxelWorld(class AVoxelWorld* World);
		void LoadCookedVoxelData(const struct FVoxelCookedData& CookedData, class AVoxelWorld* World);
		struct FVoxelCookedData CookVoxelDataWithSave(const struct FVoxelCookingSettings& Settings, const struct FVoxelUncompressedWorldSave& Save);
		struct FVoxelCookedData CookVoxelData(const struct FVoxelCookingSettings& Settings);
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelCubicLibrary
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelCubicLibrary : public UBlueprintFunctionLibrary
	{
	public:
		void SetCubicVoxelValue(class AVoxelWorld* World, const struct FIntVector& Position, bool bValue);
		bool GetCubicVoxelValue(class AVoxelWorld* World, const struct FIntVector& Position);
		struct FIntVector GetCubicVoxelPositionFromHit(class AVoxelWorld* World, const struct FVector& HitPosition, const struct FVector& HitNormal, bool bSelectVoxelOutside);
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelTransformableGenerator
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelTransformableGenerator : public UVoxelGenerator
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelTransformableGeneratorWithBounds
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelTransformableGeneratorWithBounds : public UVoxelTransformableGenerator
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelDataAsset
	 * Size -> 0x0078 (FullSize[0x00A0] - InheritedSize[0x0028])
	 */
	class UVoxelDataAsset : public UVoxelTransformableGeneratorWithBounds
	{
	public:
		bool                                                       bSubtractiveAsset;                                       // 0x0028(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5BTG[0x3];                                   // 0x0029(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FIntVector                                          PositionOffset;                                          // 0x002C(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Tolerance;                                               // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FIntVector                                          Size;                                                    // 0x003C(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      UncompressedSizeInMB;                                    // 0x0048(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CompressedSizeInMB;                                      // 0x004C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EVoxelDataAssetImportSource                                Source;                                                  // 0x0050(0x0001) ELEMENT_SIZE_MISMATCH Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_W6ID[0x3];                                   // 0x0050(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		unsigned char                                              UnknownData_AEMF[0x4];                                   // 0x0054(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class FString>                                      Paths;                                                   // 0x0058(0x0010) Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic
		struct FVoxelDataAssetImportSettings_MagicaVox             ImportSettings_MagicaVox;                                // 0x0068(0x0008) Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PBMP[0x10];                                  // 0x0070(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    VoxelCustomVersion;                                      // 0x0080(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		uint32_t                                                   ValueConfigFlag;                                         // 0x0084(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		uint32_t                                                   MaterialConfigFlag;                                      // 0x0088(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_O9BE[0x14];                                  // 0x008C(0x0014) MISSED OFFSET (PADDING)

	public:
		struct FIntVector GetSize();
		struct FVoxelIntBox GetBounds();
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelDataItemActor
	 * Size -> 0x0028 (FullSize[0x0248] - InheritedSize[0x0220])
	 */
	class AVoxelDataItemActor : public AActor
	{
	public:
		bool                                                       bAutomaticUpdates;                                       // 0x0220(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ICZD[0x3];                                   // 0x0221(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RefreshDelay;                                            // 0x0224(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FZ48[0x20];                                  // 0x0228(0x0020) MISSED OFFSET (PADDING)

	public:
		void ScheduleRefresh();
		void K2_AddItemToWorld(class AVoxelWorld* World);
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelDataSubsystemProxy
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelDataSubsystemProxy : public UVoxelStaticSubsystemProxy
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelDataTools
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelDataTools : public UBlueprintFunctionLibrary
	{
	public:
		void SetValueAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, const struct FIntVector& Position, float Value, bool bHideLatentWarnings);
		void SetValue(class AVoxelWorld* World, const struct FIntVector& Position, float Value);
		void SetMaterialAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, const struct FIntVector& Position, const struct FVoxelMaterial& Material, bool bHideLatentWarnings);
		void SetMaterial(class AVoxelWorld* World, const struct FIntVector& Position, const struct FVoxelMaterial& Material, int32_t Mask);
		void SetBoxAsDirtyAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bDirtyValues, bool bDirtyMaterials, bool bHideLatentWarnings);
		void SetBoxAsDirty(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bDirtyValues, bool bDirtyMaterials);
		void RoundVoxelsAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bHideLatentWarnings);
		void RoundVoxels(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds);
		void RoundToGeneratorAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bPreserveNormals, bool bHideLatentWarnings);
		void RoundToGenerator(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bPreserveNormals);
		bool LoadFromSave(class AVoxelWorld* World, const struct FVoxelUncompressedWorldSave& Save);
		bool LoadFromCompressedSave(class AVoxelWorld* World, const struct FVoxelCompressedWorldSave& Save);
		void GetVoxelsValueAndMaterialAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, TArray<struct FVoxelValueMaterial>* Voxels, class AVoxelWorld* World, TArray<struct FIntVector> Positions, bool bHideLatentWarnings);
		void GetVoxelsValueAndMaterial(TArray<struct FVoxelValueMaterial>* Voxels, class AVoxelWorld* World, TArray<struct FIntVector> Positions);
		void GetValueAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, float* Value, class AVoxelWorld* World, const struct FIntVector& Position, bool bHideLatentWarnings);
		void GetValue(float* Value, class AVoxelWorld* World, const struct FIntVector& Position);
		void GetSaveAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, struct FVoxelUncompressedWorldSave* OutSave, bool bHideLatentWarnings);
		void GetSave(class AVoxelWorld* World, struct FVoxelUncompressedWorldSave* OutSave);
		void GetMaterialAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, struct FVoxelMaterial* Material, class AVoxelWorld* World, const struct FIntVector& Position, bool bHideLatentWarnings);
		void GetMaterial(struct FVoxelMaterial* Material, class AVoxelWorld* World, const struct FIntVector& Position);
		void GetInterpolatedValue(float* Value, class AVoxelWorld* World, const struct FVector& Position);
		struct FVoxelDataMemoryUsageInMB GetDataMemoryUsageInMB(class AVoxelWorld* World);
		void GetCompressedSaveAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, struct FVoxelCompressedWorldSave* OutSave, bool bHideLatentWarnings);
		void GetCompressedSave(class AVoxelWorld* World, struct FVoxelCompressedWorldSave* OutSave);
		void FindClosestNonEmptyVoxelAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, struct FVoxelFindClosestNonEmptyVoxelResult* Result, class AVoxelWorld* World, const struct FVector& Position, bool bReadMaterial, bool bConvertToVoxelSpace, bool bHideLatentWarnings);
		void FindClosestNonEmptyVoxel(struct FVoxelFindClosestNonEmptyVoxelResult* Result, class AVoxelWorld* World, const struct FVector& Position, bool bReadMaterial, bool bConvertToVoxelSpace);
		void CompressIntoHeightmap(class AVoxelWorld* World, class UVoxelHeightmapAsset* HeightmapAsset, bool bHeightmapAssetMatchesWorld);
		void ClearUnusedMaterialsAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bHideLatentWarnings);
		void ClearUnusedMaterials(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds);
		void ClearCachedValuesAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bHideLatentWarnings);
		void ClearCachedValues(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds);
		void ClearCachedMaterialsAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bHideLatentWarnings);
		void ClearCachedMaterials(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds);
		void CheckIfSameAsGeneratorAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bHideLatentWarnings);
		void CheckIfSameAsGenerator(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds);
		void CheckForSingleValuesAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bHideLatentWarnings);
		void CheckForSingleValues(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds);
		void CheckForSingleMaterialsAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bHideLatentWarnings);
		void CheckForSingleMaterials(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds);
		void CacheValuesAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bHideLatentWarnings);
		void CacheValues(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bMultiThreaded);
		void CacheMaterialsAsync(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bHideLatentWarnings);
		void CacheMaterials(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, bool bMultiThreaded);
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelDebugSubsystemProxy
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelDebugSubsystemProxy : public UVoxelStaticSubsystemProxy
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelDebugUtilities
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelDebugUtilities : public UBlueprintFunctionLibrary
	{
	public:
		void DrawDebugIntBox(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, const struct FTransform& Transform, float LifeTime, float Thickness, const struct FLinearColor& Color);
		void DrawDataOctree(class AVoxelWorld* World, EVoxelDataType DataType, float LifeTime, bool bShowSingle, bool bShowCached, const struct FColor& SingleColor, const struct FColor& SingleDirtyColor, const struct FColor& CachedColor, const struct FColor& DirtyColor);
		void DebugVoxelsInsideBounds(class AVoxelWorld* World, const struct FVoxelIntBox& Bounds, const struct FLinearColor& Color, float LifeTime, float Thickness, bool bDebugDensities, const struct FLinearColor& TextColor);
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelDynamicSubsystemProxy
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelDynamicSubsystemProxy : public UVoxelSubsystemProxy
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelLODSubsystemProxy
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelLODSubsystemProxy : public UVoxelDynamicSubsystemProxy
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelDefaultLODSubsystemProxy
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelDefaultLODSubsystemProxy : public UVoxelLODSubsystemProxy
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelRendererSubsystemProxy
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelRendererSubsystemProxy : public UVoxelDynamicSubsystemProxy
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelDefaultRendererSubsystemProxy
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelDefaultRendererSubsystemProxy : public UVoxelRendererSubsystemProxy
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelDisableEditsBox
	 * Size -> 0x0008 (FullSize[0x0238] - InheritedSize[0x0230])
	 */
	class AVoxelDisableEditsBox : public AVoxelPlaceableItemActor
	{
	public:
		class UBoxComponent*                                       Box;                                                     // 0x0230(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelEmptyGenerator
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelEmptyGenerator : public UVoxelTransformableGenerator
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelErosion
	 * Size -> 0x0100 (FullSize[0x0128] - InheritedSize[0x0028])
	 */
	class UVoxelErosion : public UObject
	{
	public:
		int32_t                                                    Size;                                                    // 0x0028(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DeltaTime;                                               // 0x002C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Scale;                                                   // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Gravity;                                                 // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SedimentCapacity;                                        // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SedimentDissolving;                                      // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SedimentDeposition;                                      // 0x0040(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RainStrength;                                            // 0x0044(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Evaporation;                                             // 0x0048(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V79I[0x4];                                   // 0x004C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVoxelFloatTexture                                  RainMapInit;                                             // 0x0050(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		struct FVoxelFloatTexture                                  HeightmapInit;                                           // 0x0068(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0LH4[0xA8];                                  // 0x0080(0x00A8) MISSED OFFSET (PADDING)

	public:
		void Step(int32_t Count);
		bool IsInitialized();
		void Initialize();
		struct FVoxelFloatTexture GetWaterHeightTexture();
		struct FVoxelFloatTexture GetTerrainHeightTexture();
		struct FVoxelFloatTexture GetSedimentTexture();
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelEventSubsystemProxy
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelEventSubsystemProxy : public UVoxelStaticSubsystemProxy
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelFixedResolutionLODSubsystemProxy
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelFixedResolutionLODSubsystemProxy : public UVoxelLODSubsystemProxy
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelFlatGenerator
	 * Size -> 0x0020 (FullSize[0x0048] - InheritedSize[0x0028])
	 */
	class UVoxelFlatGenerator : public UVoxelGenerator
	{
	public:
		struct FLinearColor                                        Color;                                                   // 0x0028(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FVoxelFlatGeneratorDataItemConfig>           DataItemConfigs;                                         // 0x0038(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelTool
	 * Size -> 0x0158 (FullSize[0x0180] - InheritedSize[0x0028])
	 */
	class UVoxelTool : public UObject
	{
	public:
		class FName                                                ToolName;                                                // 0x0028(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FText                                                Tooltip;                                                 // 0x0030(0x0018) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
		bool                                                       bShowInDropdown;                                         // 0x0048(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bShowPaintMaterial;                                      // 0x0049(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NUM6[0x6];                                   // 0x004A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UVoxelToolSharedConfig*                              SharedConfig;                                            // 0x0050(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bEnabled;                                                // 0x0058(0x0001) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_NKFC[0x7];                                   // 0x0059(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVoxelToolTickData                                  FrozenTickData;                                          // 0x0060(0x0120) Transient, NativeAccessSpecifierPrivate

	public:
		struct FVoxelToolTickData MakeVoxelToolTickData(class APlayerController* PlayerController, bool bEdit, TMap<class FName, bool> Keys, TMap<class FName, float> Axes, const struct FVector2D& MousePosition, const struct FVector& CameraDirection, ECollisionChannel CollisionChannel);
		class UVoxelTool* MakeVoxelTool(class UClass* ToolClass);
		TMap<class FName, bool> MakeToolKeys(bool bAlternativeMode);
		TMap<class FName, float> MakeToolAxes(float BrushSizeDelta, float FalloffDelta, float StrengthDelta);
		void K2_SimpleTick(class APlayerController* PlayerController, bool bEdit, TMap<class FName, bool> Keys, TMap<class FName, float> Axes, const class FScriptDelegate& DoEditOverride, ECollisionChannel CollisionChannel);
		void K2_AdvancedTick(class UObject* WorldContextObject, const struct FVoxelToolTickData& TickData, const class FScriptDelegate& DoEditOverride);
		bool IsKeyDown(const struct FVoxelToolTickData& TickData, const class FName& Key);
		bool IsAlternativeMode(const struct FVoxelToolTickData& TickData);
		class AVoxelWorld* GetVoxelWorld();
		class FName GetToolName();
		struct FVector GetRayOrigin(const struct FVoxelToolTickData& TickData);
		struct FVector GetRayDirection(const struct FVoxelToolTickData& TickData);
		float GetAxis(const struct FVoxelToolTickData& TickData, const class FName& Axis);
		void EnableTool();
		void DoEditDynamicOverride__DelegateSignature(const struct FVector& Position, const struct FVector& Normal);
		void DisableTool();
		bool Deproject(const struct FVoxelToolTickData& TickData, const struct FVector2D& ScreenPosition, struct FVector* WorldPosition, struct FVector* WorldDirection);
		void Apply(class AVoxelWorld* World, const struct FVector& Position, const struct FVector& Normal, TMap<class FName, bool> Keys, TMap<class FName, float> Axes);
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelToolBase
	 * Size -> 0x03D0 (FullSize[0x0550] - InheritedSize[0x0180])
	 */
	class UVoxelToolBase : public UVoxelTool
	{
	public:
		class AVoxelWorld*                                         VoxelWorld;                                              // 0x0180(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_WYVN[0x3A8];                                 // 0x0188(0x03A8) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UMaterialInstanceDynamic*                            ToolOverlayMaterialInstance;                             // 0x0530(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UMaterialInstanceDynamic*                            ToolMeshMaterialInstance;                                // 0x0538(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UMaterialInstanceDynamic*                            PlaneMeshMaterialInstance;                               // 0x0540(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_6TGN[0x8];                                   // 0x0548(0x0008) MISSED OFFSET (PADDING)

	public:
		void UpdateToolMesh(class UStaticMesh* Mesh, class UMaterialInterface* Material, const struct FTransform& Transform, const class FName& ID);
		void SetToolOverlayBounds(const struct FBox& Bounds);
		bool LastFrameCanEdit();
		void K2_UpdateRender(class UMaterialInstanceDynamic* OverlayMaterialInstance, class UMaterialInstanceDynamic* MeshMaterialInstance);
		void K2_Tick();
		void K2_GetToolConfig(const struct FVoxelToolBaseConfig& InConfig, struct FVoxelToolBaseConfig* OutConfig);
		struct FVoxelIntBoxWithValidity K2_DoEdit();
		float GetValueAfterAxisInput(const class FName& AxisName, float CurrentValue, float Min, float Max);
		struct FVector GetToolPreviewPosition();
		struct FVector GetToolPosition();
		struct FVector GetToolNormal();
		struct FVector GetToolDirection();
		struct FVoxelToolTickData GetTickData();
		float GetMouseMovementSize();
		struct FVoxelToolTickData GetLastFrameTickData();
		float GetDeltaTime();
		struct FVoxelIntBox GetBoundsToCache(const struct FVoxelIntBox& Bounds);
		bool CanEdit();
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelFlattenTool
	 * Size -> 0x0040 (FullSize[0x0590] - InheritedSize[0x0550])
	 */
	class UVoxelFlattenTool : public UVoxelToolBase
	{
	public:
		class UMaterialInterface*                                  ToolMaterial;                                            // 0x0548(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Strength;                                                // 0x0550(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bFreezeOnClick;                                          // 0x0554(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bUseAverage;                                             // 0x0555(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bUseFixedRotation;                                       // 0x0556(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_G6ZE[0x1];                                   // 0x0557(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRotator                                            FixedRotation;                                           // 0x0558(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bPropagateMaterials;                                     // 0x0564(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bEnableFalloff;                                          // 0x0565(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EVoxelFalloff                                              FalloffType;                                             // 0x0566(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8PLX[0x1];                                   // 0x0567(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Falloff;                                                 // 0x0568(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_E408[0x24];                                  // 0x056C(0x0024) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelFoliageBiomeBase
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelFoliageBiomeBase : public UObject
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelFoliageCollectionBase
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelFoliageCollectionBase : public UObject
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelFoliageInterfaceSubsystemProxy
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelFoliageInterfaceSubsystemProxy : public UVoxelStaticSubsystemProxy
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelGeneratorCacheSubsystemProxy
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UVoxelGeneratorCacheSubsystemProxy : public UVoxelStaticSubsystemProxy
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelGeneratorCache
	 * Size -> 0x0010 (FullSize[0x0038] - InheritedSize[0x0028])
	 */
	class UVoxelGeneratorCache : public UObject
	{
	public:
		unsigned char                                              UnknownData_LOYW[0x10];                                  // 0x0028(0x0010) MISSED OFFSET (PADDING)

	public:
		class UVoxelTransformableGeneratorInstanceWrapper* MakeTransformableGeneratorInstance(const struct FVoxelTransformableGeneratorPicker& Picker);
		class UVoxelGeneratorInstanceWrapper* MakeGeneratorInstance(const struct FVoxelGeneratorPicker& Picker);
		static UClass* StaticClass();
	};

	/**
	 * Class Voxel.VoxelGeneratorInstanceWrapper
	 * Size -> 0x0010 (FullSize[0x0038] - InheritedSize[0x0028])
	 */
	class UVoxelGeneratorInstanceWrapper : public UObject
	{
	public:
		unsigned char                                              UnknownData_7S0W[0x10];                                  // 0x0028(0x0010) MISSED OFFSET (PADDING)

	public:
		bool IsValid();
