#pragma once

/**
 * Name: Hydroneer
 * Version: 2.0.2
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class VoxelGraph.VoxelGraphGeneratorHelper
	 * Size -> 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
	 */
	class UVoxelGraphGeneratorHelper : public UVoxelTransformableGenerator
	{
	public:
		bool                                                       bEnableRangeAnalysis;                                    // 0x0028(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8XPP[0x7];                                   // 0x0029(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VDI_Capsule_Graph
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class UVDI_Capsule_Graph : public UVoxelGraphGeneratorHelper
	{
	public:
		float                                                      Noise_Amplitude;                                         // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Seed;                                                    // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VDI_Example_Crater_Graph
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UVDI_Example_Crater_Graph : public UVoxelGraphGeneratorHelper
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VDI_Ravine_Graph
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UVDI_Ravine_Graph : public UVoxelGraphGeneratorHelper
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VDI_Sphere_Graph
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UVDI_Sphere_Graph : public UVoxelGraphGeneratorHelper
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VG_Example_Craters
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class UVG_Example_Craters : public UVoxelGraphGeneratorHelper
	{
	public:
		float                                                      Radius;                                                  // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_T0YK[0x4];                                   // 0x0034(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VG_Example_Dunes
	 * Size -> 0x0018 (FullSize[0x0048] - InheritedSize[0x0030])
	 */
	class UVG_Example_Dunes : public UVoxelGraphGeneratorHelper
	{
	public:
		float                                                      Direction_X;                                             // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Direction_Y;                                             // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Dune_Frequency;                                          // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Height;                                                  // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Noise_Frequency;                                         // 0x0040(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_467E[0x4];                                   // 0x0044(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VG_Example_Erosion
	 * Size -> 0x0068 (FullSize[0x0098] - InheritedSize[0x0030])
	 */
	class UVG_Example_Erosion : public UVoxelGraphGeneratorHelper
	{
	public:
		float                                                      Erosion_Material_Offset;                                 // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Erosion_Material_Strength;                               // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Erosion_Strength;                                        // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Height;                                                  // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              Rocks[0x28];                                             // 0x0040(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              Snow[0x28];                                              // 0x0068(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		float                                                      Valleys_Height;                                          // 0x0090(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_40XQ[0x4];                                   // 0x0094(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VG_Example_FastCraters
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UVG_Example_FastCraters : public UVoxelGraphGeneratorHelper
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VG_Example_MultiIndex
	 * Size -> 0x00A0 (FullSize[0x00D0] - InheritedSize[0x0030])
	 */
	class UVG_Example_MultiIndex : public UVoxelGraphGeneratorHelper
	{
	public:
		unsigned char                                              Layer_1[0x28];                                           // 0x0030(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              Layer_2[0x28];                                           // 0x0058(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              Layer_3[0x28];                                           // 0x0080(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              Layer_4[0x28];                                           // 0x00A8(0x0028) UNKNOWN PROPERTY: SoftObjectProperty

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode
	 * Size -> 0x0030 (FullSize[0x0058] - InheritedSize[0x0028])
	 */
	class UVoxelNode : public UObject
	{
	public:
		TArray<struct FVoxelPin>                                   InputPins;                                               // 0x0028(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FVoxelPin>                                   OutputPins;                                              // 0x0038(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		class UVoxelGraphGenerator*                                Graph;                                                   // 0x0048(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    InputPinCount;                                           // 0x0050(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RG49[0x4];                                   // 0x0054(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNodeHelper
	 * Size -> 0x0040 (FullSize[0x0098] - InheritedSize[0x0058])
	 */
	class UVoxelNodeHelper : public UVoxelNode
	{
	public:
		unsigned char                                              UnknownData_TW95[0x40];                                  // 0x0058(0x0040) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelExposedNode
	 * Size -> 0x00B8 (FullSize[0x0150] - InheritedSize[0x0098])
	 */
	class UVoxelExposedNode : public UVoxelNodeHelper
	{
	public:
		class FString                                              DisplayName;                                             // 0x0098(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                UniqueName;                                              // 0x00A8(0x0008) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              Category;                                                // 0x00B0(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              Tooltip;                                                 // 0x00C0(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Priority;                                                // 0x00D0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PQAE[0x4];                                   // 0x00D4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              UIMin;                                                   // 0x00D8(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              UIMax;                                                   // 0x00E8(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TMap<class FName, class FString>                           CustomMetaData;                                          // 0x00F8(0x0050) Edit, NativeAccessSpecifierPublic
		bool                                                       bCanBeRenamed;                                           // 0x0148(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_2D3T[0x7];                                   // 0x0149(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelAssetPickerNode
	 * Size -> 0x0000 (FullSize[0x0150] - InheritedSize[0x0150])
	 */
	class UVoxelAssetPickerNode : public UVoxelExposedNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelPureNode
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelPureNode : public UVoxelNodeHelper
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_FLess
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_FLess : public UVoxelPureNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_FLessEqual
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_FLessEqual : public UVoxelPureNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_FGreater
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_FGreater : public UVoxelPureNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_FGreaterEqual
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_FGreaterEqual : public UVoxelPureNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_FEqual
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_FEqual : public UVoxelPureNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_FNotEqual
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_FNotEqual : public UVoxelPureNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_ILess
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_ILess : public UVoxelPureNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_ILessEqual
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_ILessEqual : public UVoxelPureNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_IGreater
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_IGreater : public UVoxelPureNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_IGreaterEqual
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_IGreaterEqual : public UVoxelPureNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_IEqual
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_IEqual : public UVoxelPureNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_INotEqual
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_INotEqual : public UVoxelPureNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_BiomeMapSampler
	 * Size -> 0x0020 (FullSize[0x0170] - InheritedSize[0x0150])
	 */
	class UVoxelNode_BiomeMapSampler : public UVoxelExposedNode
	{
	public:
		class UTexture2D*                                          Texture;                                                 // 0x0150(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Threshold;                                               // 0x0158(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4GPO[0x4];                                   // 0x015C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FBiomeMapElement>                            Biomes;                                                  // 0x0160(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_BiomeMerge
	 * Size -> 0x0018 (FullSize[0x0070] - InheritedSize[0x0058])
	 */
	class UVoxelNode_BiomeMerge : public UVoxelNode
	{
	public:
		TArray<class FString>                                      Biomes;                                                  // 0x0058(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		float                                                      Tolerance;                                               // 0x0068(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JJX1[0x4];                                   // 0x006C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNodeWithDependencies
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNodeWithDependencies : public UVoxelNodeHelper
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNodeWithContext
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNodeWithContext : public UVoxelNodeWithDependencies
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_LOD
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_LOD : public UVoxelNodeWithContext
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_VoxelSize
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_VoxelSize : public UVoxelNodeHelper
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_WorldSize
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_WorldSize : public UVoxelNodeHelper
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_CompileTimeConstant
	 * Size -> 0x0060 (FullSize[0x00F8] - InheritedSize[0x0098])
	 */
	class UVoxelNode_CompileTimeConstant : public UVoxelNodeHelper
	{
	public:
		class FName                                                Name;                                                    // 0x0098(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EVoxelPinCategory                                          Type;                                                    // 0x00A0(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SAMY[0x7];                                   // 0x00A1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<class FName, class FString>                           Constants;                                               // 0x00A8(0x0050) Edit, Transient, EditConst, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelCoordinateNode
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelCoordinateNode : public UVoxelNodeWithDependencies
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_XF
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_XF : public UVoxelCoordinateNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_YF
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_YF : public UVoxelCoordinateNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_ZF
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_ZF : public UVoxelCoordinateNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_GlobalX
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_GlobalX : public UVoxelCoordinateNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_GlobalY
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_GlobalY : public UVoxelCoordinateNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_GlobalZ
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_GlobalZ : public UVoxelCoordinateNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_LocalToGlobal
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_LocalToGlobal : public UVoxelNodeWithContext
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_GlobalToLocal
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_GlobalToLocal : public UVoxelNodeWithContext
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_TransformVector
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_TransformVector : public UVoxelNodeWithContext
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_InverseTransformVector
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_InverseTransformVector : public UVoxelNodeWithContext
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_Curve
	 * Size -> 0x0008 (FullSize[0x0158] - InheritedSize[0x0150])
	 */
	class UVoxelNode_Curve : public UVoxelExposedNode
	{
	public:
		class UCurveFloat*                                         Curve;                                                   // 0x0150(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_CurveColor
	 * Size -> 0x0008 (FullSize[0x0158] - InheritedSize[0x0150])
	 */
	class UVoxelNode_CurveColor : public UVoxelExposedNode
	{
	public:
		class UCurveLinearColor*                                   Curve;                                                   // 0x0150(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_DataAssetSampler
	 * Size -> 0x0010 (FullSize[0x0160] - InheritedSize[0x0150])
	 */
	class UVoxelNode_DataAssetSampler : public UVoxelExposedNode
	{
	public:
		class UVoxelDataAsset*                                     Asset;                                                   // 0x0150(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bBilinearInterpolation;                                  // 0x0158(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SAF0[0x7];                                   // 0x0159(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelMaterialNode
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelMaterialNode : public UVoxelNodeHelper
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_MakeMaterialFromSingleIndex
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_MakeMaterialFromSingleIndex : public UVoxelMaterialNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_GetDoubleIndex
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_GetDoubleIndex : public UVoxelMaterialNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_MakeMaterialFromColor
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_MakeMaterialFromColor : public UVoxelMaterialNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_MakeMaterialFromDoubleIndex
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_MakeMaterialFromDoubleIndex : public UVoxelMaterialNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_CreateDoubleIndexMaterial
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_CreateDoubleIndexMaterial : public UVoxelMaterialNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelSetterNode
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelSetterNode : public UVoxelNodeHelper
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_MaterialSetter
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_MaterialSetter : public UVoxelSetterNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_SetDoubleIndex
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_SetDoubleIndex : public UVoxelNode_MaterialSetter
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_WorldGeneratorSampler
	 * Size -> 0x0078 (FullSize[0x01C8] - InheritedSize[0x0150])
	 */
	class UVoxelNode_WorldGeneratorSampler : public UVoxelExposedNode
	{
	public:
		struct FVoxelGeneratorPicker                               WorldGenerator;                                          // 0x0150(0x0068) Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class FName>                                        Seeds;                                                   // 0x01B8(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_XI
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_XI : public UVoxelNodeHelper
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_YI
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_YI : public UVoxelNodeHelper
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_ZI
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_ZI : public UVoxelNodeHelper
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_PerlinWormDistance
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_PerlinWormDistance : public UVoxelNodeHelper
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelExample_Cave
	 * Size -> 0x0040 (FullSize[0x0070] - InheritedSize[0x0030])
	 */
	class UVoxelExample_Cave : public UVoxelGraphGeneratorHelper
	{
	public:
		float                                                      Bottom_Noise_Frequency;                                  // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Bottom_Noise_Scale;                                      // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Bottom_Noise_Seed;                                       // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Global_Height_Seed;                                      // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Top_Noise_Seed;                                          // 0x0040(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Top_Noise_Frequency;                                     // 0x0044(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Top_Noise_Scale;                                         // 0x0048(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Bottom_Top_Merge_Smoothness;                             // 0x004C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Global_Height_Merge_Smoothness;                          // 0x0050(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Global_Height_Noise_Frequency;                           // 0x0054(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Global_Height_Noise_Scale;                               // 0x0058(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Global_Height_Offset;                                    // 0x005C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Cave_Height;                                             // 0x0060(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Cave_Radius;                                             // 0x0064(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Cave_Walls_Smoothness;                                   // 0x0068(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Z2PZ[0x4];                                   // 0x006C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelExample_Cliffs
	 * Size -> 0x0030 (FullSize[0x0060] - InheritedSize[0x0030])
	 */
	class UVoxelExample_Cliffs : public UVoxelGraphGeneratorHelper
	{
	public:
		float                                                      Cliffs_Slope;                                            // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Height;                                                  // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Overhangs;                                               // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Base_Shape_Frequency;                                    // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Base_Shape_Offset;                                       // 0x0040(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Base_Shape_Seed;                                         // 0x0044(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Sides_Noise_Seed;                                        // 0x0048(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Top_Noise_Seed;                                          // 0x004C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Sides_Noise_Amplitude;                                   // 0x0050(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Sides_Noise_Frequency;                                   // 0x0054(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Top_Noise_Frequency;                                     // 0x0058(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Top_Noise_Scale;                                         // 0x005C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelExample_FloatingIslandOnion
	 * Size -> 0x0018 (FullSize[0x0048] - InheritedSize[0x0030])
	 */
	class UVoxelExample_FloatingIslandOnion : public UVoxelGraphGeneratorHelper
	{
	public:
		float                                                      Height;                                                  // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Perturb_Amplitude;                                       // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Perturb_Frequency;                                       // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Seed;                                                    // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Top_Noise_Frequency;                                     // 0x0040(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Top_Noise_Height;                                        // 0x0044(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelExample_HeightmapComposition
	 * Size -> 0x00B0 (FullSize[0x00E0] - InheritedSize[0x0030])
	 */
	class UVoxelExample_HeightmapComposition : public UVoxelGraphGeneratorHelper
	{
	public:
		float                                                      Depth;                                                   // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Flip_X;                                                  // 0x0034(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Flip_Y;                                                  // 0x0035(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_08ZK[0x2];                                   // 0x0036(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              heightmap_x0_y0[0x28];                                   // 0x0036(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              heightmap_x0_y1[0x28];                                   // 0x0060(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              heightmap_x1_y0[0x28];                                   // 0x0088(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              heightmap_x1_y1[0x28];                                   // 0x00B0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		float                                                      Size_X;                                                  // 0x00D8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Size_Y;                                                  // 0x00DC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelExample_HollowPlanet
	 * Size -> 0x0020 (FullSize[0x0050] - InheritedSize[0x0030])
	 */
	class UVoxelExample_HollowPlanet : public UVoxelGraphGeneratorHelper
	{
	public:
		float                                                      Intersection_Smoothness;                                 // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Noise_Bias;                                              // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Noise_Frequency;                                         // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Noise_Scale;                                             // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Radius;                                                  // 0x0040(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Seed;                                                    // 0x0044(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Use_IQ_Noise;                                            // 0x0048(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OI5H[0x7];                                   // 0x0049(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelExample_IQNoise
	 * Size -> 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
	 */
	class UVoxelExample_IQNoise : public UVoxelGraphGeneratorHelper
	{
	public:
		float                                                      Frequency;                                               // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Height;                                                  // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Seed;                                                    // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KO0Z[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelExample_LayeredPlanet
	 * Size -> 0x0038 (FullSize[0x0068] - InheritedSize[0x0030])
	 */
	class UVoxelExample_LayeredPlanet : public UVoxelGraphGeneratorHelper
	{
	public:
		float                                                      Frequency;                                               // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4F3W[0x4];                                   // 0x0034(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              None1[0x28];                                             // 0x0034(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		int32_t                                                    Seed;                                                    // 0x0060(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Slice_Mode;                                              // 0x0064(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6UKS[0x3];                                   // 0x0065(0x0003) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelExample_LayeredWorld
	 * Size -> 0x0038 (FullSize[0x0068] - InheritedSize[0x0030])
	 */
	class UVoxelExample_LayeredWorld : public UVoxelGraphGeneratorHelper
	{
	public:
		float                                                      Frequency;                                               // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KLZW[0x4];                                   // 0x0034(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              None1[0x28];                                             // 0x0034(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		int32_t                                                    Seed;                                                    // 0x0060(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_J5FL[0x4];                                   // 0x0064(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelExample_Planet
	 * Size -> 0x0068 (FullSize[0x0098] - InheritedSize[0x0030])
	 */
	class UVoxelExample_Planet : public UVoxelGraphGeneratorHelper
	{
	public:
		float                                                      Frequency;                                               // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Noise_Seed;                                              // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Noise_Strength;                                          // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_I8SN[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              PlanetColorCurve[0x28];                                  // 0x003C(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              PlanetCurve[0x28];                                       // 0x0068(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		float                                                      Radius;                                                  // 0x0090(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5W5N[0x4];                                   // 0x0094(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelExample_Ravines
	 * Size -> 0x0018 (FullSize[0x0048] - InheritedSize[0x0030])
	 */
	class UVoxelExample_Ravines : public UVoxelGraphGeneratorHelper
	{
	public:
		float                                                      _3D_Noise_Frequency;                                     // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    _3D_Noise_Seed;                                          // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Bottom_Transition_Smoothness;                            // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Height;                                                  // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Top_Transition_Smoothness;                               // 0x0040(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_T4AX[0x4];                                   // 0x0044(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelExample_RingWorld
	 * Size -> 0x0160 (FullSize[0x0190] - InheritedSize[0x0030])
	 */
	class UVoxelExample_RingWorld : public UVoxelGraphGeneratorHelper
	{
	public:
		float                                                      Radius;                                                  // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RingEdgesHardness;                                       // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Scale;                                                   // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Thickness;                                               // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Width_in_Degrees;                                        // 0x0040(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RiverDepth;                                              // 0x0044(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RiverWidth;                                              // 0x0048(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        BeachColor;                                              // 0x004C(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        MountainsColorHigh;                                      // 0x005C(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        MountainsColorLowHigh;                                   // 0x006C(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        MountainsColorLowLow;                                    // 0x007C(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RRAD[0x4];                                   // 0x008C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		unsigned char                                              MoutainsMaskCurve[0x28];                                 // 0x008C(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		struct FLinearColor                                        PlainsColorHigh;                                         // 0x00B8(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        PlainsColorLow;                                          // 0x00C8(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PlainsNoiseFrequency;                                    // 0x00D8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PlainsNoiseHeight;                                       // 0x00DC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              PlainsNoiseStrengthCurve[0x28];                          // 0x00E0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		unsigned char                                              RingMainShapeCurve[0x28];                                // 0x0108(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		struct FLinearColor                                        RingOuterColor;                                          // 0x0130(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        RiverColor;                                              // 0x0140(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              RiverDepthCurve[0x28];                                   // 0x0150(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		float                                                      MountainsNoiseFrequency;                                 // 0x0178(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MountainsNoiseHeight;                                    // 0x017C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BaseNoiseFrquency;                                       // 0x0180(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BaseNoiseHeight;                                         // 0x0184(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BaseHeight;                                              // 0x0188(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_I9EL[0x4];                                   // 0x018C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelExample_Tool_NoisyColors
	 * Size -> 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
	 */
	class UVoxelExample_Tool_NoisyColors : public UVoxelGraphGeneratorHelper
	{
	public:
		struct FLinearColor                                        Color;                                                   // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_SetColor
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_SetColor : public UVoxelNode_MaterialSetter
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_SetSingleIndex
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_SetSingleIndex : public UVoxelNode_MaterialSetter
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_SetMultiIndexWetness
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_SetMultiIndexWetness : public UVoxelNode_MaterialSetter
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_AddMultiIndex
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_AddMultiIndex : public UVoxelNode_MaterialSetter
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_SetUVs
	 * Size -> 0x0008 (FullSize[0x00A0] - InheritedSize[0x0098])
	 */
	class UVoxelNode_SetUVs : public UVoxelNode_MaterialSetter
	{
	public:
		bool                                                       bSetU;                                                   // 0x0098(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSetV;                                                   // 0x0099(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9KBE[0x6];                                   // 0x009A(0x0006) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_SetNode
	 * Size -> 0x0028 (FullSize[0x00C0] - InheritedSize[0x0098])
	 */
	class UVoxelNode_SetNode : public UVoxelSetterNode
	{
	public:
		uint32_t                                                   Index;                                                   // 0x0098(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FVoxelGraphOutput                                   CachedOutput;                                            // 0x009C(0x0020) NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_VMXR[0x4];                                   // 0x00BC(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_SetValueNode
	 * Size -> 0x0000 (FullSize[0x00C0] - InheritedSize[0x00C0])
	 */
	class UVoxelNode_SetValueNode : public UVoxelNode_SetNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_FunctionSeparator
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_FunctionSeparator : public UVoxelNodeHelper
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_FlowMerge
	 * Size -> 0x0010 (FullSize[0x0068] - InheritedSize[0x0058])
	 */
	class UVoxelNode_FlowMerge : public UVoxelNode
	{
	public:
		TArray<struct FVoxelNamedDataPin>                          Types;                                                   // 0x0058(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_SampleFoliageMaterialIndex
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class UVoxelNode_SampleFoliageMaterialIndex : public UVoxelNodeWithContext
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VoxelGraph.VoxelNode_GetBiomeIndex
	 * Size -> 0x0008 (FullSize[0x0158] - InheritedSize[0x0150])
	 */
	class UVoxelNode_GetBiomeIndex : public UVoxelExposedNode
	{
	public:
		class UVoxelFoliageBiomeBase*                              Biome;                                                   // 0x0150(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
